{
    "000000001268": {
        "Is the woman with the brown handbag standing beside the path?": "Yes",
        "Are there people sitting near the path in the image?": "Yes",
        "Can boats be seen in the water in the background?": "Yes",
        "Are there people sitting near the path?": "Yes",
        "Is the woman capturing a picture beside the path?": "Yes"
    },
    "000000001761": {
        "Are the aeroplanes flying in the top part of the image?": "Yes",
        "Is the wall located on the left side of the image?": "Yes",
        "Are the people standing near the trees in the bottom left corner of the image?": "Yes",
        "Are the aeroplanes flying above the bridge?": "Yes",
        "Is the wall located to the left of the bridge?": "Yes"
    },
    "000000002299": {
        "Are the boys sitting on the floor at the bottom of the image?": "Yes",
        "Is there a window in the top left corner of the image?": "Yes",
        "Are the children in the back row standing on the bench?": "Yes",
        "Are the boys sitting on the floor in front of the girls who are sitting on the bench?": "Yes",
        "Are brick walls on the background?": "Yes"
    },
    "000000002685": {
        "Is the man wearing a blue shirt and white cap standing in the front of the image?": "Yes",
        "Is there a barrel on the right side of the man wearing a blue shirt?": "Yes",
        "Is the rack with glasses located behind the man in the brown jacket?": "Yes",
        "Is the barrel with boxes kept near the man in the brown jacket?": "No",
        "Are the bottles on the table located to the left of the man wearing a blue shirt and white cap?": "Yes"
    },
    "000000003934": {
        "Is the couch positioned on the right side of the image?": "Yes",
        "Are there stairs on the left side of the image?": "Yes",
        "Is there a table with a remote on it on the floor?": "Yes",
        "Is the couch located on the right side of the image?": "Yes",
        "Are there pillows on the couch?": "Yes"
    },
    "000000004134": {
        "Is the person wearing the blazer and yellow tie on the right side of the image?": "Yes",
        "Is the table with plates, glasses, and tissues positioned to the side of the two people?": "Yes",
        "Is the person wearing a bag in the back of the image?": "Yes",
        "Is the person wearing the blazer and yellow tie holding a paper?": "Yes",
        "Is the table with plates, glasses, and tissues to the side of the two people?": "Yes"
    },
    "000000005001": {
        "Is the road located at the bottom of the image?": "Yes",
        "Is the person holding a camera on the right side of the image?": "Yes",
        "Is the man standing in the middle of the image smiling?": "Yes",
        "Is there a person holding a camera on the right side of the image?": "Yes",
        "Is the girl in the middle of the image holding something in her hand while wearing a helmet and a jacket?": "Yes"
    },
    "000000005037": {
        "Is the person with the suitcase on the right side of the bus?": "Yes",
        "Is the group of people standing on the left side of the bus?": "Yes",
        "Are the house and windows located on the left side of the image?": "Yes",
        "Is the group of people on the left side of the bus?": "Yes",
        "Is the person with suitcase on the right side of the bus?": "Yes"
    },
    "000000008690": {
        "Are the girls standing behind the goat?": "Yes",
        "Is there a person's hand on the white goat in the bottom right corner?": "Yes",
        "Is there a person walking on the street in the top left corner?": "Yes",
        "Are the two girls standing behind both goats?": "No",
        "Is the person's hand touching the black goat?": "No"
    },
    "000000009400": {
        "Are the laptops placed on the table in front of the people sitting on chairs?": "Yes",
        "Are the lights located in the right corner of the room?": "Yes",
        "Is there another room on the left corner where a woman in a red shirt is?": "Yes",
        "Are the laptops placed on the table?": "Yes",
        "Is the woman wearing a hat located in the left corner of the room?": "Yes"
    },
    "000000009483": {
        "Is the man standing to the left of the table?": "Yes",
        "Are the green chairs visible through the window's reflection?": "Yes",
        "Is the mouse positioned on the right side of the keyboard on the table?": "Yes",
        "Is the system placed on the table?": "Yes",
        "Is the man's reflection visible in the window?": "Yes"
    },
    "000000009590": {
        "Is there a glass window on the right side of the image?": "Yes",
        "Is the cupboard at the center of the image?": "Yes",
        "Is the clock on a wall at the left side of the image?": "Yes",
        "Is the glass window located on the right side of the dining table?": "Yes",
        "Is the clock positioned on the wall to the left of the cupboard?": "Yes"
    },
    "000000009772": {
        "Is the man holding a camera located in the center of the image?": "Yes",
        "Is the television positioned in the top right corner of the image?": "Yes",
        "Is the bathtub located in the bottom left corner of the image?": "Yes",
        "Is the man located in front of the mirror holding a camera?": "Yes",
        "Is the television located near the door in the top right corner?": "Yes"
    },
    "000000010707": {
        "Are the two persons sitting on the red couch positioned towards the right side of the image?": "Yes",
        "Is the person wearing the white t-shirt standing on the left side of the two sitting persons?": "Yes",
        "Is the lantern lamp with stand located in the corner of the room?": "Yes",
        "Are the two persons sitting on the couch beside the person wearing the white t-shirt standing?": "Yes",
        "Is the blanket on the same couch as the laptop?": "Yes"
    },
    "000000011511": {
        "Is the statue positioned on a stone bench?": "Yes",
        "Are the group of people standing beside a shutter on the ground in the background of the image?": "Yes",
        "Is the vehicle on the right side of the image?": "Yes",
        "Is the statue placed on the stone bench?": "Yes",
        "Is the vehicle beside the shutter on the ground?": "Yes"
    },
    "000000012639": {
        "Is the boy in the white t-shirt positioned in the center of the image?": "Yes",
        "Is the man on the right standing on the ground?": "Yes",
        "Are the group of people sitting on the green grass located in the top left corner?": "Yes",
        "Is the boy holding the bat standing next to another person?": "Yes",
        "Are there people sitting under the tree in the top left corner?": "Yes"
    },
    "000000012670": {
        "Is there a lady wearing a scarf in the middle of the image?": "Yes",
        "Is the lady wearing specs located on the left side of the image?": "Yes",
        "Is the teddy bear positioned behind the lady wearing a scarf?": "Yes",
        "Is the lady wearing a scarf in front of the teddy bear?": "Yes",
        "Is the person with the green bag positioned in the back?": "Yes"
    },
    "000000013659": {
        "Is the man with the laptop positioned at the bottom of the image?": "Yes",
        "Are the three persons on the right standing near a round table?": "Yes",
        "Is there a shelter in the top left corner of the image?": "Yes",
        "Is the man sitting on the chair working on the laptop part of the group near the round table?": "No",
        "Are the three people near the round table working on the same papers?": "Yes"
    },
    "000000013729": {
        "Are the four persons standing beside the couch?": "Yes",
        "Is there a basket with papers under the table on the right side?": "Yes",
        "Are there some clothes on the couch?": "Yes",
        "Are the persons standing beside the couch?": "Yes",
        "Is there a basket under the table with papers?": "Yes"
    },
    "000000016228": {
        "Is the horse positioned in the center of the image?": "Yes",
        "Are there people sitting on a bench on the right side of the image?": "Yes",
        "Is there sky visible at the top of the image?": "Yes",
        "Is the bus attached to the horse?": "Yes",
        "Are there people sitting on the bench on the right?": "Yes"
    },
    "000000017899": {
        "Is the table with bakery items positioned in the front of the image?": "Yes",
        "Is the woman with the apron standing on the left side of the image?": "Yes",
        "Is there a couch visible beside the door in the image?": "Yes",
        "Is the woman standing to the left side of the table?": "Yes",
        "Are the chairs positioned beside the table?": "Yes"
    },
    "000000018380": {
        "Is the table positioned in the center of the room?": "Yes",
        "Are the stairs located behind the woman wearing the blue dress?": "Yes",
        "Are photo frames visible on the wall to the left side of the room?": "Yes",
        "Are the people sitting around the table?": "Yes",
        "Is there a wall with photo frames behind the people?": "Yes"
    },
    "000000019109": {
        "Are the posters located on the left side of the image?": "Yes",
        "Is the shop with a signboard on the right side of the image?": "Yes",
        "Are the vehicles parked in the image?": "Yes",
        "Are the vehicles parked in front of the building?": "Yes",
        "Is the stand with posters located on the left side of the image?": "Yes"
    },
    "000000020553": {
        "Is the recliner chair positioned on the left side of the image?": "Yes",
        "Is the table to the right of the recliner chair?": "Yes",
        "Are there toys beside the recliner chair?": "Yes",
        "Is the teddy bear on the recliner chair?": "Yes",
        "Is the telephone on the table?": "Yes"
    },
    "000000020571": {
        "Are the boats positioned on the left side of the image near the river?": "Yes",
        "Is there a vehicle visible above the river's surface in the image?": "Yes",
        "Are there two people standing far from the boats on the right side of the image?": "Yes",
        "Are the boats on the river?": "Yes",
        "Are the two persons standing far from the boats?": "Yes"
    },
    "000000023034": {
        "Is the man with the blue shirt standing on the right side of the image?": "Yes",
        "Are there two horses in the middle of the image?": "Yes",
        "Are there trees and rocks in the background of the image?": "Yes",
        "Is the man in the blue shirt standing to the right of the horses?": "Yes",
        "Is there a person sitting on the front horse?": "Yes"
    },
    "000000025181": {
        "Is the train located on the right side of the image?": "Yes",
        "Are the people sitting on a bench on the left side of the image?": "Yes",
        "Are the mountains visible in the background of the image?": "Yes",
        "Are the two people sitting on the bench near the buildings?": "Yes",
        "Is the man standing on the ground closer to the railway track than the train?": "Yes"
    },
    "000000025603": {
        "Is there a girl sitting on the bottom right side of the image holding food?": "Yes",
        "Are there tables and chairs with glasses and papers on the bottom left side of the image?": "Yes",
        "Are there people dining and lights in the top right side of the image?": "Yes",
        "Is the girl holding food while a book is on the table?": "Yes",
        "Are there people sitting and dining near where the lights are located?": "Yes"
    },
    "000000026564": {
        "Is the computer positioned on the table in the center of the image?": "Yes",
        "Is there a photo frame on the right side wall of the image?": "Yes",
        "Are there cement poles visible in the background through the glass window?": "Yes",
        "Is the laptop positioned to the right of the computer?": "Yes",
        "Is the photo frame on the wall to the right of the table?": "Yes"
    },
    "000000026690": {
        "Is the man in the grey t-shirt positioned on the left side of the image?": "Yes",
        "Is the \"Garnier\" black board located in front of the people standing?": "Yes",
        "Is the man wearing the black t-shirt and white and yellow helmet ice skating on the right corner of the image?": "Yes",
        "Is the man in the grey t-shirt standing near the black board with \"Garnier\" written on it?": "Yes",
        "Is the man wearing the helmet ice skating on the right corner of the picture?": "Yes"
    },
    "000000031296": {
        "Is there a woman filling Coca Cola on the left side of the image?": "No",
        "Are the sauce bottles placed on the table in the center of the image?": "Yes",
        "Are the paper glasses located on the shelf in the background of the image?": "Yes",
        "Are the people sitting around the table where there are sauce bottles and tissues?": "Yes",
        "Are there paper glasses on the shelf?": "Yes"
    },
    "000000031620": {
        "Is the cake positioned on the table in front of the couple?": "Yes",
        "Is the speaker located behind the couple?": "Yes",
        "Is there a chair on the right side of the image?": "Yes",
        "Is the cake on the table in front of the couple?": "Yes",
        "Is the mic placed on the table behind the couple?": "Yes"
    },
    "000000032887": {
        "Is there a person standing on the left side of the image holding a stick?": "Yes",
        "Are there rocks and small stones at the bottom of the image?": "Yes",
        "Are there boards in the center of the image?": "Yes",
        "Are both people holding a stick?": "Yes",
        "Are the stairs positioned on the left side of the image?": "Yes"
    },
    "000000033104": {
        "Is the person in the white suit located in the middle of the image?": "Yes",
        "Is the orange box positioned at the edge of the picture?": "Yes",
        "Is there a blue mesh located in the middle of the image?": "Yes",
        "Is the person in the black suit shaking hands with the person in the white suit?": "Yes",
        "Is the orange box located at the edge of the picture?": "Yes"
    },
    "000000033221": {
        "Is the woman holding a tennis bat on the right side of the image?": "Yes",
        "Are the four people walking on sand in the middle of the image?": "Yes",
        "Is the flag behind the vehicle on the left side of the image?": "Yes",
        "Is the woman on the right side holding a tennis bat?": "Yes",
        "Is there a flag behind the vehicle in the background?": "Yes"
    },
    "000000033638": {
        "Is the woman standing to the left of the stove?": "Yes",
        "Is the pot on the stove positioned beside the pan?": "Yes",
        "Is the cupboard located in the background of the image?": "Yes",
        "Is the woman holding a pen while standing near the stove?": "Yes",
        "Are there vessels on the cupboard in the background?": "Yes"
    },
    "000000034417": {
        "Is the red box positioned to the right of the \"danger hot\" sticker on the machine?": "Yes",
        "Are there trays positioned in the center of the image?": "Yes",
        "Is the person with the white t-shirt holding a white tub on the left side of the image?": "Yes",
        "Is the red box with a pipe attached to the right of the machine with the \"danger hot\" sticker?": "Yes",
        "Are the trays located in the center relative to the machine and the green drum?": "Yes"
    },
    "000000036936": {
        "Is the table positioned in front of the couch?": "Yes",
        "Are the television and speakers located on the left side of the image?": "Yes",
        "Is the chips packet on the table closer to the man?": "Yes",
        "Is the man holding an object in his hand while sitting on the couch?": "Yes",
        "Are the speakers located in the background next to the television?": "Yes"
    },
    "000000038678": {
        "Is the donut on a plate being held up in the image?": "Yes",
        "Are there men standing behind the woman in the picture?": "Yes",
        "Is there a building visible through the window in the picture?": "Yes",
        "Are the men standing behind the woman?": "Yes",
        "Is the tea cup on the table?": "Yes"
    },
    "000000038829": {
        "Are there two people riding a bicycle in the image?": "Yes",
        "Is there a red motorcycle wheel on the left side of the image?": "Yes",
        "Is there a woman sitting on a scooty in the image?": "Yes",
        "Are there two people riding the same bicycle?": "Yes",
        "Is there a man standing near the woman riding the scooty?": "Yes"
    },
    "000000039480": {
        "Is the woman holding a tennis bat positioned in the center of the image?": "Yes",
        "Is the board with the crocodile image on the top right corner of the image?": "Yes",
        "Are the legs of a person visible in the top left corner of the image?": "Yes",
        "Is the woman holding the tennis bat in the foreground of the image?": "Yes",
        "Is the board with the crocodile image located on the top right corner of the image?": "Yes"
    },
    "000000044279": {
        "Is the man wearing a white color shirt standing on the right side of the image?": "Yes",
        "Is there a table with a tray and some food on the left side of the image?": "Yes",
        "Is the shelf in the background between the men?": "Yes",
        "Is the man on the left side holding something in his hand?": "Yes",
        "Is there a shelf in the background?": "Yes"
    },
    "000000046497": {
        "Is the person wearing the hat positioned on the left side of the person in pink?": "Yes",
        "Is the orange tube located to the right of the two people sitting?": "Yes",
        "Is there water visible in the background of the image?": "Yes",
        "Is the person wearing the hat sitting on the ship?": "Yes",
        "Is the orange tube to the right of the two people sitting?": "Yes"
    },
    "000000046872": {
        "Is the long blue Mac Truck positioned on the left side of the image?": "Yes",
        "Is the man wearing a blue t-shirt standing behind the truck?": "Yes",
        "Are the four cars parked behind the small shed warehouse?": "Yes",
        "Is the yellow pipe held by the man in the white t-shirt?": "Yes",
        "Is the man in the blue t-shirt near the black pipe machine instrument?": "Yes"
    },
    "000000047112": {
        "Is the pizza on a table in the foreground of the image?": "Yes",
        "Are there photos on the wall in the room?": "Yes",
        "Can a person's hand be seen on the right side of the image?": "Yes",
        "Is the pizza placed on the table?": "Yes",
        "Are there photos on the wall?": "Yes"
    },
    "000000047585": {
        "Is the lady with the white frock standing to the left of the image?": "Yes",
        "Is the man with the black jacket holding the umbrella beside the lady?": "Yes",
        "Are there two people standing to the right side of the building in the background?": "Yes",
        "Is the lady holding flowers in her right hand?": "Yes",
        "Is the man beside the lady holding an umbrella?": "Yes"
    },
    "000000047828": {
        "Is the boat floating on the left side of the image?": "Yes",
        "Are the street lights located on the left side of the image?": "Yes",
        "Is the tower visible on the right side of the image?": "Yes",
        "Is the boat floating on the water on the left side of the image?": "Yes",
        "Are the group of people standing together on the roadside?": "Yes"
    },
    "000000048396": {
        "Is the woman with the knife positioned on the left side of the image?": "Yes",
        "Is the red-colored cake located on the table in front of the boy?": "Yes",
        "Are the clothes visible in the background of the image?": "Yes",
        "Is the boy standing next to the table?": "Yes",
        "Is the woman holding the knife standing to the left of the boy?": "Yes"
    },
    "000000048504": {
        "Is the blue elephant positioned in the center of the image?": "Yes",
        "Is the woman on the right side of the image?": "Yes",
        "Are the benches located behind the elephants in the ring?": "Yes",
        "Is the small elephant behind the two larger elephants?": "Yes",
        "Are there two lights on either side of the ring?": "Yes"
    },
    "000000049091": {
        "Are the boards with text positioned in the middle of the buildings?": "Yes",
        "Are there buildings on the right side of the image?": "Yes",
        "Are there vehicles on the road at the bottom of the image?": "Yes",
        "Are the boards with text tied between the buildings?": "Yes",
        "Are there vehicles on the floor at the bottom of the image?": "Yes"
    },
    "000000049759": {
        "Is the person holding the volleyball on the right side of the image?": "Yes",
        "Is there a pole and net in the center of the image?": "Yes",
        "Are the light, camera, and speaker located at the top of the image?": "Yes",
        "Is the person wearing a blue dress holding a volleyball on the right side of the pitch?": "Yes",
        "Is the pole and net in the center of the pitch?": "Yes"
    },
    "000000050145": {
        "Is the rickshaw positioned beside the man on the road?": "Yes",
        "Is there a store positioned beside the man?": "Yes",
        "Are the umbrella, hoarding, and electric pole located at the back side of the image?": "Yes",
        "Is the man holding the handle of the rickshaw beside him on the road?": "Yes",
        "Is the girl with the bag walking on the road near the store and building?": "Yes"
    },
    "000000052007": {
        "Is the bus positioned on the road?": "Yes",
        "Is the man with the black jacket getting inside the bus from the footpath?": "Yes",
        "Are the plants with flowers located at the bottom left of the image?": "Yes",
        "Is the man with the black jacket getting inside the bus?": "Yes",
        "Are there many plants in front of the building to the left?": "Yes"
    },
    "000000052996": {
        "Are the three persons standing on the right side of the image?": "Yes",
        "Is there a refrigerator visible in the back side of the persons?": "Yes",
        "Are there boxes kept on the floor?": "Yes",
        "Are the three persons standing in front of the refrigerator?": "Yes",
        "Is there a bowl on the table in the left corner?": "Yes"
    },
    "000000053626": {
        "Are the four people positioned in the center of the image?": "Yes",
        "Is there a current pole with wires on the right side of the image?": "Yes",
        "Are the trees located in the left corner of the image?": "Yes",
        "Are the people standing in the middle of the image?": "Yes",
        "Is the current pole located in the right corner of the image?": "Yes"
    },
    "000000054592": {
        "Is there a man standing at the center of the image?": "Yes",
        "Is the rod positioned on the left side of the image?": "No",
        "Is there snow all around the area of the image?": "Yes",
        "Is there a rope connecting the two men?": "Yes",
        "Is the rod located to the right of the standing man?": "Yes"
    },
    "000000054605": {
        "Is the plate with the cake in the lower part of the image?": "Yes",
        "Is the person in the background wearing a white dress on the left side of the image?": "No",
        "Are the forks placed on the tissue on the table?": "Yes",
        "Is the cake on the plate located on the table?": "Yes",
        "Is the person wearing a white dress sitting in front of the table?": "Yes"
    },
    "000000054654": {
        "Is the person holding a plate positioned in the center of the image?": "Yes",
        "Are the posters located on the left side of the wall?": "No",
        "Are the pans visible on the right side of the image?": "Yes",
        "Is the person holding a plate near the stove?": "Yes",
        "Are there pans hanging on the right side wall?": "Yes"
    },
    "000000055022": {
        "Is the pink bicycle with decorations positioned in the foreground of the image?": "Yes",
        "Is the man sitting on the left side of the background?": "Yes",
        "Is the bicycle hanging on the wall located above the other bicycles?": "Yes",
        "Are the bicycles arranged in an order?": "Yes",
        "Is another bicycle hanging on the wall?": "Yes"
    },
    "000000057597": {
        "Is the football positioned in the middle of the image?": "Yes",
        "Are the people running on the right side of the image?": "Yes",
        "Is there a brown color wall in the background?": "Yes",
        "Is the football located in the middle of the ground?": "Yes",
        "Are there people sitting in the background?": "Yes"
    },
    "000000060932": {
        "Is the woman in the black dress positioned in the center of the image?": "Yes",
        "Are the two kids standing near a table in the image?": "Yes",
        "Is the man in the white suit on the right side of the image?": "Yes",
        "Are the two kids standing near the table?": "Yes",
        "Is the chandelier light on the top of the image?": "Yes"
    },
    "000000062353": {
        "Are the giraffes and deer located in the center of the image?": "Yes",
        "Are the people standing and talking on the left side of the image?": "Yes",
        "Is there sand and a gate on the right side of the image?": "Yes",
        "Are the giraffes located near the gate?": "Yes",
        "Are the persons standing on the left side of the image?": "Yes"
    },
    "000000062808": {
        "Is the pizza positioned at the center of the table?": "Yes",
        "Are the doors and windows located on the left side of the image?": "Yes",
        "Is the person on the right side of the image taking the photo?": "Yes",
        "Is the pizza on the dining table between the two people?": "Yes",
        "Is the person on the right taking a photo of the scene?": "Yes"
    },
    "000000063740": {
        "Is the laptop positioned on the right side of the image?": "Yes",
        "Are the toys on the left side of the image?": "Yes",
        "Is the desk in front of the image?": "Yes",
        "Is the monitor beside the laptop?": "Yes",
        "Are there two toys on the left side of the image?": "Yes"
    },
    "000000065288": {
        "Are there some birds on the chairs in the foreground?": "Yes",
        "Is the bus located in the top left corner of the image?": "Yes",
        "Are there plants on the left side of the image?": "Yes",
        "Are there birds on the chairs in the foreground?": "Yes",
        "Is the bus located on the top left corner of the image?": "Yes"
    },
    "000000066231": {
        "Is the chef working at the table positioned in the center of the image?": "Yes",
        "Are the fruits in the box placed on the right side of the image?": "Yes",
        "Are there five people standing in the background?": "Yes",
        "Are the fruits placed on the right side of the image?": "Yes",
        "Are the five people standing in front of a table in the background?": "Yes"
    },
    "000000067406": {
        "Is the sky located at the top of the image?": "Yes",
        "Is the man flying the kite standing beside another man?": "Yes",
        "Is there a tree visible behind the men in the image?": "Yes",
        "Are there small poles forming a fence on the ground?": "Yes"
    },
    "000000067616": {
        "Are the vehicles located on the right side of the image?": "Yes",
        "Is the man walking on the roadside on the left side of the image?": "Yes",
        "Are the flags on top of the buildings in the image?": "Yes",
        "Are the vehicles on the same side of the street as the group of people sitting at the table?": "No",
        "Is the street light near the group of people who are sitting in front of the table?": "Yes"
    },
    "000000068093": {
        "Is the woman sitting on the bike located in the front of the image?": "Yes",
        "Are the pillars supporting a wooden rooftop positioned at the top of the image?": "Yes",
        "Is the bike behind the person standing next to the woman?": "Yes",
        "Is the woman sitting in front of the rooftop supported by pillars?": "Yes",
        "Are the bushes and plants located behind the people?": "Yes"
    },
    "000000071877": {
        "Is the man on the skateboard on the left side of the image?": "No",
        "Are the traffic cones located behind the man in the image?": "Yes",
        "Is the building in the bottom right corner of the image?": "Yes",
        "Is the man standing on the skateboard on the brick?": "Yes",
        "Are traffic cones in the background?": "Yes"
    },
    "000000073702": {
        "Is the man with the grey jacket standing on the left side of the image?": "Yes",
        "Is there an object with a green color to the top right of the image?": "Yes",
        "Is there a white vehicle in the background of the image?": "Yes",
        "Is the man with the blue shirt wearing a bag while holding a stick?": "Yes",
        "Is the vehicle in the background located to the right of the man with the grey jacket?": "Yes"
    },
    "000000074092": {
        "Is the woman jumping positioned in the center of the image?": "Yes",
        "Is the tennis ball right in front of the racket?": "Yes",
        "Are there people sitting on chairs in the background?": "Yes",
        "Is the woman holding a racket in front of the tennis ball?": "Yes",
        "Are there people standing behind the woman?": "Yes"
    },
    "000000074733": {
        "Is the person positioned on the top left side of the image?": "Yes",
        "Are the chairs positioned on the top right side of the image?": "Yes",
        "Is the mobile phone on the table in the background?": "Yes",
        "Is there a person on the top left side of the image?": "Yes",
        "Are the pizza slices on the wooden table?": "Yes"
    },
    "000000076468": {
        "Are the two women wearing white dresses standing on the tennis ground?": "Yes",
        "Is there a plastic cover in the middle of the image?": "Yes",
        "Are there two chairs in the bottom right corner of the image?": "Yes",
        "Are both women holding a racket?": "Yes",
        "Are the chairs located at the bottom right corner of the image?": "Yes"
    },
    "000000078748": {
        "Is the motor Harley Davidson banner in the middle of the image?": "Yes",
        "Are the two tents located in the top right corner of the image?": "Yes",
        "Is there a banner on the left top corner of the image?": "Yes",
        "Is the banner with 'Harley Davidson' situated in the middle of the image?": "Yes"
    },
    "000000079588": {
        "Is the clock tower in the center of the building?": "Yes",
        "Are there windows on the right side of the building?": "Yes",
        "Is the door located on the left side of the building?": "Yes",
        "Are the four persons standing in front of the building?": "Yes",
        "Is the clock tower located in the center of the building?": "Yes"
    },
    "000000082821": {
        "Are the boats parked on the side of the river?": "Yes",
        "Is a person riding a bicycle on the road?": "Yes",
        "Are the vehicles parked in the top left side of the image?": "Yes",
        "Is the person riding a bicycle on the road?": "Yes"
    },
    "000000084270": {
        "Is the shelf full of watches positioned in the center of the image?": "Yes",
        "Is the man with the red luggage towards the right side of the image?": "Yes",
        "Are the glass windows located at the top of the image?": "Yes",
        "Is the woman holding bags located behind the shelf full of watches?": "Yes",
        "Is the man carrying a bag positioned towards the left corner?": "Yes"
    },
    "000000084492": {
        "Is the bench on the right side of the image?": "Yes",
        "Is the building on the left side of the image?": "Yes",
        "Are the vehicles visible in the background?": "Yes",
        "Is the bench located to the right of the skateboarder?": "Yes",
        "Is the tree positioned behind the building?": "Yes"
    },
    "000000085157": {
        "Is the table covered with a cloth positioned in front of the group of people?": "Yes",
        "Are the trees with decorative lights located on top of the wall beside the people?": "Yes",
        "Is there a photo on the wall beside the people?": "Yes",
        "Are the people sitting in front of the table?": "Yes",
        "Are there trees with decorative lights above the wall?": "Yes"
    },
    "000000086582": {
        "Is the laptop positioned in the center of the wooden table?": "No",
        "Is the person watering the plants on the left side of the image?": "Yes",
        "Are the plant pots located on a table behind the wooden table?": "Yes",
        "Is the laptop on the wooden table?": "Yes",
        "Is the person watering the plants on the white table behind the wooden table?": "Yes"
    },
    "000000091500": {
        "Is there a chair and a mat on the right side of the image?": "Yes",
        "Are the cupboards, tap, and table located on the left side?": "Yes",
        "Is there a table with boxes, bottles, glass, and bowl in the background?": "Yes",
        "Is the table in the background positioned in front of the cupboards?": "Yes",
        "Are the two men sitting on chairs next to each other?": "Yes"
    },
    "000000092091": {
        "Is the teddy bear on the table in front of the person wearing a pink frock?": "Yes",
        "Are there two chairs to the left of the television?": "Yes",
        "Are there two photo frames on the wall behind the sofa?": "Yes",
        "Is the teddy bear on the table in front of the person?": "Yes",
        "Are the photo frames located on the wall behind the sofa?": "Yes"
    },
    "000000093437": {
        "Is the man with the blue jacket positioned in the center of the image?": "Yes",
        "Is the table with the glass and jar to the right side of the man?": "Yes",
        "Is there a chair and two lamps in the left corner of the image?": "Yes",
        "Is the man with the blue jacket standing in front of the window?": "Yes",
        "Is the lamp to the right of the table beside the chair?": "Yes"
    },
    "000000095862": {
        "Are people sitting in the front of the image watching the game?": "Yes",
        "Is the person wearing a cap on the left side of the image?": "Yes",
        "Are there banners and buildings in the background of the image?": "Yes",
        "Is there a net in front of the people watching the baseball game?": "Yes",
        "Is the person holding the bat wearing a helmet?": "Yes"
    },
    "000000099054": {
        "Is the yellow and black color pipe positioned near the front of the aeroplane in the foreground?": "Yes",
        "Are the buildings visible behind the aeroplanes?": "Yes",
        "Is the sky above the aeroplanes blue in color?": "Yes",
        "Are there any vehicles near the aeroplanes?": "Yes",
        "Are the persons on the path close to the aeroplanes?": "Yes"
    },
    "000000099114": {
        "Is the person holding a bag standing on the road?": "Yes",
        "Are the cycles parked on the left side of the walkway?": "Yes",
        "Is the traffic signal pole positioned in the center of the image?": "Yes",
        "Are the people walking on the walkway to the right of the road?": "Yes",
        "Is the sign board located in the center of the image?": "Yes"
    },
    "000000100510": {
        "Is the brown color horse jumping in the middle of the image?": "Yes",
        "Is a person holding a camera on the left side of the image?": "Yes",
        "Is there a building in the background?": "Yes",
        "Is the person sitting on the horse?": "Yes",
        "Are there flags on the poles in the image?": "Yes"
    },
    "000000102411": {
        "Are the two persons on the bike in the center of the image?": "Yes",
        "Is the lady with the white jacket on the left side of the image?": "Yes",
        "Are the sign boards located in the middle of the background?": "Yes",
        "Are the two people sitting on the bike?": "Yes",
        "Are the people sitting on the rocks near the tree?": "Yes"
    },
    "000000105912": {
        "Is the building positioned on the right side of the image?": "Yes",
        "Are the group of persons near the cars positioned on the left side of the image?": "Yes",
        "Is the flag positioned near the center of the image?": "No",
        "Is the woman with the camera standing near the fencing?": "Yes",
        "Are the people in the center standing near the bus?": "Yes"
    },
    "000000107226": {
        "Is the man on the bike wearing a grey helmet visible in the center of the image?": "Yes",
        "Are the group of huskies positioned in front of the bike?": "Yes",
        "Are the people with umbrellas located in the background?": "Yes",
        "Are the huskies tied to the three-wheeler bike?": "Yes",
        "Are the group of girls and boy in the background watching the event?": "Yes"
    },
    "000000107339": {
        "Is the woman standing in the middle of the image?": "Yes",
        "Is the girl sitting on the top right side of the image?": "No",
        "Are the two tables positioned in the middle of the image?": "Yes",
        "Is the girl sitting on the floor in front of the couch?": "Yes",
        "Are the two tables located in the middle of the image?": "Yes"
    },
    "000000108503": {
        "Are the two people standing on the sand near the ocean?": "Yes",
        "Is the building located on top of the hill in the image?": "Yes",
        "Are the trees situated between the people on the beach and the building on the hill?": "No",
        "Are the two people holding surfing boards while standing on the sand?": "Yes",
        "Are there people standing on the hill?": "Yes"
    },
    "000000109900": {
        "Is the white car positioned on the right side of the image?": "Yes",
        "Is the person wearing a white dress on the left side of the image?": "Yes",
        "Is there a mountain in the background of the image?": "Yes",
        "Is the person wearing a blue shirt behind the white car?": "Yes"
    },
    "000000110042": {
        "Is the toilet seat located in the center of the image?": "Yes",
        "Are the two women sitting in a tent on the right side of the image?": "Yes",
        "Is the person standing on the left side of the image?": "Yes",
        "Are the two women sitting inside the tent near the right side of the image?": "Yes",
        "Is the toilet seat located in front of the board with text in the middle of the image?": "Yes"
    },
    "000000112634": {
        "Is the giraffe walking on the sand in the center of the image?": "Yes",
        "Is the tub to the left side of the giraffe?": "Yes",
        "Is the shed to the right side of the fencing?": "Yes",
        "Is the big rock behind the tube?": "Yes"
    },
    "000000113720": {
        "Is the tablecloth green in color?": "Yes",
        "Is the woman holding food with a fork?": "Yes",
        "Is the man wearing glasses?": "Yes",
        "Is the woman holding a fork with food on it?": "Yes",
        "Are there napkins on the table with the food and drinks?": "Yes"
    },
    "000000114907": {
        "Is the woman standing in front of the group of people?": "Yes",
        "Is the cow located behind the woman?": "Yes",
        "Is the vehicle positioned behind the cow?": "Yes",
        "Is there a vehicle behind the cow?": "Yes"
    },
    "000000115870": {
        "Is the man with the black t-shirt and book sitting on the left side of the sofa?": "No",
        "Are the man with the yellow t-shirt and the lady with the black t-shirt sitting to the left of the sofa?": "Yes",
        "Is there a lady standing in front of the door?": "Yes",
        "Is the man with the black and grey t-shirt standing in front of the door?": "No",
        "Are the items on the table in front of the sofa?": "Yes"
    },
    "000000117645": {
        "Is the person trekking positioned towards the center of the image?": "Yes",
        "Is the tree covered with ice located on the left side of the image?": "Yes",
        "Are the two objects mentioned in the caption located at the bottom right of the image?": "Yes",
        "Is the tree located to the left side of the person?": "Yes",
        "Are there two objects below the picture on the right side?": "Yes"
    },
    "000000119365": {
        "Is the laptop positioned on the table?": "Yes",
        "Is the person holding a mobile phone on the right side?": "Yes",
        "Are the posters present on the wall in front of the people?": "Yes",
        "Is the mobile phone held by the person on the right side?": "Yes",
        "Are the posters located behind the people?": "Yes"
    },
    "000000121744": {
        "Is the man holding a racket positioned in the middle of the image?": "Yes",
        "Is the woman standing on the right side of the image?": "Yes",
        "Are there cameras being held by people at the top of the image?": "Yes",
        "Are there cameras visible at the top of the image?": "Yes"
    },
    "000000122962": {
        "Are the children sitting on the floor near the center of the image?": "Yes",
        "Is the green color cloth on the table towards the center of the image?": "Yes",
        "Is the cream color cupboard located at the back and slightly to the left in the image?": "Yes",
        "Are the children sitting on the floor around the plates of food?": "Yes",
        "Is there a green cloth on the table where the food items are placed?": "Yes"
    },
    "000000123213": {
        "Is the player with the blue helmet standing to the left of the player with the red helmet?": "Yes",
        "Is the person with the black helmet positioned on the right side of the image?": "Yes",
        "Are the people in the background located behind the railing?": "Yes",
        "Is the player wearing a blue helmet holding a baseball stick?": "Yes",
        "Are there people sitting and standing near the railing in the background?": "Yes"
    },
    "000000125129": {
        "Is the table covered with red cloth positioned in front of the man wearing a white dress?": "Yes",
        "Is the woman holding paper standing to the right of the man sitting?": "Yes",
        "Is there an empty chair visible in the image?": "Yes",
        "Is the man in white dress sitting on the chair?": "Yes",
        "Is the table covered with red cloth in front of the man in white dress?": "Yes"
    },
    "000000125572": {
        "Is the building positioned in the center of the image?": "Yes",
        "Is there a flag on the top of the building to the right?": "Yes",
        "Are the buses on the left side of the image?": "Yes",
        "Is the flag located on the top of the building to the right?": "Yes",
        "Is the clock tower positioned to the left of the building?": "Yes"
    },
    "000000127092": {
        "Is the sign board positioned on the left side of the image?": "No",
        "Are the buildings located at the back side of the image?": "Yes",
        "Is the woman on the left side of the image holding a bag?": "Yes",
        "Is the sign board located in front of the buildings?": "Yes",
        "Is the woman on the left side of the image with respect to the sign board?": "Yes"
    },
    "000000128476": {
        "Are the cakes positioned at the bottom of the image?": "Yes",
        "Are the two women standing at the center of the image?": "Yes",
        "Is there a plastic cover and one cup on the right side of the image?": "Yes",
        "Are the two women standing behind the group of cakes?": "Yes",
        "Are the cups located to the left of the image next to the boxes and some food items?": "Yes"
    },
    "000000130826": {
        "Are the two old persons sitting on the bench in the top left of the image?": "Yes",
        "Is the man wearing a black jacket located in the top left corner of the image?": "Yes",
        "Is there a group of persons standing near a table in the background?": "Yes",
        "Are the two old persons sitting on the bench near the center?": "Yes",
        "Is the man in a black jacket walking on a road in the top left corner?": "Yes"
    },
    "000000132375": {
        "Is the pot with flowers positioned to the right of the juice on the table?": "Yes",
        "Is there a red brick wall on the left side of the image?": "Yes",
        "Are the shops and a building visible in the background of the image?": "Yes",
        "Is the juice on the table?": "Yes",
        "Is the red brick wall to the left of the table?": "Yes"
    },
    "000000132544": {
        "Is the woman in red on the left side of the image?": "Yes",
        "Is the yellow ball located near the center of the image?": "Yes",
        "Is the blue umbrella positioned on the right side of the image?": "Yes",
        "Is the woman on the left side standing near a fence?": "Yes",
        "Is the baseball bat held by the woman on the right side?": "Yes"
    },
    "000000132796": {
        "Is the man in the middle sitting on an elephant?": "Yes",
        "Is there a woman behind the man in the middle?": "Yes",
        "Are there many trees in the background?": "Yes",
        "Is the man sitting on the elephant in the middle?": "Yes",
        "Are there trees in the background of the image?": "Yes"
    },
    "000000133819": {
        "Is the bus in the image moving on the road?": "Yes",
        "Are there two buses positioned behind the bus with passengers?": "Yes",
        "Is the traffic signal black in color?": "Yes",
        "Are there buses behind the bus with passengers inside?": "Yes",
        "Is there a camera attached to the pole at the traffic signal?": "Yes"
    },
    "000000135561": {
        "Is the fan positioned on the fridge?": "Yes",
        "Is the sink located on the left side of the image?": "Yes",
        "Are the plates and bowls kept inside a glass wooden shelf visible in the image?": "Yes",
        "Is the fan kept on the fridge?": "Yes",
        "Are plates and bowls kept inside the glass wooden shelf?": "Yes"
    },
    "000000135902": {
        "Is the platform located to the left of the main train in the image?": "Yes",
        "Is there a person standing on the platform to the right?": "Yes",
        "Are there metal rods attached to the roof at the top of the image?": "Yes",
        "Is there a train on both the left and right sides of the platform?": "Yes",
        "Are there cables connected to the poles?": "Yes"
    },
    "000000136633": {
        "Are the umbrellas positioned above the vegetable stands?": "Yes",
        "Are the buildings visible in the background of the image?": "Yes",
        "Is the person walking on the left side of the vegetable stands?": "Yes",
        "Are the vegetables placed on the table part of a vegetable market setup?": "Yes",
        "Are the current wires hanging above the street market area?": "Yes"
    },
    "000000136915": {
        "Is the person holding the baseball bat on the left side of the image?": "Yes",
        "Is the indication board located at the top right of the image?": "Yes",
        "Are the shelves containing books on the left side of the image?": "Yes",
        "Is the person on the right looking at the baseball bat?": "Yes",
        "Are the shelves containing books located above the printer?": "Yes"
    },
    "000000137294": {
        "Is the grill machine located on the left side of the image?": "Yes",
        "Is the shed visible in the background of the image?": "Yes",
        "Are there trees visible behind the wooden fence?": "Yes",
        "Is the man placing food on the grill machine?": "Yes",
        "Are the trees located behind the shed?": "Yes"
    },
    "000000137727": {
        "Is there a person inside the train?": "Yes",
        "Is the trolley with luggage on the left side of the train?": "Yes",
        "Is another trolley positioned to the right side of the person holding a trolley?": "Yes",
        "Is the person holding a trolley outside of the train?": "Yes",
        "Is there luggage on the trolley outside the train?": "Yes"
    },
    "000000138639": {
        "Is the person riding a bicycle positioned in the middle of the image?": "Yes",
        "Are the major two persons crossing the road located on the right side of the image?": "Yes",
        "Are there plants on the left side of the image?": "Yes",
        "Are the major two people crossing the road on the right side of the person riding the bicycle?": "Yes",
        "Is the flag in front of the buildings in the background?": "Yes"
    },
    "000000139099": {
        "Is the person wearing the helmet sitting on the left side of the image?": "No",
        "Are the bananas placed on the table positioned on the left side of the image?": "Yes",
        "Is the bicycle with basket located further back in the scene compared to the person holding the watermelon?": "Yes",
        "Is the puppy standing on the person sitting on the bike?": "Yes",
        "Is the watermelon held by a person standing near the table?": "Yes"
    },
    "000000141671": {
        "Is the flag positioned in the middle of the image?": "Yes",
        "Are the group of houses visible in the background of the image?": "Yes",
        "Are the benches located on the floor in the background?": "Yes",
        "Are the benches located in the background of the image?": "Yes",
        "Is the flag positioned in the middle of the people riding bicycles and horses?": "Yes"
    },
    "000000142585": {
        "Is the motorbike positioned between the cars and the bus?": "Yes",
        "Are the traffic lights in front of the motorbike?": "Yes",
        "Are the banners visible above the road?": "Yes",
        "Are the couple on the motorbike positioned behind the cars?": "Yes",
        "Are there traffic lights in front of the couple on the motorbike?": "Yes"
    },
    "000000143556": {
        "Is the person riding the motorcycle in the foreground?": "Yes",
        "Are there poles visible in the background of the image?": "Yes",
        "Is the metal fence in the foreground of the image?": "Yes",
        "Is the person riding the motorcycle in the foreground closest to the metal fence?": "Yes",
        "Are there multiple motorcycles being ridden on the road in the background?": "Yes"
    },
    "000000143961": {
        "Is the green umbrella located in the top right corner of the image?": "Yes",
        "Is there a dog sitting beside a man?": "Yes",
        "Are there two umbrellas visible in the image?": "Yes",
        "Is the dog sitting beside the man part of the group sitting on the grass?": "Yes",
        "Is the green umbrella located at the top right corner of the image separate from the two umbrellas mentioned?": "Yes"
    },
    "000000144003": {
        "Is the cake located on the table in the foreground of the image?": "Yes",
        "Are the two women positioned in the center of the image?": "Yes",
        "Is the man in the red t-shirt on the right side of the image?": "Yes",
        "Is the jar on the table in front of the two women?": "Yes",
        "Are the plates and spatula on the chair beside the table?": "Yes"
    },
    "000000144300": {
        "Is the red and white bike positioned in the front of the image?": "Yes",
        "Are the two persons standing at the right side of the image?": "Yes",
        "Is the black car in the background standing on the road?": "Yes",
        "Are the two persons standing to the right of the bike?": "Yes",
        "Is the black car in the background positioned on the road?": "Yes"
    },
    "000000144706": {
        "Is the street light with traffic signals located on the pavement?": "Yes",
        "Are the houses located on the left side of the image?": "Yes",
        "Is the tree on the right side of the pole?": "Yes",
        "Are the traffic signals attached to the street light pole?": "Yes",
        "Is the name board attached to the pole on the pavement?": "Yes"
    },
    "000000146667": {
        "Is the person standing in front of the bike in the foreground?": "Yes",
        "Are the boxes visible on top of the image?": "Yes",
        "Is the sky visible on the right-top side of the image?": "Yes",
        "Is the person standing in front of the bike holding a cover?": "Yes",
        "Are there people visible on the road behind the bike?": "Yes"
    },
    "000000150417": {
        "Is the cake positioned in front of the woman in the red and blue dress?": "Yes",
        "Is the lamp located on the right side of the image?": "Yes",
        "Are the cabinets visible in the background on the left side of the image?": "Yes",
        "Is the cake on the table in front of the woman?": "Yes",
        "Are there few papers on the fridge in the background?": "Yes"
    },
    "000000150638": {
        "Is the bench located to the right of the table in the image?": "Yes",
        "Is the person preparing juice situated on the left side of the table?": "Yes",
        "Are the trees visible in the background of the image?": "Yes",
        "Is the bench with the basket located to the right of the table?": "Yes",
        "Are there people sitting on chairs in the background?": "Yes"
    },
    "000000151000": {
        "Is the woman wearing a bag and glasses in the middle of the image?": "Yes",
        "Are the people standing visible on the right side of the image?": "Yes",
        "Can we see a plant in the background of the image?": "Yes",
        "Is the woman in the middle wearing glasses and a bag?": "Yes",
        "Are there people standing on the right side, with some wearing caps?": "Yes"
    },
    "000000153011": {
        "Is the food truck white in color positioned on the left side of the image?": "Yes",
        "Are the people sitting on red chairs positioned towards the left in the image?": "Yes",
        "Is the bus visible in front of the buildings in the background?": "Yes",
        "Is the blue-colored bag on the table?": "Yes",
        "Are there people standing near the food truck?": "Yes"
    },
    "000000153527": {
        "Are the tools placed on the wooden bar visible in the image?": "Yes",
        "Are the people sitting on the chairs located on the right side of the image?": "Yes",
        "Is there a bicycle kept aside in the image?": "Yes",
        "Are the tools placed on the wooden bar?": "Yes",
        "Is the bicycle kept aside from the main scene?": "Yes"
    },
    "000000155145": {
        "Are the two boats positioned at the center of the image?": "Yes",
        "Is there an umbrella at the center of the image?": "Yes",
        "Are the people standing in the water with their hands on the boat?": "Yes",
        "Are the three people placing their hands on a boat?": "Yes",
        "Is the umbrella located at the center of the image?": "Yes"
    },
    "000000156278": {
        "Is the table located in the foreground of the image?": "Yes",
        "Are the shelves positioned below the countertop in the back of the image?": "Yes",
        "Is the clock attached to the wall on the right side of the window blinds?": "No",
        "Is the bowl on the table?": "Yes",
        "Are the knives attached to the wall with the window blind?": "Yes"
    },
    "000000156643": {
        "Is the cake positioned in front of the group of people?": "Yes",
        "Are the houseplants visible in the middle right of the image?": "Yes",
        "Are the lights visible in the middle left of the image?": "Yes",
        "Is the cake placed on the table in front of the person with the teddy bears mask?": "No",
        "Are the houseplants visible in the background of the restaurant scene?": "Yes"
    },
    "000000157767": {
        "Is the table with the black cloth located on the right side of the image?": "Yes",
        "Is there a yellow wall visible in the background of the image?": "Yes",
        "Are there some white lights on the roof in the image?": "Yes",
        "Are there any food items on the table covered by the black cloth?": "Yes",
        "Are there white color lights in the roof?": "Yes"
    },
    "000000158660": {
        "Is the tray located beside the bowl of bananas?": "Yes",
        "Are the electrical machines positioned in the background?": "Yes",
        "Is the name board with the weight placed in front of the banana bowl?": "Yes",
        "Is the banana bowl beside the apple bowl?": "Yes",
        "Is the tray with food beside the banana bowl?": "Yes"
    },
    "000000163640": {
        "Is the person holding food on the left side of the image?": "Yes",
        "Is the wall on the left side of the image brown?": "Yes",
        "Is the person wearing a black shirt and blue jeans positioned on the right side of the image?": "Yes",
        "Is the person at the left holding food?": "Yes",
        "Is the paper attached to the wall?": "Yes"
    },
    "000000163746": {
        "Is there an ocean in the center of the image?": "Yes",
        "Are there two airplanes, one on the top right corner and one on the left side of the image?": "Yes",
        "Are there two women walking in the foreground?": "Yes",
        "Are the two women in the foreground walking towards the ocean?": "Yes",
        "Are the people on the left and right side of the image grouped separately?": "Yes"
    },
    "000000164885": {
        "Is the sky located at the top of the image?": "Yes",
        "Is there a pole with wires on the left side of the image?": "No",
        "Are there many trees in the background of the image?": "Yes",
        "Is the man in the middle of the image wearing a helmet?": "Yes",
        "Are there trees in the background?": "Yes"
    },
    "000000165681": {
        "Are the vehicles parked on the bottom left side of the image?": "Yes",
        "Are the three persons standing in the middle of the image?": "Yes",
        "Is there a building with people sitting on top right side of the image?": "Yes",
        "Are the three persons standing among the parked vehicles?": "Yes",
        "Are the people sitting on the building separated by a fence?": "Yes"
    },
    "000000166747": {
        "Is the bus positioned in the middle of the image?": "Yes",
        "Are there people walking on the right side of the vehicle?": "Yes",
        "Can trees be seen in the middle of the image?": "Yes",
        "Are people walking beside the bus?": "Yes",
        "Are there people in the cart with the horse?": "Yes"
    },
    "000000167486": {
        "Are the three people playing music positioned on the stage?": "Yes",
        "Is the banner that says \"rock the bike\" located to the left of the people standing and sitting on cycles?": "Yes",
        "Is there a brick wall behind the presentation being displayed?": "Yes",
        "Are the people on the cycles positioned to the left side of the stage?": "Yes",
        "Is there a banner behind the people on the cycles?": "Yes"
    },
    "000000167572": {
        "Is the person holding the plate positioned near the center of the image?": "Yes",
        "Is the glass jug located on the table in the image?": "Yes",
        "Is the cucumber slice positioned on the right side of the plate?": "No",
        "Is the person holding the plate with food items?": "Yes",
        "Is the other person sitting next on the chair?": "Yes"
    },
    "000000168337": {
        "Is the red object positioned in the middle of the image?": "Yes",
        "Is the woman on the left side of the image holding a black bag?": "Yes",
        "Is the yellow door located on the right side of the image?": "Yes",
        "Is the woman holding a black bag on the left side of the road?": "Yes",
        "Is the yellow door located on the building in the background?": "Yes"
    },
    "000000168883": {
        "Is the lady with the green dress on the left side of the image?": "Yes",
        "Is the lady in the pink dress holding a girl's hand?": "Yes",
        "Is there a store in the background of the image?": "Yes",
        "Is the lady holding a mobile talking to someone?": "Yes",
        "Is the lady in the green dress standing next to the lady with the mobile?": "Yes"
    },
    "000000169076": {
        "Is the black dog lying on the bed positioned on the right side of the image?": "Yes",
        "Is the television positioned above the table in front of the dog?": "Yes",
        "Are there some items on top of the drawers?": "Yes",
        "Is the dog lying on the bed in front of the drawers?": "Yes",
        "Are there items on top of both the table and the drawers?": "Yes"
    },
    "000000169169": {
        "Are the green banners positioned in the front of the image?": "Yes",
        "Is there a yellow-colored stand on the right side of the image?": "Yes",
        "Are there flower pots located on the left side of the image?": "Yes",
        "Are the banners attached to the pole?": "Yes",
        "Are there people walking in the background?": "Yes"
    },
    "000000170191": {
        "Is the bed located in the center of the picture?": "Yes",
        "Is the person standing on the right side of the picture?": "Yes",
        "Is the desk with the lamp on the top right of the image?": "Yes",
        "Is the standing person to the right of the bed?": "Yes",
        "Is the lamp on the desk?": "Yes"
    },
    "000000171190": {
        "Is the table covered with a white cloth?": "Yes",
        "Is there a light in the top left corner of the image?": "Yes",
        "Is the shelf positioned in the top right corner beside the door?": "Yes",
        "Is there a shelf visible above the group of persons?": "Yes"
    },
    "000000171382": {
        "Is the man wearing a t-shirt positioned in the center of the image?": "Yes",
        "Are the cars in the background on the left side of the image?": "Yes",
        "Are the people with bags positioned on the right side of the image?": "Yes",
        "Is the skateboard in the air next to the man?": "Yes",
        "Are there people standing on the road carrying bags?": "Yes"
    },
    "000000172571": {
        "Is the glass with water placed to the left side of the table?": "Yes",
        "Is the man sitting on the chair located above the table in the image?": "Yes",
        "Are the two plates with cake positioned in the center of the table?": "No",
        "Is the knife on the table?": "Yes",
        "Is the spatula placed near the cake?": "Yes"
    },
    "000000173302": {
        "Is the table with many books and papers on it located on the left side of the image?": "Yes",
        "Are the three empty chairs placed in the middle of the image?": "Yes",
        "Is there a picture frame on the wall at the top right of the image?": "Yes",
        "Are the empty chairs and tables located on the right side of the image?": "Yes",
        "Is the table with many books and papers on the left side of the image?": "Yes"
    },
    "000000175438": {
        "Are the traffic signal poles located in the foreground of the image?": "Yes",
        "Is the clock located in the center of the image?": "Yes",
        "Are the buildings situated in the middle right section of the image?": "Yes",
        "Are the traffic signal poles located near the clock?": "Yes",
        "Are there cars moving on the road in the middle of the image?": "Yes"
    },
    "000000176799": {
        "Is the man flying with the skateboard positioned above the wall with paintings?": "Yes",
        "Are the flags located at the top of the image?": "Yes",
        "Is the man taking pictures to the left of the man standing and looking?": "No",
        "Is the man standing looking at the man who is flying with the skateboard?": "Yes",
        "Is there a man taking pictures of the man who is doing the skating?": "Yes"
    },
    "000000177489": {
        "Are the woman and the man sitting at a table?": "Yes",
        "Is the photo frame located on the left side of the image?": "Yes",
        "Are the bottles and other items on the granite table in the background?": "Yes",
        "Are the bottles and other items on the granite table located behind the woman and man?": "Yes",
        "Is the photo frame on the wall located in the background?": "Yes"
    },
    "000000177934": {
        "Are the two bikes located on the left side of the image?": "Yes",
        "Is the bucket positioned at the bottom of the image?": "Yes",
        "Are the trees located at the top of the image?": "Yes",
        "Are the women cleaning the bikes on the left side of the image?": "Yes",
        "Is the bucket located at the bottom of the image?": "Yes"
    },
    "000000179487": {
        "Is the woman playing badminton positioned in the foreground of the image?": "Yes",
        "Is the group of people standing and watching the game located on the left middle side of the image?": "Yes",
        "Is the sky blue and visible at the top of the image?": "Yes",
        "Is the woman in the foreground playing badminton on the pitch?": "Yes",
        "Are there people standing and watching a game in the left middle of the image?": "Yes"
    },
    "000000179642": {
        "Is the man sitting at the center of the image?": "Yes",
        "Is there a fan on the right side of the man?": "Yes",
        "Are there two people standing on the left side of the image?": "Yes",
        "Is the fan located to the right side of the man?": "Yes",
        "Are two people standing to the left side of the image?": "Yes"
    },
    "000000180751": {
        "Is there a refrigerator on the top right side of the image?": "Yes",
        "Are there glasses and bottles on the bottom left side of the image?": "Yes",
        "Is a man standing and holding a bottle in the top left side of the image?": "Yes",
        "Is the man in the top left holding a bottle?": "Yes",
        "Are there papers near the bottom right hand on the table?": "Yes"
    },
    "000000182611": {
        "Is the man with the white t-shirt and brown coat holding a pink plate on the right side of the image?": "Yes",
        "Are the green fresh vegetables located in the front of the image?": "Yes",
        "Is the white bowl full of meat placed beside the cashew nut box?": "Yes",
        "Is the man wearing a white t-shirt with a brown coat mixing noodles on the table?": "Yes",
        "Is the man on the opposite side holding a plate with bread and curry?": "Yes"
    },
    "000000184611": {
        "Is the man in the blue jacket riding the rickshaw on the left side of the image?": "Yes",
        "Is the black and blue bag located beside the man in the rickshaw?": "Yes",
        "Are the buildings positioned on the right side of the footpath where people are walking?": "Yes",
        "Is the black and blue bag inside the rickshaw?": "Yes",
        "Are there people walking beside the rickshaw on the footpath?": "Yes"
    },
    "000000185472": {
        "Is the train on the rail track in the center of the image?": "Yes",
        "Is the person wearing a red jacket on the platform to the right of the image?": "Yes",
        "Are the grass and trees located on the left side of the image?": "Yes",
        "Is the person wearing the red jacket beside the big-cycle on the platform?": "Yes",
        "Is the person standing beside a bag holding a book in his hand?": "Yes"
    },
    "000000186449": {
        "Is the old woman sitting on the left side of the image?": "Yes",
        "Is the bag beside the old woman on the bench?": "Yes",
        "Is the woman with the purse looking at the old woman in the top right corner?": "Yes",
        "Is the bag placed beside the old woman on the wooden bench?": "Yes",
        "Is the woman holding a purse looking at the old woman?": "Yes"
    },
    "000000187243": {
        "Is the woman sleeping in the middle of the washroom on the floor?": "Yes",
        "Are there two napkins on a hanger in the top right of the image?": "Yes",
        "Is the cupboard located at the top left of the image?": "Yes",
        "Is the woman sleeping on the mat on the floor?": "No",
        "Are the napkins located on the right side of the image?": "Yes"
    },
    "000000188465": {
        "Is the man in the white uniform positioned at the front in the image?": "Yes",
        "Is the man with the black t-shirt and white pants holding a bat in the middle of the image?": "Yes",
        "Are there posters visible in the background of the image?": "Yes",
        "Is the man with the black t-shirt and white pants standing in the middle holding a bat?": "Yes",
        "Is there a man sitting behind the man with the black t-shirt and white pants?": "Yes"
    },
    "000000189475": {
        "Is the lady with a black t-shirt sitting on the left side of the image?": "Yes",
        "Is there a blue color roof on the top of the image?": "Yes",
        "Is the boy with a white t-shirt sitting between two people in the image?": "Yes",
        "Is the boy with the white t-shirt sitting between the two ladies?": "Yes",
        "Are there sauce bottles on the table in front of the people sitting?": "Yes"
    },
    "000000189775": {
        "Is the person holding a bat standing in the center of the image?": "Yes",
        "Is the man wearing a white t-shirt and white hat on the left side of the image?": "Yes",
        "Are there empty chairs that are blue in the background?": "Yes",
        "Is there a person standing in the center holding a bat while playing?": "Yes",
        "Are there people sitting and enjoying the game in the background?": "Yes"
    },
    "000000190676": {
        "Is the aeroplane positioned on the left side of the image?": "Yes",
        "Are the people standing on the right side of the image?": "Yes",
        "Are the mountains located in the background?": "Yes",
        "Is the airplane located to the left of the people standing?": "Yes",
        "Are the mountains in the background behind the people?": "Yes"
    },
    "000000190753": {
        "Is the dustbin located on the bottom left corner of the image?": "Yes",
        "Are the trees located at the top of the image?": "Yes",
        "Is the street light positioned on the right side of the image?": "Yes",
        "Are the persons sitting near the table playing chess?": "Yes",
        "Is the dustbin located at the bottom left corner of the image?": "Yes"
    },
    "000000192670": {
        "Is the person in the blue shirt positioned on the right side of the image?": "Yes",
        "Are there trees visible in the background of the image?": "Yes",
        "Is the person in the orange shirt on the left side of the image?": "Yes",
        "Is the person wearing a blue helmet and the person wearing a black helmet standing close to each other?": "Yes",
        "Are the cars on the road behind the railing?": "Yes"
    },
    "000000193162": {
        "Is the cow in the foreground of the image?": "Yes",
        "Are the two dogs positioned to the left of the cow?": "Yes",
        "Is the pole and tree to the right of the man on the vehicle?": "Yes",
        "Are the two dogs to the left of the cow?": "Yes",
        "Is the man on the vehicle to the right of the cow?": "Yes"
    },
    "000000195842": {
        "Is the table located on the right side of the image?": "Yes",
        "Are there books placed on top of the cupboard?": "Yes",
        "Is the wall with the photo frame located beside the man?": "Yes",
        "Is the man in blue jacket standing on the floor?": "Yes",
        "Is there a television on top of the wooden cupboard?": "No"
    },
    "000000197870": {
        "Is the hen positioned below the bench in the image?": "Yes",
        "Is the person walking in front of the trees?": "No",
        "Are the trees positioned in the blurry background of the image?": "Yes",
        "Is the hen located beneath the bench?": "Yes",
        "Are the trees in front of the person walking?": "Yes"
    },
    "000000202228": {
        "Is the mirror positioned on the wall?": "Yes",
        "Is the tissue roll placed to the left of the sunglasses on the table?": "Yes",
        "Is the door visible behind the man in the mirror?": "Yes",
        "Is the man holding a camera in front of the mirror?": "Yes",
        "Is the tissue roll on the table below the mirror?": "Yes"
    },
    "000000203294": {
        "Is there a bus parked on the road?": "Yes",
        "Are the women standing and talking on the left side of the bus?": "Yes",
        "Is there a vehicle parked on the right side of the image?": "Yes",
        "Is the bus parked on the road?": "Yes",
        "Are there women standing near the bus and talking?": "Yes"
    },
    "000000203629": {
        "Is the woman holding a paper positioned on the left side of the image?": "Yes",
        "Is the man talking on a mobile in the center of the sitting people?": "Yes",
        "Are the lights located near the ceiling in the background?": "Yes",
        "Is the man talking on the mobile sitting between the woman holding a paper and the man looking down?": "Yes",
        "Are the glasses placed in front of the third man who is looking down?": "Yes"
    },
    "000000204329": {
        "Is the surfboard positioned in the foreground of the image?": "Yes",
        "Are there people sitting on the seashore in the background?": "Yes",
        "Is there a hill with trees in the background?": "Yes",
        "Is the surfboard placed on the sand?": "Yes",
        "Are there people in the background sitting on the seashore?": "Yes"
    },
    "000000204871": {
        "Is the hydrant positioned in the center of the image?": "Yes",
        "Is the car moving on the left side of the image?": "No",
        "Is the building with boards and text on the left side of the image?": "Yes",
        "Is the hydrant located in the middle of the image?": "Yes",
        "Is there a car moving on the right side of the image?": "Yes"
    },
    "000000207844": {
        "Is the sky with clouds located at the top of the image?": "Yes",
        "Are the buildings with walls, windows, and doors in the background?": "Yes",
        "Is the tent located on the right side of the image?": "Yes",
        "Are there buildings in the background of the image?": "Yes",
        "Is there a tent located on the right side of the image?": "Yes"
    },
    "000000211825": {
        "Is the camera on the right side of the table?": "Yes",
        "Is the matchbox on the left side of the table?": "Yes",
        "Is the hand of the other person visible on the right side of the image?": "Yes",
        "Is the man standing in front of the cake while blowing the candles?": "Yes",
        "Is the camera positioned on the right side of the cake on the table?": "Yes"
    },
    "000000213255": {
        "Is the tray with vegetables and bread positioned on top of the red cart?": "Yes",
        "Are the bottles, which are white, yellow, and red in color, placed in front of the man?": "Yes",
        "Are the buildings and street lights located in the background of the image?": "Yes",
        "Is the man holding the tray with vegetables, bread, and other food items?": "Yes",
        "Are the white bags hanging from the red cart?": "Yes"
    },
    "000000213830": {
        "Are the two men positioned on the ground holding tennis rackets?": "Yes",
        "Is the person on the left standing near a steel fencing and a table?": "Yes",
        "Is there a wall on the right side of the image?": "Yes",
        "Are both men holding a tennis racket?": "Yes",
        "Is there a person standing near a steel fencing and table on the left?": "Yes"
    },
    "000000214753": {
        "Is the man with the black jacket positioned at the back relative to the other rider?": "Yes",
        "Are the rocks positioned in front of the horses?": "Yes",
        "Is the sea located to the right of the horses?": "No",
        "Is the man with the blue jacket in front of the man with the black jacket?": "Yes",
        "Are the rocks closer to the sea than the horses?": "Yes"
    },
    "000000222094": {
        "Is the pole positioned in the middle of the image?": "Yes",
        "Is the store on the left side of the image?": "Yes",
        "Are there houses on the right side of the image?": "Yes",
        "Is the stop board in front of the pole?": "Yes",
        "Are there houses on the right side of the store?": "Yes"
    },
    "000000223182": {
        "Is the man holding a towel positioned in the middle of the image?": "Yes",
        "Are the two bottles situated at the bottom of the image?": "Yes",
        "Is the person with headphones sitting on the top left side of the image?": "Yes",
        "Is the man sitting in the middle holding a towel?": "Yes",
        "Are there people walking on the steps in the top right side of the image?": "Yes"
    },
    "000000226147": {
        "Is the lady person in white sitting at the center of the image?": "Yes",
        "Is the vase of flowers positioned on the left side of the image?": "Yes",
        "Is the person wearing blue walking in the background on the left side?": "No",
        "Is the lady sitting on the chair taking a photo of the food on her plate?": "Yes",
        "Is the national flag placed on the table near the food and drink?": "Yes"
    },
    "000000226417": {
        "Are the people on motorcycles positioned in the center of the image?": "Yes",
        "Is the man with the cycle on the right side of the image?": "Yes",
        "Is the purple color cloth visible on the left side of the image?": "Yes",
        "Are the people sitting on motorcycles close to the standing individuals?": "Yes",
        "Is the man with his cycle near the street lights?": "Yes"
    },
    "000000228436": {
        "Is the bicycle located at the bottom of the image?": "Yes",
        "Are the buildings positioned on the right side of the image?": "Yes",
        "Is the sky found at the top of the image?": "Yes",
        "Is the bicycle locked to the railing?": "Yes",
        "Are there boats parked aside in the middle of the image?": "Yes"
    },
    "000000228942": {
        "Is the car passing on the road positioned in the center of the image?": "Yes",
        "Is the tree on the left side of the image?": "No",
        "Is the board with \"Santa Clara\" written on it in the middle of the image?": "Yes",
        "Is the tree on the same side as the pole in the image?": "Yes",
        "Are the group of people standing in front of the building located behind the vehicles?": "Yes"
    },
    "000000229358": {
        "Is the mirror placed at the center of the image?": "Yes",
        "Is the shelf located on the left side of the image?": "Yes",
        "Are the soap case and glass at the right side of the image?": "Yes",
        "Is the man using the mirror to take a photo?": "Yes",
        "Is the towel placed on the left side of the image?": "Yes"
    },
    "000000229601": {
        "Is the man wearing a blue t-shirt standing on the right side of the image?": "Yes",
        "Is the man wearing a red t-shirt running on the left side of the image?": "Yes",
        "Are there three lights visible in the background of the image?": "Yes",
        "Is the man wearing a black shirt walking between the two standing persons in the background?": "Yes",
        "Is the man in the red t-shirt running towards the man in the blue t-shirt on the right side?": "Yes"
    },
    "000000229659": {
        "Is the monitor positioned on the table in the foreground of the image?": "Yes",
        "Are the paintings located on the top right to the wall?": "Yes",
        "Are there bottles and food items on the left side of the image?": "Yes",
        "Is the monitor on the table in the foreground near the tissues?": "Yes",
        "Are there any paintings near the man standing on the top right?": "Yes"
    },
    "000000229849": {
        "Is the person playing a game in the foreground of the image?": "Yes",
        "Are the cameramen positioned behind the hoarding board?": "Yes",
        "Are the chairs visible in the background of the image?": "Yes",
        "Is the person holding a bat in front of the hoarding board?": "Yes",
        "Are the camera people positioned behind the hoarding board?": "Yes"
    },
    "000000229948": {
        "Are the horses positioned in front of the man sitting on the cart?": "Yes",
        "Is the truck with glass doors located behind the horses?": "Yes",
        "Are the canopy tents situated in the background behind the horses and cart?": "Yes",
        "Are the horses attached to the cart?": "Yes",
        "Is the banner attached to the wall?": "Yes"
    },
    "000000230008": {
        "Is the policeman sitting on the left side of the image?": "Yes",
        "Is the black car on the left side of the image?": "No",
        "Is there a pole in the top right corner of the image?": "Yes",
        "Is the policeman in front of the trees?": "Yes",
        "Is the pole located to the right side of the vehicle?": "Yes"
    },
    "000000231125": {
        "Is the chef parceling food positioned at the center of the image?": "Yes",
        "Are the buns on the table located to the left side of the image?": "No",
        "Is there another person standing to the left side of the table inside the cafe?": "Yes",
        "Is the food in the bowl placed to the right of the buns on the first table?": "Yes"
    },
    "000000231580": {
        "Is the person wearing a blue coat and jeans at the center of the image?": "Yes",
        "Are the two people wearing blue and red t-shirts standing on the left side of the image?": "Yes",
        "Is the animal surrounded by red fencing located behind the chair?": "Yes",
        "Is the stand-alone person in relation to the wooden table?": "Yes",
        "Are the red-fencing and the animal related in any way?": "Yes"
    },
    "000000231879": {
        "Is the man sitting in a chair and holding a baby located in the foreground of the image?": "Yes",
        "Is there a table and a chair on the right side of the image?": "Yes",
        "Are there grass, plants, and a wood wall on the left side of the image?": "Yes",
        "Is the man sitting in a chair holding a baby?": "Yes",
        "Is the woman standing in the center holding a cake?": "Yes"
    },
    "000000232692": {
        "Is the person with the surfboard in the water?": "Yes",
        "Is the white color balloon behind the person?": "Yes",
        "Are there two persons sitting on the board to the right side?": "Yes",
        "Is the white balloon located behind the person on the surfboard?": "Yes",
        "Are the trees positioned behind the red color banner?": "Yes"
    },
    "000000233238": {
        "Is there a group of people standing on the right side of the image?": "Yes",
        "Is the table in the middle covered with a red cloth?": "Yes",
        "Are there trees visible in the background?": "Yes",
        "Is there a person holding a plate on the right side of the group?": "Yes",
        "Are the food items and bottle on top of a table with a red cloth?": "Yes"
    },
    "000000233771": {
        "Are the people holding umbrellas located on the right side of the image?": "Yes",
        "Is there a tree on the left side of the image?": "Yes",
        "Are there buses visible in the background?": "Yes",
        "Are the people holding umbrellas walking on the right side of the image?": "Yes",
        "Are there vehicles, including buses, in the background behind the people?": "Yes"
    },
    "000000240250": {
        "Are the plates positioned in front of the woman on the table?": "Yes",
        "Is there a fence besides the woman?": "Yes",
        "Are there people visible in the background beyond the table?": "Yes",
        "Is the woman holding something in her hands while sitting at the table?": "Yes",
        "Are there objects in front of the woman on the table?": "Yes"
    },
    "000000242678": {
        "Is the person riding the horse located in the center of the image?": "No",
        "Is the scoreboard on the left side of the image?": "Yes",
        "Are there flower plants on the left side next to the scoreboard?": "Yes",
        "Is the person riding the horse between the fence and the scoreboard?": "Yes",
        "Are the flags located on the same wall as the scoreboard?": "No"
    },
    "000000242946": {
        "Is the salad positioned at the front center of the dining table?": "Yes",
        "Are the glasses of juice to the right side of the table?": "Yes",
        "Is the person standing in the background positioned near the plant?": "Yes",
        "Is the woman holding chopsticks sitting on a chair?": "Yes",
        "Are the glasses of water placed on the dining table?": "Yes"
    },
    "000000243204": {
        "Is the man standing on the right side of the image?": "Yes",
        "Is the pan positioned on the gas stove with the bread on it?": "Yes",
        "Is there a shelf located at the top area of the image?": "Yes",
        "Is the man holding a spatula over the pan?": "Yes",
        "Is the door located on the same side as the man?": "Yes"
    },
    "000000245448": {
        "Is the person wearing a black coat standing in front of the motorcycle?": "Yes",
        "Are there trees located at the left corner of the image?": "Yes",
        "Is the building with the red brick wall positioned at the back of the image?": "Yes",
        "Is there a person standing in front of the motorcycle on the road?": "Yes",
        "Are there bikes near the right building?": "Yes"
    },
    "000000246968": {
        "Is the telephone positioned on the left side of the countertop?": "Yes",
        "Are the cupboards located in the background of the image?": "Yes",
        "Is the door on the right side of the image?": "Yes",
        "Is the woman standing in front of the table?": "Yes",
        "Is the telephone on the counter?": "Yes"
    },
    "000000249786": {
        "Is the man jumping with the ski-board positioned in the middle of the image?": "Yes",
        "Are the group of people travelling in the cable car located at the back of the image?": "Yes",
        "Is the banner with some text located on the right side of the image?": "Yes",
        "Are the group of people in the cable car positioned behind the man jumping with the ski-board?": "Yes",
        "Is the flag located on the left side of the ski-boarder?": "Yes"
    },
    "000000252219": {
        "Is the wheel cart positioned to the left of the person holding the object?": "Yes",
        "Are the yellow umbrellas located at the right corner of the image?": "Yes",
        "Is the traffic signal attached to the pole above the person holding the object?": "Yes",
        "Is the woman walking on the footpath?": "Yes",
        "Is the poster attached to the blue Color iron sheet?": "Yes"
    },
    "000000253742": {
        "Is the person wearing a blue jacket holding an umbrella positioned on the right side of the image?": "Yes",
        "Are the persons wearing uniforms with black and white colors positioned behind the animals?": "Yes",
        "Is the tree with green leaves located in the background of the image?": "Yes",
        "Are the persons wearing uniforms close to the animals?": "Yes",
        "Is there a tree with green leaves behind the people holding umbrellas?": "Yes"
    },
    "000000253835": {
        "Is the woman standing on the platform facing the train on the left side of the image?": "Yes",
        "Are the signal lights located near the center of the image?": "Yes",
        "Is the train positioned on the left side of the woman and child in the image?": "Yes",
        "Is the woman standing near the train on the track?": "Yes",
        "Is the clock located on the same pole as the signal lights?": "Yes"
    },
    "000000256868": {
        "Is the boy running in the middle of the image?": "Yes",
        "Is the man on the skateboard on the right side of the image?": "Yes",
        "Is there a white building in the background?": "Yes",
        "Is the man on the skateboard located to the right side of the boy?": "Yes",
        "Is the chair located to the right side of the man standing on the skateboard?": "Yes"
    },
    "000000258911": {
        "Is the kid feeding an animal on the right side of the image?": "Yes",
        "Is the person wearing a white shirt and brown hat taking a photograph in the image?": "Yes",
        "Is the person in the orange T-shirt standing in the background of the image?": "Yes",
        "Is the person wearing a white shirt and brown hat taking a photograph of the animals?": "Yes",
        "Is the kid feeding one of the animals?": "Yes"
    },
    "000000259597": {
        "Is the boy standing on the left side of the image?": "Yes",
        "Are the tables in the background of the image black in color?": "Yes",
        "Is there a yellow-colored building in the background?": "Yes",
        "Is the boy taking a picture in the direction of the tables?": "Yes",
        "Are there people sitting near the black tables?": "Yes"
    },
    "000000259690": {
        "Are the two men on the ground positioned in front of the benches?": "Yes",
        "Is the bus visible in the background behind the fencing?": "Yes",
        "Are the people in the background sitting to the right of the pole in the image?": "Yes",
        "Are both men holding bats?": "Yes",
        "Are there people sitting on benches in the background?": "Yes"
    },
    "000000259830": {
        "Is the scooty located on the left side of the image?": "Yes",
        "Are the bicycles situated on the right side of the image?": "Yes",
        "Is the tree located on the left side of the image?": "Yes",
        "Is the scooty positioned to the left of the bicycles?": "Yes",
        "Is the tree located to the left of the pole?": "Yes"
    },
    "000000260261": {
        "Is the truck positioned in the front of the image?": "Yes",
        "Is the man standing near the white tray inside the truck?": "Yes",
        "Is the black car on the right side of the image?": "Yes",
        "Is the man standing near the truck?": "Yes",
        "Are the coconuts placed in the truck?": "Yes"
    },
    "000000263594": {
        "Is the bird located at the bottom of the image?": "Yes",
        "Is the pole and sign board on the left side of the image?": "No",
        "Is there a person sitting on the bench under the tree in the top right corner?": "Yes",
        "Is the bird crossing the road in front of the car?": "Yes",
        "Is there a person sitting under the tree?": "Yes"
    },
    "000000263679": {
        "Is the woman on the left side holding a parachute?": "Yes",
        "Is there a building located in the center of the image?": "Yes",
        "Are the flags located on the left side of the image?": "Yes",
        "Is the man on the right holding a rope of the parachute which is in front of him?": "Yes",
        "Are there poles present on the right side of the image?": "Yes"
    },
    "000000263969": {
        "Is the woman positioned in the center of the image?": "Yes",
        "Is the man standing on the right side of the image?": "Yes",
        "Are the candle stands hanging on the left side of the image?": "Yes",
        "Is the woman holding a knife while cutting the cake?": "Yes",
        "Is the man holding the woman's hand while she cuts the cake?": "Yes"
    },
    "000000266768": {
        "Are the group of persons sitting to the left of the building?": "Yes",
        "Is the person holding a coke can on the left side of the image?": "No",
        "Is the sky visible in the top right corner of the image?": "Yes",
        "Are the people sitting near the table?": "Yes",
        "Is the water can placed on the table?": "Yes"
    },
    "000000266892": {
        "Is there a woman standing in the middle of the image?": "Yes",
        "Are the spectators positioned behind the women with rackets?": "Yes",
        "Is there a shed visible behind the spectators?": "Yes",
        "Is the woman standing with a racket near the spectators?": "Yes",
        "Are both women with rackets positioned in front of the shed?": "Yes"
    },
    "000000266981": {
        "Are the two persons sitting on the wall to the left of the red bag?": "Yes",
        "Is the woman in black walking on the right side of the image?": "Yes",
        "Is the group of people standing near the vehicles on the left?": "Yes",
        "Are the two persons sitting next to the red bag?": "Yes",
        "Is the woman on the right walking towards the cars in the background?": "Yes"
    },
    "000000268378": {
        "Is the dining table positioned in the center of the room?": "Yes",
        "Are there photo frames on the wall on the right?": "Yes",
        "Is the person at the left wearing a blue shirt?": "Yes",
        "Is the green cloth on top of the dining table?": "Yes",
        "Are the white curtains behind the standing people?": "Yes"
    },
    "000000271116": {
        "Is the person wearing a black coat seated on the right side of the image?": "Yes",
        "Are the tableware items like glass and plates at the back side on the table?": "Yes",
        "Is the table covered with a white cloth?": "Yes",
        "Are the two persons in front seated on chairs?": "Yes",
        "Is the table covered with a white cloth located behind the two persons in front?": "Yes"
    },
    "000000273420": {
        "Is the man standing on the left side of the image?": "No",
        "Is the chair with the cup and towel in front of the man?": "Yes",
        "Can buildings and vehicles be seen through the window?": "Yes",
        "Is the man holding a painting brush while speaking on the mobile?": "Yes",
        "Are there any buildings visible through the window?": "Yes"
    },
    "000000275198": {
        "Is the woman sitting on the chair positioned in the middle of the image?": "No",
        "Are the two girls sitting in the middle of the scene?": "Yes",
        "Is the woman standing on the left side of the image?": "Yes",
        "Are the two girls sitting in the middle of the group?": "Yes",
        "Is the woman standing behind the table?": "Yes"
    },
    "000000277005": {
        "Is the train located in the background area of the image?": "Yes",
        "Are the dustbins situated at the center of the image?": "Yes",
        "Are the cars on the left side of the image?": "No",
        "Are the cars located on the same side as the pole with birds?": "Yes",
        "Are the group of people getting down from the train located closer to the train than the dustbins?": "Yes"
    },
    "000000278749": {
        "Is the man holding the placard positioned near the center of the image?": "Yes",
        "Is the woman with the stroller on the left side of the image?": "Yes",
        "Are the trees and buildings located in the background of the image?": "Yes",
        "Is the man holding the placard standing on the pathway?": "Yes",
        "Are the vehicles moving on the road parallel to the pathway?": "Yes"
    },
    "000000278848": {
        "Are the people with umbrellas positioned in the foreground of the image?": "Yes",
        "Is the bus located on the left side of the image?": "Yes",
        "Is the pole with the board positioned closer to the bus than to the trees in the background?": "Yes",
        "Is the bus near the pole with the board on it?": "Yes",
        "Are there people under the umbrellas on the path?": "Yes"
    },
    "000000279927": {
        "Is the person holding the red umbrella on the left side of the image?": "Yes",
        "Are there trees visible on the left side of the image?": "Yes",
        "Is there water visible on the right side of the image?": "Yes",
        "Is the person wearing a red dress on the left side holding a red umbrella?": "Yes",
        "Are there any trees on the right side of the image?": "No"
    },
    "000000280710": {
        "Is there a person holding a handbag in the image?": "Yes",
        "Are there double decker buses visible in the background?": "Yes",
        "Is the person wearing a jacket on the right side of the image?": "Yes",
        "Are the three persons in the foreground walking together?": "The caption doesn't specify if they are together, only that they are walking on a road",
        "Is the metal fence located in the background near the double-decker buses?": "Yes"
    },
    "000000280918": {
        "Are both people standing in front of the stove?": "Yes",
        "Is the person wearing a black and blue dress holding a tray with a red cloth?": "Yes",
        "Is there a board with photos on the side of the counter top?": "Yes",
        "Is the person wearing the colorful dress holding something in front of the stove?": "Yes",
        "Are there any bowls or containers next to the stove?": "Yes"
    },
    "000000281409": {
        "Is the baseball player positioned on the right side of the image?": "Yes",
        "Is the catcher on the left side of the image?": "Yes",
        "Are the spectators sitting at a table in the background?": "Yes",
        "Is the catcher positioned to the left of the baseball player?": "Yes",
        "Are the spectators sitting in the background?": "Yes"
    },
    "000000282037": {
        "Is the person throwing the ball positioned near the center of the field?": "Yes",
        "Are the people with flags located on the left side of the person throwing the ball?": "Yes",
        "Are there people sitting in the stadium chairs in the background?": "Yes",
        "Is a person throwing a ball to another person who is trying to catch it?": "Yes",
        "Are there people walking by with flags in the stadium?": "Yes"
    },
    "000000283318": {
        "Is the tree positioned in the left side corner of the image?": "Yes",
        "Are there poles and street lights on the left side of the image?": "Yes",
        "Is there a pole in the middle of the image?": "Yes",
        "Is there a tree near the store?": "Yes",
        "Are there street lights on the left side of the image?": "Yes"
    },
    "000000283785": {
        "Is the man standing in the center and holding a paper in his hand?": "Yes",
        "Is the person holding a baby sitting on the left side?": "Yes",
        "Are there shelves filled with books in the background?": "Yes",
        "Is the man at the center holding a paper while speaking?": "Yes"
    },
    "000000284725": {
        "Is the black car positioned in the center of the image?": "Yes",
        "Is the red bus parked on the road in the center?": "Yes",
        "Are there trees, plants visible on the right side of the image?": "Yes",
        "Is the black car standing in the center of the road?": "Yes",
        "Are there persons walking at the right side of the image?": "Yes"
    },
    "000000286182": {
        "Is the table positioned in the foreground of the image?": "Yes",
        "Are the guitars hanging to the right of the man sitting in the chair?": "Yes",
        "Is the shelf with alcohol bottles located on the left side of the image?": "Yes",
        "Is the man sitting in front of the shelf with alcohol bottles?": "No",
        "Are the guitars hanging near the man sitting in the chair?": "Yes"
    },
    "000000286503": {
        "Is the pillar located behind the elephant?": "Yes",
        "Are the plants on the right side of the image?": "Yes",
        "Is the room positioned in front of the umbrella?": "Yes",
        "Are there trees located in the background of the image?": "Yes"
    },
    "000000286553": {
        "Are the umbrellas located behind the man and woman?": "Yes",
        "Is the door on the right side of the image?": "Yes",
        "Are the plates of food in front of both the man and the woman?": "Yes",
        "Are the plates of food on the table in front of the man and woman?": "Yes",
        "Is the door on the right side of the man and woman?": "Yes"
    },
    "000000287291": {
        "Is the car positioned in the bottom left corner of the image?": "Yes",
        "Are the two persons standing near the shed in the center of the image?": "Yes",
        "Is there a group of cars on the right side of the image?": "Yes",
        "Is the car in the bottom left corner standing near the pole?": "Yes"
    },
    "000000288685": {
        "Is the man standing on the grass in the foreground of the image?": "Yes",
        "Is the dog positioned beside the sheep?": "Yes",
        "Are the people sitting on the benches behind the green cloth railing?": "Yes",
        "Is the dog beside the sheep?": "Yes"
    },
    "000000289938": {
        "Is the vehicle with hot dog posters on the footpath?": "Yes",
        "Are the bottles placed above the vehicle?": "Yes",
        "Is the umbrella beside the vehicle?": "Yes",
        "Are there bottles placed above the vehicle?": "Yes"
    },
    "000000290248": {
        "Is the black car located at the bottom left corner of the image?": "Yes",
        "Is the man wearing a white shirt standing on the right side of the image?": "Yes",
        "Is there a coffee shop on the left side of the image?": "Yes",
        "Is the man in a white shirt standing near the bike and plastic bags?": "Yes",
        "Are the women standing near the house behind the man in a white shirt?": "Yes"
    },
    "000000290293": {
        "Is there a train moving on one of the tracks?": "Yes",
        "Are the people sitting on the chairs on the left side of the image?": "Yes",
        "Are there sign boards present throughout the tunnel?": "Yes",
        "Is there a train on one of the tracks?": "Yes",
        "Are there people sitting to the left side of the image?": "Yes"
    },
    "000000291551": {
        "Is the person with the skate wheels skating in the foreground of the image?": "Yes",
        "Are the people sitting on the bench directly behind the skater?": "Yes",
        "Is there a railing behind the people sitting on the bench?": "Yes",
        "Is the person on the skateboard in front of the people sitting on the bench?": "Yes",
        "Is the railing located behind the people sitting on the bench?": "Yes"
    },
    "000000292236": {
        "Is the person on the right side of the image holding something?": "Yes",
        "Is there a tree visible in the left top corner of the image?": "Yes",
        "Does the train in the image have three lights visible?": "Yes",
        "Is the person on the right side holding something while facing the train?": "Yes",
        "Is the suitcase located behind the man in the middle?": "Yes"
    },
    "000000292446": {
        "Is the man wearing a grey t-shirt positioned on the right side of the image?": "Yes",
        "Are the pizza boxes placed on the table in the foreground of the image?": "Yes",
        "Is the window located in the upper part of the background?": "Yes",
        "Is the man who is sitting on a chair looking towards the computer screens?": "Yes",
        "Are there any cotton boxes near the window?": "Yes"
    },
    "000000292456": {
        "Is the scooter positioned towards the right side of the image?": "Yes",
        "Is the person wearing a hat located to the left of the image?": "Yes",
        "Are the buildings visible in the background of the image?": "Yes",
        "Is the woman sitting on the scooter with the man?": "Yes",
        "Is the person standing with the hat to the left of the scooter?": "Yes"
    },
    "000000293245": {
        "Is the bike parked in the center of the image?": "Yes",
        "Is the pot with the plant on the left side of the image?": "No",
        "Is the number made with cement located in the background of the image?": "Yes",
        "Is the pot with the plant located on the right side of the bike?": "Yes"
    },
    "000000294695": {
        "Are the flags positioned between the sea and the dustbin on the sand?": "Yes",
        "Is the bridge located over the sea?": "Yes",
        "Are the two women walking towards the stairs near the dustbin?": "Yes",
        "Are the two women walking towards the stairs?": "Yes",
        "Is there a kite flying above the flags?": "Yes"
    },
    "000000295713": {
        "Is the purse on a big stone beside the woman?": "Yes",
        "Is there grass on the left side of the image?": "Yes",
        "Are people standing near water on the top right corner of the image?": "Yes",
        "Is the purse placed next to the woman on the stone?": "Yes",
        "Is the statue sitting on a bench and holding an object?": "Yes"
    },
    "000000296222": {
        "Is the man wearing a black t-shirt and glasses positioned in the middle of the image?": "Yes",
        "Is the freezer located on the right side of the image?": "Yes",
        "Is there a blue glass on top of the freezer?": "Yes",
        "Is the blue glass on top of the freezer?": "Yes",
        "Is the metal stand located on the left side of the man?": "Yes"
    },
    "000000296649": {
        "Are the huge buildings positioned side by side in the image?": "Yes",
        "Is the black car located on the right side of the image?": "Yes",
        "Can we see the sky and wires at the top of the image?": "Yes",
        "Are the buildings positioned next to each other?": "Yes",
        "Is there a person sitting on the back seat of a motorbike?": "Yes"
    },
    "000000297084": {
        "Is the woman sitting in front of the table?": "Yes",
        "Are there two other persons working behind the woman?": "Yes",
        "Is the window located behind the woman?": "Yes",
        "Is the table in front of the woman?": "Yes"
    },
    "000000297353": {
        "Is the person standing on a purple bed?": "Yes",
        "Is there a wooden table with shelves on the right corner?": "Yes",
        "Is there a bed lamp on the table in the left corner?": "Yes",
        "Is the person standing on the bed while playing the guitar?": "Yes",
        "Are there photos placed on the wall behind the person?": "Yes"
    },
    "000000298396": {
        "Is the dining table in the middle of the kitchen?": "Yes",
        "Are the chairs positioned in front of the dining table?": "Yes",
        "Is the clock located on the wall?": "Yes",
        "Is the basket of fruits on the dining table?": "Yes",
        "Are there frames on the cupboards?": "Yes"
    },
    "000000299887": {
        "Is the red color bike positioned towards the left side of the image?": "No",
        "Is the woman standing on the right side of the man?": "Yes",
        "Are the green color trees in the background of the image?": "Yes",
        "Is the man sitting on the bike?": "Yes",
        "Is the woman standing to the right of the man?": "Yes"
    },
    "000000301867": {
        "Are two women standing under the umbrella?": "Yes",
        "Is there a banner tied to the poles on the wall?": "Yes",
        "Are there flags near the banner?": "Yes",
        "Is a banner tied to the poles on the wall?": "Yes"
    },
    "000000302536": {
        "Is the table positioned in front of the wall with the mirror?": "Yes",
        "Is the billiards board located near the windows?": "Yes",
        "Is the man standing closer to the sofa or the table?": "The sofa",
        "Is the man standing near the billiards board?": "Yes",
        "Are the boxes on the table in front of the photo frame?": "Yes"
    },
    "000000303653": {
        "Is the person in the black dress in the center of the image?": "No",
        "Is the white chair visible in the background?": "Yes",
        "Is the reflection of the person in the red t-shirt on the left side of the mirror?": "Yes",
        "Are the reflections of the persons captured in the mirror?": "Yes",
        "Is the white chair located in the background?": "Yes"
    },
    "000000303713": {
        "Is the person playing tennis located in the center of the image?": "Yes",
        "Is the red-colored bag located to the left of the player?": "Yes",
        "Are the scoreboards located at the top of the image?": "Yes",
        "Is the bag placed on the table?": "No",
        "Are the scoreboards located above the people sitting?": "Yes"
    },
    "000000304365": {
        "Is the name of the website located at the bottom left side of the image?": "Yes",
        "Is the yellow train coming towards the camera?": "Yes",
        "Is there a man walking with a bag on the right side of the platform?": "Yes",
        "Is the man walking to the right side of the platform?": "Yes",
        "Are there plants on either side of the railway track?": "Yes"
    },
    "000000304404": {
        "Is the person with the baseball bat positioned in the foreground of the image?": "Yes",
        "Are the people under the umbrellas positioned behind the plants and trees?": "Yes",
        "Is there a brick wall visible in the background of the image?": "Yes",
        "Is the man with the baseball bat in front of the person wearing a baseball glove?": "Yes",
        "Are there people sitting and standing under the umbrellas?": "Yes"
    },
    "000000305609": {
        "Is the menu card located at the front of the table?": "Yes",
        "Is there a plate with a bowl and food item on the left side of the table?": "Yes",
        "Is there a fork on the top right of the table?": "Yes",
        "Is there a sandwich on the plate with the menu card?": "Yes",
        "Is the fork located beside the food item on the right?": "Yes"
    },
    "000000308328": {
        "Is the vehicle that looks like a trolley positioned in the center of the image?": "Yes",
        "Is the woman holding a paper standing on the left side of the image?": "Yes",
        "Is there a road in the background of the image?": "Yes",
        "Is there a vehicle with luggage bags inside it at the center of the image?": "Yes",
        "Is there a woman holding a paper in her hand on the left side in the front?": "Yes"
    },
    "000000308793": {
        "Is the stick positioned on the left side of the image?": "Yes",
        "Is the person climbing the mountain on the right side of the image?": "Yes",
        "Are the rocks and grass located behind the person who is climbing?": "Yes",
        "Is there a hand holding the stick in the sand?": "Yes",
        "Is there a person climbing up the mountain behind the rocks and grass?": "Yes"
    },
    "000000309391": {
        "Is the bus in blue color positioned on the right side of the image?": "Yes",
        "Are the five cars located in the middle of the picture?": "Yes",
        "Are the wires connected to electric poles located on the top of the picture?": "Yes",
        "Are the cars moving in the same direction as the bus?": "Yes",
        "Is the man in the blue jacket near the cars?": "Yes"
    },
    "000000311392": {
        "Is the buffalo black and white in color?": "Yes",
        "Is the man wearing a jacket standing near a fencing?": "Yes",
        "Are there posters, sign boards, and a light in the top right corner?": "Yes",
        "Is the buffalo standing near the man?": "Yes",
        "Are the two persons on the right standing near a table?": "Yes"
    },
    "000000312192": {
        "Is the plate with meat, pizza, and leaves positioned centrally on the table?": "Yes",
        "Is the wine bottle located to the left side of the image?": "Yes",
        "Is the wine glass filled with red wine on the table?": "Yes",
        "Is there a fork on the table?": "Yes",
        "Is the wine glass filled with red wine next to the wine bottle?": "No"
    },
    "000000312421": {
        "Is the suitcase on the bottom right side of the image?": "Yes",
        "Are there two persons standing behind the suitcase?": "Yes",
        "Is there a bike on the bottom left side of the image?": "Yes",
        "Is the suitcase on the table?": "Yes",
        "Are the people walking on the road in front of a vehicle?": "Yes"
    },
    "000000313182": {
        "Is the bus positioned more towards the right side of the image?": "Yes",
        "Are the people standing located to the left of the image?": "Yes",
        "Are the buildings seen in the background of the image?": "Yes",
        "Are there people sitting inside the bus?": "Yes",
        "Are the people with cameras and bags standing to the left of the bus?": "Yes"
    },
    "000000314251": {
        "Is the board with text located on the right side of the image?": "Yes",
        "Are the people on bikes positioned in the middle of the image?": "Yes",
        "Is the sidewalk located to the left of the road in the image?": "No",
        "Are the people riding bikes on the road?": "Yes",
        "Is the board with the text on the right side of the image?": "Yes"
    },
    "000000317433": {
        "Are the horses on the right side of the image?": "Yes",
        "Is there a man holding a rope on the left side of the image?": "Yes",
        "Are there trees in the background of the image?": "Yes",
        "Are the two horses tied with chains and ropes?": "Yes",
        "Is the man on the left holding a rope in his hands?": "Yes"
    },
    "000000319100": {
        "Are the two people positioned in the center of the image?": "Yes",
        "Is there a table on the right side of the image?": "Yes",
        "Are there photo frames in the background?": "Yes",
        "Are the people on the couch holding remotes?": "Yes",
        "Is there a television under the table?": "Yes"
    },
    "000000319184": {
        "Are two women running on the top left side of the image?": "Yes",
        "Are there a few people standing on the top right side of the image?": "Yes",
        "Is there grass at the bottom of the image?": "Yes",
        "Are the two women running located at the top left side of the image?": "Yes",
        "Is there fencing behind the people standing at the top right side of the image?": "Yes"
    },
    "000000319607": {
        "Is there a sign board in the foreground of the image?": "Yes",
        "Is the person riding the bicycle on the road?": "Yes",
        "Is the building on the left side of the image?": "Yes",
        "Is the sign board attached to the traffic signal pole?": "Yes",
        "Is the railing beside the road?": "Yes"
    },
    "000000320743": {
        "Are there people sitting on top of the elephants?": "Yes",
        "Is there a man in uniform standing in the background?": "Yes",
        "Are the people wearing the same color of dress and hat?": "Yes",
        "Are people sitting on the elephants?": "Yes",
        "Is there a man standing in the background?": "Yes"
    },
    "000000322610": {
        "Is the woman sitting on the bench holding an umbrella on the right side of the image?": "Yes",
        "Are the people walking positioned on the left side of the image?": "Yes",
        "Are the trees visible on the left side of the image?": "Yes",
        "Is the woman on the bench holding both a bag and an umbrella?": "Yes",
        "Is there a reflection of a tree on the glass doors?": "Yes"
    },
    "000000324158": {
        "Is the man skating in the middle of the image?": "Yes",
        "Is there grass on the bottom right side of the image?": "Yes",
        "Are there trees and vehicles on the top right side of the image?": "Yes",
        "Is the man skating beside the dog?": "Yes",
        "Are the vehicles located to the left of the fencing?": "Yes"
    },
    "000000324258": {
        "Is the person wearing a blue t-shirt standing on the left side of the image?": "Yes",
        "Are the laptops on the black tables behind the two people?": "Yes",
        "Is the green sofa positioned on the right side of the image?": "Yes",
        "Are the two people holding wires in front of the black tables?": "Yes",
        "Is the green sofa located to the right of the people?": "Yes"
    },
    "000000325838": {
        "Is the woman sitting in front of the table?": "Yes",
        "Is the laptop on the table blue in color?": "Yes",
        "Are there a number of laptops on the table?": "Yes",
        "Is the woman sitting in front of the table where the laptops are placed?": "Yes",
        "Is the mouse being held by the woman in front of the keyboard?": "Yes"
    },
    "000000326541": {
        "Is there a person on the left side of the image?": "Yes",
        "Are the hands of a person visible in the bottom right side of the image?": "Yes",
        "Is the building visible in the image?": "Yes",
        "Are both persons holding a mobile phone in their hand?": "Yes",
        "Are the hands of the person at the bottom right side in front of the glass window?": "No"
    },
    "000000327701": {
        "Is the woman in the red dress positioned in the middle of the image?": "Yes",
        "Are the net and pole located in the background of the image?": "Yes",
        "Is the house positioned in the background?": "Yes",
        "Is the woman holding a bat near the grass?": "Yes",
        "Is there a net between the woman and the boy?": "Yes"
    },
    "000000329614": {
        "Is the man holding a bag positioned to the left of the image?": "Yes",
        "Are the buildings and street lights in the background of the image?": "Yes",
        "Is the tree located to the right of the image?": "Yes",
        "Is the man walking to the left of the road?": "Yes",
        "Is the dustbin located to the right of the road?": "Yes"
    },
    "000000330818": {
        "Is the wall clock located in the top right corner of the image?": "Yes",
        "Are the sauce bottles positioned in the left bottom of the image?": "Yes",
        "Are the food items and bowls on the right side of the image?": "Yes",
        "Is the man holding the cloth in his hand?": "Yes",
        "Is the wall clock located above the board?": "Yes"
    },
    "000000331799": {
        "Is the woman standing directly in front of the table?": "Yes",
        "Is the board with \"America\" written on it placed behind the woman?": "Yes",
        "Is the man holding the white cover located on the left side of the image?": "Yes",
        "Is the cotton box placed on the table?": "Yes",
        "Is the board with \"America\" written on it positioned on the wall behind the woman?": "Yes"
    },
    "000000331817": {
        "Is the flower pot located on the left side of the image?": "Yes",
        "Is the television positioned in front of the flower pot?": "Yes",
        "Is the persons hand on the left side of the image?": "No",
        "Is the flower pot positioned to the left of the television?": "Yes",
        "Is the person's hand on the right side of the table?": "Yes"
    },
    "000000333402": {
        "Is the man with the headset located at the bottom right of the image?": "Yes",
        "Is the tree along with the pole and bus stop located at the top right of the image?": "Yes",
        "Is the road located at the bottom left of the image?": "Yes",
        "Is the man walking towards the bus?": "Yes",
        "Is the tree located near the bus stop?": "Yes"
    },
    "000000334371": {
        "Are the buses traveling on the left side of the road?": "No",
        "Is the car positioned on the right side of the image?": "Yes",
        "Is the man standing in the middle of the image?": "Yes",
        "Is the man standing in front of the traffic lights and pole?": "Yes",
        "Are the buses traveling on the road alongside a car?": "Yes"
    },
    "000000334483": {
        "Are the few people standing in the middle of the image?": "Yes",
        "Are there three children standing and holding something in their hands on the bottom left side of the image?": "Yes",
        "Is there a table with plates and a cake on the bottom right side of the image?": "Yes",
        "Are the children standing on grass?": "No",
        "Is the table located on the bottom right side of the image?": "Yes"
    },
    "000000334767": {
        "Are there two people on ski boards on the left side of the image?": "Yes",
        "Is there a man skiing in the center of the image?": "Yes",
        "Are there trees visible in the background?": "Yes",
        "Are the three men in the middle, left, and right all holding sticks and driving ski boards?": "Yes",
        "Is there ice at the bottom of the image?": "Yes"
    },
    "000000336053": {
        "Are the two kids sitting in front of the table in the foreground?": "Yes",
        "Is there a person sitting alone on the chair in the left top of the image?": "Yes",
        "Are three persons sitting on chairs in front of a table in the right top of the image?": "Yes",
        "Are the two kids sitting in front of the table with juice glasses and food items?": "Yes",
        "Is there a photo frame visible on the wooden wall in the middle top of the image?": "Yes"
    },
    "000000336356": {
        "Is the woman in the black dress sitting in front of the table with pizzas on it?": "Yes",
        "Are there three people sitting behind the woman in the black dress?": "Yes",
        "Is the bottle located on the table near the two pizzas?": "Yes",
        "Is the woman sitting in front of the table with the pizzas?": "Yes"
    },
    "000000336628": {
        "Is the person in the center of the image getting down from the bus?": "Yes",
        "Are there people sitting on a bench behind the person getting down from the bus?": "Yes",
        "Is the banner attached to the left side of the bus?": "Yes",
        "Is the person who is getting down from the bus in the center of the image?": "Yes",
        "Is there a group of persons sitting on the bench on the bus behind the person getting down?": "Yes"
    },
    "000000336658": {
        "Are the buses parked on the right side of the image?": "Yes",
        "Is there a shed with people standing below it on the left side of the image?": "Yes",
        "Is there a garden in the middle of the image?": "Yes",
        "Are the buses parked to the right?": "Yes",
        "Is there a small garden in the middle?": "Yes"
    },
    "000000338624": {
        "Is there a dog on the left side of a person walking on the road?": "Yes",
        "Are there chairs placed in front of the building on the right side?": "Yes",
        "Are there vehicles visible in the left corner of the image?": "Yes",
        "Is the person walking beside the black dog?": "Yes",
        "Are the chairs positioned in front of the building?": "Yes"
    },
    "000000338625": {
        "Is the walkway located to the right side of the image?": "Yes",
        "Are the buildings positioned on the left side of the road?": "Yes",
        "Is there a bus stop visible on the right side of the image?": "Yes",
        "Is there a bus stop located on the walkway?": "Yes",
        "Are the buildings situated to the left of the bus?": "Yes"
    },
    "000000342128": {
        "Is the man holding a racket standing in the foreground of the image?": "Yes",
        "Are the women dancing on the stage located behind the man with the racket?": "Yes",
        "Are the chairs situated on the grass in the outdoor setting?": "Yes",
        "Is the man holding a racket in front of people sitting at tables?": "Yes",
        "Are there two women dancing on the stage in the middle of the image?": "Yes"
    },
    "000000342367": {
        "Is the man standing and talking in the center of the picture?": "Yes",
        "Is the woman in the foreground of the image?": "Yes",
        "Are the mics positioned around the people in the image?": "Yes",
        "Are the benches located in the background of the picture?": "No"
    },
    "000000343218": {
        "Is the person in the foreground holding a racket and standing in a position to hit a ball?": "Yes",
        "Are there balls visible on the ground and in the baskets?": "Yes",
        "Are there vehicles and grass visible behind the fence?": "Yes",
        "Is the person standing far holding both a racket and a ball?": "Yes",
        "Are there balls both in the basket and on the ground?": "Yes"
    },
    "000000343466": {
        "Is the sink located at the bottom right of the image?": "Yes",
        "Are the wooden cupboards positioned at the top right of the image?": "Yes",
        "Is the stove located below the exhaust on the right side of the image?": "Yes",
        "Is the stove located below the exhaust?": "Yes",
        "Is the sink positioned to the right of the stove?": "Yes"
    },
    "000000344268": {
        "Is the man with the blue jacket standing in front of the podium?": "Yes",
        "Are there two microphones on the podium?": "Yes",
        "Is there a star symbol above the axe and hammer on the flag?": "Yes",
        "Is the man standing in front of the podium?": "Yes",
        "Is the axe and hammer symbol to the left side of the flag?": "Yes"
    },
    "000000344888": {
        "Are the three brown horses standing in the center of the image?": "Yes",
        "Is the red car parked on the right side of the image?": "No",
        "Are there trees visible in the background?": "Yes",
        "Is the red color car parked in the left corner behind the green grass field?": "Yes"
    },
    "000000345252": {
        "Is the man sitting on the right side of the image?": "Yes",
        "Are there three Mountain Dew tins to the left of the table?": "Yes",
        "Is there a Rubik's cube to the right side of the man?": "Yes",
        "Is the man sitting in front of the table with the monitor and keyboard?": "Yes",
        "Is there a lamp to the right side of the man?": "Yes"
    },
    "000000345356": {
        "Is there a photo frame on the wall behind the men?": "Yes",
        "Is the man holding a mobile phone wearing a black costume on the left side of the image?": "Yes",
        "Is there a sauce bottle on the table in front of the men?": "Yes",
        "Is the man wearing a black costume holding a mobile phone?": "Yes",
        "Is there a flower vase on the shelf behind the men?": "Yes"
    },
    "000000346703": {
        "Is the man in the black t-shirt positioned in front of the wall with the mirror?": "Yes",
        "Are the two women sitting beside the man on the sofa?": "Yes",
        "Are the candles with flames positioned in front of the people?": "Yes",
        "Is the man in the black t-shirt standing beside the women sitting on the sofa?": "Yes",
        "Are the candles with flame located in front of the people?": "Yes"
    },
    "000000350122": {
        "Is the blurry picture of a person with a cycle located in the foreground of the image?": "Yes",
        "Are the people standing with jackets and bags on the left side of the vehicle in the background?": "Yes",
        "Is the board with \"FSG\" written on it hanging above the standing people?": "Yes",
        "Is the person with the cycle near the vehicle in the background?": "No",
        "Are the boards with \"FSG\" written on them located above the people standing?": "Yes"
    },
    "000000350148": {
        "Is the man with the floral shirt sitting in front of the table?": "Yes",
        "Is the door located in the left corner of the image?": "Yes",
        "Are there people sitting behind the man with the camera?": "Yes",
        "Is the man holding a camera in front of the table with plates on it?": "Yes",
        "Is there a watch to the left of the man?": "Yes"
    },
    "000000351810": {
        "Are the luggage bags positioned centrally in the image?": "Yes",
        "Is the hanger located on the left side of the image?": "No",
        "Is the lamp hanging from the ceiling in the upper part of the image?": "Yes",
        "Are the luggage bags placed around the table?": "Yes",
        "Are there two people sitting together on chairs?": "Yes"
    },
    "000000352684": {
        "Is the man in the white shirt standing in the middle of the image?": "Yes",
        "Is the woman with the scarf positioned on the right side of the image?": "Yes",
        "Are there lights on the ceiling at the top of the image?": "Yes",
        "Are there people standing and talking with each other in the background?": "Yes",
        "Is there a man in a white shirt and black shoes standing in the middle?": "Yes"
    },
    "000000354547": {
        "Is the person wearing a white suit positioned in the foreground of the image?": "Yes",
        "Are the buildings with white walls located in the background of the image?": "Yes",
        "Are the plants and trees visible in the middle of the image?": "Yes",
        "Is the person standing in front of the plants and trees?": "Yes",
        "Are the buildings situated behind the plants and trees?": "Yes"
    },
    "000000356424": {
        "Is the plate with food positioned on the table in front of the person?": "Yes",
        "Are the two persons sitting on chairs visible through the glass door in the background?": "Yes",
        "Is the sign board located on the left side of the image?": "Yes",
        "Are the two persons in the background seated on chairs?": "Yes",
        "Is the glass with ice cubes located on the table?": "Yes"
    },
    "000000357888": {
        "Is the man in the orange t-shirt standing in front of the shelf?": "Yes",
        "Is the cupboard and desk located on the right side of the image?": "Yes",
        "Is the box positioned in front of the man?": "Yes",
        "Is there a box in front of the man holding the kite?": "Yes",
        "Are there any photo frames attached to the wall?": "Yes"
    },
    "000000357978": {
        "Is the woman in the white dress positioned in the center of the image?": "Yes",
        "Is there a couch on the left side of the image?": "Yes",
        "Is the dining table in the center of the background?": "Yes",
        "Is the woman in the white dress standing next to the woman in the red shirt?": "Yes",
        "Is the man walking on the mat in the background?": "Yes"
    },
    "000000361238": {
        "Is the pizza located on the table in front of the seated woman?": "Yes",
        "Is the woman in the pink T-shirt standing near the desk in the background?": "Yes",
        "Is there a plant visible on the desk in the background?": "Yes",
        "Is the woman standing in the background near the desk wearing a pink T-shirt?": "Yes",
        "Is the pizza on the table garnished with vegetables and cheese?": "Yes"
    },
    "000000361586": {
        "Is the ticket counter positioned in the middle of the hall?": "Yes",
        "Is there a vending machine at the left corner of the image?": "Yes",
        "Are people walking and standing at the right corner of the hall?": "Yes",
        "Are there people standing in line in front of the ticket counter?": "Yes",
        "Is there a vending machine at the left corner?": "Yes"
    },
    "000000365208": {
        "Is the person in white standing behind the table?": "Yes",
        "Are the two white chairs in front of the table?": "Yes",
        "Are the decorative items hanging on the right side of the image?": "Yes",
        "Is the cage beside the person standing?": "Yes",
        "Are the two chairs in front of the table?": "Yes"
    },
    "000000366884": {
        "Is the black dog located at the bottom of the picture?": "Yes",
        "Is the black cupboard on the left side of the image?": "No",
        "Can the carton boxes be seen in the mirrors reflection?": "Yes",
        "Is the black dog on the bed near the black cupboard?": "No",
        "Is the mirror reflecting the carton box and musical instrument?": "Yes"
    },
    "000000367095": {
        "Is the table with the laptop located in the middle of the image?": "Yes",
        "Is the man wearing a jacket on the right side of the image?": "Yes",
        "Are there pillars visible in the background of the image?": "Yes",
        "Is there a monitor on the table where the man in the middle is sitting?": "Yes",
        "Is the man on the right sitting in front of a monitor?": "Yes"
    },
    "000000368684": {
        "Is the wooden chair positioned in the center of the image?": "Yes",
        "Is the television on the right side of the image?": "Yes",
        "Is the laptop located in the bottom left corner of the image?": "Yes",
        "Is the chair beside the door?": "Yes",
        "Is the television on the right side of the painting?": "Yes"
    },
    "000000368752": {
        "Is the table positioned in the middle of the image?": "Yes",
        "Is the boy on the left wearing a t-shirt?": "Yes",
        "Are there people in the background of the image?": "Yes",
        "Is the table positioned between the people and the background?": "Yes",
        "Is the cup on the table in front of the smiling boy?": "Yes"
    },
    "000000371749": {
        "Is the woman in the grey top positioned on the right side of the image?": "No",
        "Is the photo frame with the white dog positioned above the white couch?": "Yes",
        "Are the women holding things in their hands in front of the white couch?": "Yes",
        "Is the photo frame above the white couch?": "Yes",
        "Are both women holding something in their hands?": "Yes"
    },
    "000000372203": {
        "Is the lamp positioned to the left of the bench on the path?": "Yes",
        "Are the hills located in the background of the image?": "Yes",
        "Is the direction board to the right of the bench?": "Yes",
        "Is the lamp fixed to the pole placed on the path?": "Yes",
        "Are the hills in the background situated behind the direction boards?": "Yes"
    },
    "000000373353": {
        "Are there buildings on both the left and right sides of the image?": "Yes",
        "Is the red bus positioned behind the yellow car in the center of the image?": "Yes",
        "Are there clouds visible in the sky at the top of the image?": "Yes",
        "Is the red bus behind the yellow car?": "Yes",
        "Are there people walking on the road in the foreground?": "Yes"
    },
    "000000373382": {
        "Is the boy positioned in the center of the image?": "Yes",
        "Are the group of people sitting on the right side of the image?": "Yes",
        "Are there trees in the background area of the image?": "Yes",
        "Is the boy hitting the ball with his tennis bat?": "Yes",
        "Are the people sitting on the right side of the image?": "Yes"
    },
    "000000374083": {
        "Is the girl standing to the left of the man?": "Yes",
        "Are the cakes positioned in the foreground of the image?": "Yes",
        "Is the cupboard visible in the background on the left side of the image?": "Yes",
        "Is the spoon on the table near the cakes?": "Yes",
        "Is the man holding a plate?": "Yes"
    },
    "000000374545": {
        "Is there a plant with flowers on the right corner of the image?": "Yes",
        "Is the flag positioned in the middle of the image?": "Yes",
        "Is the road located at the bottom of the image?": "Yes",
        "Are the group of people standing on grass?": "Yes"
    },
    "000000376322": {
        "Is the mobile phone positioned in the center of the table?": "Yes",
        "Is the woman holding a glass in her hand on the right side of the image?": "Yes",
        "Is there a grill metal on the right side of the image?": "Yes",
        "Is the woman on the right side holding an object?": "Yes",
        "Is the person on the left side holding a paper?": "Yes"
    },
    "000000376900": {
        "Is the person wearing a white dress on the left side of the image?": "Yes",
        "Are there street lights on the left of the image?": "No",
        "Are the trees located in the right background of the image?": "Yes",
        "Is the person holding the tennis racket on the left side of the image?": "Yes",
        "Are there trees in the right background of the image?": "Yes"
    },
    "000000377486": {
        "Is the man on the horse located on the right side of the image?": "Yes",
        "Is there mud on the ground at the bottom of the image?": "Yes",
        "Are there people sitting on horses in the background?": "Yes",
        "Is the man on the horse beside the running bull?": "Yes",
        "Are there people both standing and sitting on horses in the background?": "Yes"
    },
    "000000377588": {
        "Are there two players with grey and blue uniforms positioned in the middle of the image?": "Yes",
        "Is the man lying on the ground in the center of the image?": "Yes",
        "Is there a man with a helmet standing and holding a bat at the bottom of the image?": "Yes",
        "Are the two players in grey and blue uniform in the middle?": "Yes",
        "Is there a man with a helmet standing and holding a bat at the bottom?": "Yes"
    },
    "000000381971": {
        "Is the horse cart positioned on the left side of the image?": "Yes",
        "Are there trees visible in the image?": "Yes",
        "Is the volute pipe positioned on the right side of the image?": "Yes",
        "Is the horse cart on the left side of the image?": "Yes",
        "Is the volute pipe on the right side of the image?": "Yes"
    },
    "000000382111": {
        "Is the person in the center sitting on the horse?": "Yes",
        "Is the truck positioned on the right side of the image?": "Yes",
        "Are there trees visible in the background on the right side?": "Yes",
        "Is the person in the center sitting on the horse holding anything?": "Yes",
        "Is there a truck standing at the right side of the person on the horse?": "Yes"
    },
    "000000382125": {
        "Is one of the people holding a plate positioned on the left side of the image?": "Yes",
        "Is the door with the poster positioned in the center background of the image?": "Yes",
        "Is the lamp attached to the wall on the left side of the door?": "No",
        "Is one of the men holding a plate in his hand?": "Yes",
        "Is there a poster attached to the door handle?": "Yes"
    },
    "000000383384": {
        "Is the man holding a baseball bat located in the center of the image?": "Yes",
        "Is the man wearing a headset and holding a camera positioned in the front?": "Yes",
        "Is the man wearing a black shirt on the left side of the image?": "No",
        "Is the man wearing a black shirt on the right side in a squad position?": "Yes",
        "Is the man in the center wearing a blue helmet standing or in a squad position?": "In a squad position"
    },
    "000000383606": {
        "Is the mirror positioned at the back of the sink?": "Yes",
        "Is the soap dispenser located to the side of the mirror?": "Yes",
        "Is the dustbin located down towards the floor?": "Yes",
        "Is the towel hanging to the side of the sink?": "No",
        "Is the soap dispenser located next to the mirror?": "Yes"
    },
    "000000384527": {
        "Is the table with cups and saucers positioned in the middle of the room?": "Yes",
        "Is there a window on the left side of the image?": "Yes",
        "Are there cupboards on the right side of the image?": "Yes",
        "Are the cups on the table in the middle?": "Yes",
        "Is the photo frame on the table to the left of the room?": "Yes"
    },
    "000000385190": {
        "Is the signboard located beside the road?": "Yes",
        "Is the zebra crossing positioned at the bottom of the image?": "Yes",
        "Are the trees located in the background of the image?": "Yes",
        "Is the signboard located beside the pole?": "Yes",
        "Are the men with guitars shown on the banner located on the opposite side of the house?": "Yes"
    },
    "000000385997": {
        "Is the table with many jugs and bottles located at the bottom right side of the image?": "Yes",
        "Are the cycle and racks with many items on the left side of the image?": "Yes",
        "Is the dog sleeping in the middle of the image?": "Yes",
        "Is the table with jugs and bottles located on the right side bottom of the image?": "Yes",
        "Is the dog sleeping on a cloth in the middle of the image?": "Yes"
    },
    "000000386912": {
        "Is the wooden table in front of the woman?": "Yes",
        "Are the shelves with books and files positioned behind the woman?": "Yes",
        "Is there another table beside the woman?": "Yes",
        "Is the woman sitting in front of the wooden table with multiple items on it?": "Yes",
        "Are there shelves with books and files behind the woman?": "Yes"
    },
    "000000388903": {
        "Is the woman holding a mobile in the center of the image?": "Yes",
        "Is the man holding an apple on the left side of the woman?": "Yes",
        "Are there apples visible in the basket at the fruit shop?": "Yes",
        "Is the woman holding a mobile located in the center among the five persons?": "Yes",
        "Is the person wearing a cap on the left holding an apple?": "Yes"
    },
    "000000389532": {
        "Is the person standing on the right side of the image?": "Yes",
        "Is one of the birds perched on a pole?": "Yes",
        "Is the water visible in the bottom left side of the image?": "No",
        "Is the person taking a picture positioned to the right of the bird on the pole?": "Yes",
        "Are the two birds positioned above the water?": "No"
    },
    "000000391140": {
        "Is the man standing in front of the wall with a print on it?": "Yes",
        "Is the ceiling light visible in the background of the image?": "Yes",
        "Is the black color wooden table visible in this image?": "No",
        "Is the man holding the white color object with a cable near the wall with print on it?": "Yes",
        "Is the pipe next to the man attached to the ceiling?": "No"
    },
    "000000391722": {
        "Is there a table in the foreground of the picture?": "Yes",
        "Is the man in the blue shirt holding a cake positioned in the center of the image?": "Yes",
        "Is the curtain located on the right side of the image?": "Yes",
        "Is the knife on the table near the mobile phone?": "Yes",
        "Is the man holding the cake standing in the center of the picture?": "Yes"
    },
    "000000392722": {
        "Is the green bus on the right side of the image?": "Yes",
        "Is there a building with windows on the left side of the image?": "Yes",
        "Are there trees visible in the background of the image?": "Yes",
        "Are the two people standing in front of the bus?": "Yes",
        "Is the man walking in the middle of the image?": "Yes"
    },
    "000000393569": {
        "Is the washroom located on the left side of the image?": "Yes",
        "Is there a bucket under the wash basin in the washroom?": "Yes",
        "Is the lady with a bag sitting on a bed on the right side of the image?": "Yes",
        "Is the heater installed above the toilet with flush?": "Yes",
        "Is the lady seated on a bed with wooden sides?": "Yes"
    },
    "000000395801": {
        "Is the clock located on the right side of the image?": "Yes",
        "Is the traffic cone found on the left side of the image?": "Yes",
        "Is the woman in a red jacket sitting near the dustbin?": "Yes",
        "Is the woman sitting next to the dustbin?": "Yes",
        "Is the clock on the right side of the image?": "Yes"
    },
    "000000397133": {
        "Is the person standing near the sink area?": "Yes",
        "Are the utensils hanging on the wall behind the person?": "Yes",
        "Is the plant with leaves hanging on the left side of the image?": "Yes",
        "Are the utensils hanging on the wall close to the person standing?": "Yes",
        "Is the lamp attached to the rooftop near the utensils hanging to the wall?": "Yes"
    },
    "000000397303": {
        "Is the person sitting on the chair located in front of the table?": "Yes",
        "Are the tents visible in the background of the image?": "Yes",
        "Is the laptop positioned on the left side of the table?": "Yes",
        "Is the person sitting on the chair in front of the table with the laptop?": "Yes",
        "Are the tents situated in the background of the image?": "Yes"
    },
    "000000398377": {
        "Are the three women sitting on the left side of the image?": "Yes",
        "Is there another person with a bag sitting in the right corner of the image?": "Yes",
        "Is there a reflection of a tube light on the glass window?": "Yes",
        "Are all three women on the bench holding something?": "Yes"
    },
    "000000401862": {
        "Are the people standing in front of the red vehicle?": "Yes",
        "Is there a board to the side of the vehicle?": "Yes",
        "Is the person in a purple dress walking on the right side of the image?": "Yes",
        "Are the people standing in front of the bus?": "Yes",
        "Is the person walking wearing a purple color dress to the right of the bus?": "Yes"
    },
    "000000402615": {
        "Is the woman wearing the yellow top standing on the right side of the image?": "Yes",
        "Is the net positioned in the middle of the court?": "Yes",
        "Are the group of people sitting on chairs in the background located on the left side of the image?": "No",
        "Is the net positioned between the woman and the chairs?": "Yes",
        "Are the group of people sitting in the background located behind the net?": "Yes"
    },
    "000000403565": {
        "Is the bicycle positioned to the left of the man?": "No",
        "Are the plants in the background of the image?": "Yes",
        "Is the bag placed on the ground near the bicycle?": "Yes",
        "Is the man holding the camera while standing on the ground?": "Yes",
        "Are the bicycle and the bag placed on the ground near the man?": "Yes"
    },
    "000000405195": {
        "Is the menu board located in the background of the image?": "Yes",
        "Are the desserts and doughnuts positioned in the front of the image?": "Yes",
        "Is the wall clock on the left side of the image?": "No",
        "Is the menu board located behind the box of desserts and doughnuts?": "Yes",
        "Are the doors and wall situated to the right of the box of desserts?": "Yes"
    },
    "000000405279": {
        "Is the water on the left side of the image?": "Yes",
        "Are the people standing near a tree on the right side of the image?": "Yes",
        "Is the person sitting on a bench located in the center of the image?": "No",
        "Are the kids standing near the water?": "Yes",
        "Is the person sitting on the bench near the people standing by the tree?": "No"
    },
    "000000407868": {
        "Is the man with the black and white t-shirt in the center of the image?": "Yes",
        "Are there three benches on the right side in the background?": "Yes",
        "Is there a road visible in the background?": "Yes",
        "Is the man with the black and white t-shirt holding a kite?": "Yes",
        "Are there three benches to the right of the person running with the kite?": "Yes"
    },
    "000000408120": {
        "Is the person walking in the center of the lane?": "Yes",
        "Is the black fencing located to the left of the lane?": "Yes",
        "Are the plants with purple flowers positioned on the right side of the lane?": "Yes",
        "Is the person holding the pink umbrella walking towards the road?": "Yes",
        "Are the plants with purple flowers located to the right of the person?": "Yes"
    },
    "000000408696": {
        "Is the man sitting on the toilet cupboard positioned on the right side of the image?": "No",
        "Are the cardboard boxes located near the left side of the image?": "Yes",
        "Is the light situated at the top of the image?": "Yes",
        "Is the man sitting on the toilet cupboard near the cardboard boxes?": "Yes",
        "Is the light positioned above the man sitting on the toilet cupboard?": "Yes"
    },
    "000000408774": {
        "Is the man running with the bat located in the center-left of the image?": "Yes",
        "Are there trees visible at the top of the background?": "Yes",
        "Is the man diving located in the background of the image?": "Yes",
        "Is the man running with the bat located in the center of the left side of the image?": "Yes",
        "Is the net located behind the man diving in the background?": "Yes"
    },
    "000000410880": {
        "Is the teddy bear sitting near the glass door?": "Yes",
        "Can a woman be seen through the glass door in the image?": "Yes",
        "Are there items on the table in the room near the teddy bear?": "Yes",
        "Is the big teddy bear sitting on the chair near the door?": "Yes",
        "Are there people standing in the room near the teddy bear?": "Yes"
    },
    "000000411530": {
        "Are the containers positioned on the left side of the image?": "Yes",
        "Is the small house in front of the black stand?": "Yes",
        "Are the snow-covered trees in the background?": "Yes",
        "Are the containers traveling on cables in the image?": "Yes",
        "Is the black stand used for the passing of containers?": "Yes"
    },
    "000000412894": {
        "Is the group of people standing near the traffic signal located at the bottom of the image?": "Yes",
        "Are the people holding a white bag positioned behind the group near the traffic signal?": "Yes",
        "Is there a flag on top of one of the buildings in the background?": "Yes",
        "Are the people standing near the traffic signal closer to the camera than those holding a white bag?": "Yes",
        "Is the flag on the top of the building in the background?": "Yes"
    },
    "000000413689": {
        "Are the two women standing in the foreground of the image?": "Yes",
        "Is the man on the scooter located in front of the women?": "Yes",
        "Is the blue bridge on the left side of the image?": "Yes",
        "Are the two women standing close to the zebra crossing?": "Yes",
        "Is the traffic signal visible near the buildings?": "Yes"
    },
    "000000414673": {
        "Is the kid holding a bat located in the middle of the image?": "Yes",
        "Are some people seated and some standing in the group?": "Yes",
        "Are the bats and net found in front of the group?": "No",
        "Is the kid holding a bat in the middle of the image?": "Yes",
        "Are there objects like baggage and bottles in front of the group of people?": "Yes"
    },
    "000000416451": {
        "Is the person sitting on the exercise cycle positioned on the left side of the image?": "Yes",
        "Is the wooden table with the wine bottle and books on it located at the bottom right side of the image?": "Yes",
        "Is the wooden shelf with books kept inside located on the right side of the image?": "Yes",
        "Is the person on the exercise cycle holding a device?": "Yes",
        "Are there books kept inside the wooden shelf?": "Yes"
    },
    "000000419408": {
        "Is the man sitting on the bench located to the right of the man on the skateboard?": "Yes",
        "Is the building in the background white in color?": "Yes",
        "Are the plants located behind the two men?": "Yes",
        "Is the man on the skateboard jumping from the railing?": "Yes"
    },
    "000000419974": {
        "Is the man wearing a black shirt positioned in the middle of the image?": "Yes",
        "Is the woman sitting on the chair positioned to the left of the window?": "Yes",
        "Is the dog beside the man on the left side of the image?": "Yes",
        "Is the man standing in front of the table where the cutting pad is placed?": "Yes",
        "Is the woman sitting in front of the table in the background?": "Yes"
    },
    "000000422706": {
        "Is the girl with golden hair standing on the left side of the image?": "Yes",
        "Is the small boat positioned below the people on the deck?": "Yes",
        "Are the trees in the background on the right side of the image?": "Yes",
        "Is the small boat being lowered by the crane and cables?": "Yes",
        "Are both the girl and the man looking at the small boat?": "Yes"
    },
    "000000424162": {
        "Is the car on the left side of the image on the road?": "Yes",
        "Is the pole located behind the dog?": "Yes",
        "Are the sign boards positioned behind the women and the person with the bicycle?": "Yes",
        "Is the belt held by the woman wearing a black top tied to the dog?": "Yes",
        "Is the person with a bicycle on the pavement behind the woman in a black top?": "Yes"
    },
    "000000424975": {
        "Are the two people near the wall positioned to the left of the flag?": "Yes",
        "Is the sky visible at the top of the image?": "Yes",
        "Is the store located on the left side of the image?": "Yes",
        "Are the two people near the wall interacting with the graffiti?": "Yes",
        "Is the flag located to the right of the house?": "Yes"
    },
    "000000425361": {
        "Is the man holding the glass with his right hand?": "Yes",
        "Is the black jacket on the back of the chair?": "Yes",
        "Is the laptop positioned on the table to the right side of the image?": "Yes",
        "Is the man holding a glass while sitting on the chair?": "Yes",
        "Is the laptop located on the table to the right side of the man?": "Yes"
    },
    "000000426795": {
        "Is the man sitting on a chair while eating food with his hands?": "Yes",
        "Is there a tissue box behind the man on the table?": "Yes",
        "Are books visible on a shelf in the image?": "Yes",
        "Is the tissue box located behind the person who is sitting on the chair?": "Yes",
        "Is the mirror reflecting the light in the room?": "Yes"
    },
    "000000427256": {
        "Is the person with the baseball bat on the bottom left side of the image?": "Yes",
        "Are two persons playing baseball on the bottom right side of the image?": "Yes",
        "Is there a man holding a camera on the top right side of the image?": "Yes",
        "Is the person sitting on a chair holding a camera behind the fencing?": "Yes",
        "Are the two persons playing baseball located on the bottom right side of the image?": "Yes"
    },
    "000000429011": {
        "Is the car positioned on the right side of the image?": "Yes",
        "Is the truck located on the left side of the road?": "Yes",
        "Are there posters on the name board of the building in the background?": "Yes",
        "Is the car on the right side of the road located near the street light pole?": "Yes",
        "Is the person standing near the building with windows?": "Yes"
    },
    "000000431693": {
        "Is the man holding the tennis racket positioned on the right side of the image?": "No",
        "Are the tennis rackets hanging on the wall?": "Yes",
        "Is the groom stick placed at the corner of the tennis court area?": "Yes",
        "Is the man holding a tennis racket while playing on the tennis court?": "Yes",
        "Are there tennis rackets hanging on the wooden wall?": "Yes"
    },
    "000000433103": {
        "Are the kids sitting in the front row holding laptops?": "Yes",
        "Is there a woman sitting at the end of the row explaining to the kids?": "Yes",
        "Is there a blue wall in the background of the image?": "Yes"
    },
    "000000435208": {
        "Is the couch with the person on it positioned on the left side of the image?": "Yes",
        "Are the two desktop computers located in the background of the image?": "Yes",
        "Is the yellow-painted wall with dresses hanging on it on the left side of the image?": "Yes",
        "Is the person sitting on the couch facing the table?": "Yes",
        "Are the banners located on the wall behind the desktops?": "Yes"
    },
    "000000437351": {
        "Is the woman sitting on a suitcase?": "Yes",
        "Are the red and blue suitcases placed beside each other?": "Yes",
        "Is there a green handbag on top of the suitcases?": "Yes",
        "Is the green handbag placed on top of any suitcase?": "Yes"
    },
    "000000438774": {
        "Is the table with the cake positioned on the right side of the image?": "Yes",
        "Are the cupboards located on the top left side of the image?": "Yes",
        "Is the fridge visible in the background of the image?": "Yes",
        "Are the persons standing in front of the table?": "Yes",
        "Is the microwave oven located in the background?": "Yes"
    },
    "000000439773": {
        "Is the child wearing the white outfit laying on the floor mat?": "Yes",
        "Is the violet cell phone positioned on the floor near the child?": "Yes",
        "Is the golden toy in the background to the left of the child?": "Yes",
        "Is the toy with golden color near the child on the floor mat?": "No",
        "Is the violet cell phone placed on the brown floor?": "Yes"
    },
    "000000440184": {
        "Is the man with the white dress standing at the front side of the tennis court?": "Yes",
        "Is the lady with the black and white dress positioned to the left side of the image?": "No",
        "Is there an electric pole in the middle of the trees outside the fencing?": "Yes",
        "Is the lady with the black and white dress on the right side of the tennis court?": "Yes",
        "Is the man with the red dress positioned in the middle of the tennis court?": "Yes"
    },
    "000000440475": {
        "Is the table with the decorative flowers in the foreground of the image?": "Yes",
        "Is the sofa set located on the right middle side of the image?": "Yes",
        "Is the photo frame attached to the wall in the right corner?": "Yes",
        "Is the lamp on the table in the middle of the image?": "Yes",
        "Is there a man standing in the right corner near the window?": "Yes"
    },
    "000000441247": {
        "Is there a fan located at the top of the image?": "Yes",
        "Is the book on the left side of the image?": "Yes",
        "Is the bag on the floor near the sofa?": "Yes",
        "Is the woman standing near the kitchen platform?": "Yes",
        "Is there a stool near the kitchen platform?": "Yes"
    },
    "000000441442": {
        "Is the woman riding the horse positioned towards the center of the image?": "Yes",
        "Is the person sitting on a chair located in the left side corner of the image?": "Yes",
        "Is there a pole visible on the right side of the image?": "Yes",
        "Is the woman riding a horse?": "Yes",
        "Is there a table in front of the person sitting on the chair?": "Yes"
    },
    "000000441586": {
        "Is there a cycle on the left side of the image?": "Yes",
        "Is there a building on the right side of the image?": "Yes",
        "Are there poles and wires on the top of the image?": "Yes",
        "Is the person riding the vehicle positioned on the right side of the image?": "Yes"
    },
    "000000442456": {
        "Is the man in the red t-shirt sitting on the left side of the image?": "Yes",
        "Is the white car in the middle of the image?": "Yes",
        "Is the man in the yellow t-shirt walking on the right side of the image?": "Yes",
        "Is the man in the red t-shirt sitting on a wheel located next to the white car?": "Yes",
        "Is the man in the yellow t-shirt walking on the road to the right side of the image?": "Yes"
    },
    "000000447187": {
        "Is the person with the bat positioned to the left of the person throwing the ball?": "Yes",
        "Is the current pole visible behind the person throwing the ball?": "Yes",
        "Is the yellow rod positioned on the left side of the image?": "Yes",
        "Is the ball being thrown towards the person with the bat?": "Yes",
        "Are there trees behind the current pole in the background?": "Yes"
    },
    "000000447465": {
        "Is the lady in the red and blue dress standing in the foreground of the image?": "Yes",
        "Is the object on the left side of the image?": "Yes",
        "Are the trees visible in the background of the image?": "Yes",
        "Is the lady in the red and blue dress holding rods in her hand?": "Yes",
        "Is the lady in the blue and black dress standing on snow?": "Yes"
    },
    "000000448076": {
        "Are the bean bags positioned behind the group of women?": "Yes",
        "Is the table with the laptop on the right side of the image?": "Yes",
        "Is there a person wearing a white shirt and jeans on the left side of the image?": "Yes",
        "Are the bean bags located behind the women standing on the red carpet?": "Yes",
        "Is the laptop placed on the right side table near the plant?": "Yes"
    },
    "000000448410": {
        "Is the train positioned in the middle of the image?": "Yes",
        "Are the buildings located on the right side of the image?": "Yes",
        "Is the chimney on the top left of the image?": "Yes",
        "Is the person inside the engine on the train?": "Yes",
        "Are there people standing in front of the three people sitting on the left platform?": "Yes"
    },
    "000000450075": {
        "Is there a person in white attire tying a tie in the foreground?": "Yes",
        "Is the person half visible on the left side of the image?": "Yes",
        "Is the sky visible at the top of the image?": "Yes",
        "Is the person tying a tie standing in front of the other person in white attire?": "Yes",
        "Is the door located in the background behind the people?": "Yes"
    },
    "000000450303": {
        "Are all the people sitting at the table wearing headphones except the man wearing a cap?": "Yes",
        "Is the clock located on the left side of the image?": "Yes",
        "Is the door positioned near the right side of the image?": "Yes",
        "Are the laptops placed on the tables in front of the people?": "Yes",
        "Is the clock positioned on the wall in the background?": "Yes"
    },
    "000000453841": {
        "Is the red car located on the left side of the image?": "Yes",
        "Are there street lights on the road?": "Yes",
        "Is there a footpath on the right side of the image?": "Yes",
        "Is there a car behind the red car on the left side of the road?": "Yes",
        "Are there stores to the right side of the image?": "Yes"
    },
    "000000454404": {
        "Is the bucket positioned in the below left corner of the image?": "Yes",
        "Is the curtain located in the top right corner?": "Yes",
        "Is the flower vase in the below right corner?": "Yes",
        "Is the woman sitting on the bench holding a mobile phone?": "Yes",
        "Is the table in front of the bench?": "Yes"
    },
    "000000455624": {
        "Is the bike in the foreground of the image?": "Yes",
        "Are the trees located at the top of the image?": "Yes",
        "Is there dry grass in the center of the image?": "Yes",
        "Is the person on the bike riding in front of the group of people standing?": "Yes",
        "Are the trees located above the group of people standing?": "Yes"
    },
    "000000455937": {
        "Is the person sitting on a chair positioned in front of the cupboard?": "Yes",
        "Is the table with a cloth, glass, and laptop located in the back of the room?": "Yes",
        "Is the lamp on the wall positioned to the right side of the image?": "Yes",
        "Is the person holding a joystick?": "Yes",
        "Are there books inside the cupboard?": "Yes"
    },
    "000000456662": {
        "Is the person standing in front of the refrigerator?": "Yes",
        "Is the green stick located to the right of the refrigerator?": "Yes",
        "Are there photographs and papers attached to the refrigerator doors?": "Yes"
    },
    "000000457078": {
        "Is the television positioned on the left side of the image?": "Yes",
        "Are the frames visible above the door on the wall?": "Yes",
        "Is the skull located on the book stand beneath the frames?": "No",
        "Is the idol of ships placed on the television?": "Yes",
        "Are the books arranged in a book stand?": "Yes"
    },
    "000000458045": {
        "Is the girl with the baseball bat positioned on the right side of the image?": "Yes",
        "Is there a man seated and wearing gloves in the center of the image?": "Yes",
        "Are there trees visible behind the metal fence in the background?": "Yes",
        "Is the man wearing gloves seated on his knee?": "No",
        "Are all the players on the field wearing helmets on their heads?": "Yes"
    },
    "000000458325": {
        "Is the man on the skateboard positioned in the middle front of the image?": "Yes",
        "Are the cars parked on both the left and right sides of the road?": "Yes",
        "Are there trees and buildings with brick walls in the background?": "Yes",
        "Are the cars parked on both sides of the road?": "Yes",
        "Is the man on the skateboard in front of the people walking?": "Yes"
    },
    "000000458410": {
        "Is the couch on the right side of the image?": "Yes",
        "Is the desk located in the center of the foreground?": "Yes",
        "Are there books on the table on the left side of the image?": "Yes",
        "Is the box on the desk?": "Yes",
        "Are the glasses located on the closet?": "Yes"
    },
    "000000463199": {
        "Is the man wearing a blue shirt and blue jeans standing on the left side of the image?": "Yes",
        "Is the man with the green t-shirt and blue cap standing on the right side?": "Yes",
        "Are the handles located at the top right of the image?": "Yes",
        "Is the man standing on the left wearing a blue shirt next to the man in a green t-shirt?": "No",
        "Are there handles present to the top right in the bus?": "Yes"
    },
    "000000463690": {
        "Is the person lying on the floor positioned in the center of the image?": "Yes",
        "Is the ball above the leg of the person lying down?": "Yes",
        "Are the toys visible through the glass window on the right side of the image?": "Yes",
        "Is the person on the floor balancing a ball above their leg?": "Yes",
        "Are the toys visible through the glass window?": "Yes"
    },
    "000000464089": {
        "Is the man holding a baseball bat standing in the center of the image?": "Yes",
        "Is the person wearing gloves in a squat position beside the man in the center?": "Yes",
        "Is the ball located to the right of the image?": "Yes",
        "Is the man in the center holding a baseball bat?": "Yes",
        "Is the man in the squat position beside the man in the center?": "Yes"
    },
    "000000464476": {
        "Is there a laptop on the right side of the image?": "Yes",
        "Are the shelves beside the table?": "Yes",
        "Is the person walking on the left side of the image?": "Yes",
        "Is the computer behind the laptop?": "Yes"
    },
    "000000465822": {
        "Is the woman with the camera positioned in the foreground of the image?": "Yes",
        "Is the wooden door located in the background of the image?": "Yes",
        "Is the clock attached to the door visible on the left side of the image?": "Yes",
        "Is the woman standing holding a camera?": "Yes",
        "Is another person working on a laptop on the table at the back?": "Yes"
    },
    "000000466986": {
        "Is there an oven behind the man?": "Yes",
        "Are the two white plates located in front of the man?": "Yes",
        "Is the shirt on some other person visible to the left side of the image?": "Yes",
        "Are the trays located above the oven?": "Yes",
        "Is there a silver coating on the walls of the kitchen?": "Yes"
    },
    "000000467848": {
        "Is the person positioned on the bottom right corner of the image?": "Yes",
        "Is the building located in the center of the image?": "Yes",
        "Are the street lights on the left side of the image?": "Yes",
        "Is the vehicle on top of the red container?": "Yes",
        "Is the person touching his leg on the container beside the plants and grass?": "Yes"
    },
    "000000468501": {
        "Are there two women standing while facing each other?": "No",
        "Is the music system located to the left of the standing women?": "Yes",
        "Is the sitting woman positioned to the right of the white door?": "No",
        "Are both standing women holding something in their hands?": "Yes",
        "Is the person sitting on the sofa facing the standing women?": "Yes"
    },
    "000000470924": {
        "Is there a woman wearing sunglasses at the center of the table?": "Yes",
        "Are there vehicles parked to the right side of the image?": "Yes",
        "Is the tissue box placed on the table in front of the people?": "Yes",
        "Is the woman in the center holding a beer glass with her right hand?": "Yes",
        "Is there a tissue box on the table?": "Yes"
    },
    "000000471789": {
        "Is the man flying the kite positioned in the center of the image?": "Yes",
        "Is the man in the blue dress walking on the right side of the image?": "Yes",
        "Are the trees positioned in the background of the image?": "Yes",
        "Is the woman standing and looking at the kite related to the man flying it?": "Yes",
        "Are there more people walking than standing in the image?": "Yes"
    },
    "000000473219": {
        "Is the lady in a white frock positioned in the middle of the image?": "Yes",
        "Is the lady with the red dress standing on the left side of the image?": "Yes",
        "Are flower vases visible in the background at the top of the image?": "Yes",
        "Is the man with the white jacket holding the hand of the lady with the white frock?": "Yes",
        "Is the man with the black jacket and white shirt standing between the lady with the white frock and the man with the white jacket?": "Yes"
    },
    "000000475387": {
        "Is the train positioned to the left of the image?": "No",
        "Is the sign board on the left side of the image?": "Yes",
        "Is the woman standing to the right side of the image?": "Yes",
        "Is the sign board on the left of the train?": "Yes",
        "Is the woman standing behind the man with the bag?": "No"
    },
    "000000476704": {
        "Is the bus positioned near to the street pole?": "Yes",
        "Is the red car located on the left side of the image?": "No",
        "Is the traffic signal pole on the left side of the image?": "Yes",
        "Is the bicycle under the street pole?": "Yes",
        "Is the truck standing on the road near the bus?": "Yes"
    },
    "000000478474": {
        "Is the truck positioned on the road?": "Yes",
        "Are the clouds located above the truck?": "Yes",
        "Is the signboard on the left side of the image?": "No",
        "Is the truck running beside the trees?": "Yes",
        "Is the signboard beside the road?": "Yes"
    },
    "000000479030": {
        "Is the railway track positioned in the middle of the image?": "Yes",
        "Is the road with many cars and vans located beside the railway track?": "Yes",
        "Are the trees and electric poles positioned beside each other?": "Yes",
        "Is the train moving on the railway track in the middle?": "Yes",
        "Does the road on the left join the road beside the railway track?": "Yes"
    },
    "000000479155": {
        "Are the people standing in front of the fruit shop?": "Yes",
        "Is the dog to the side of the people?": "Yes",
        "Are there baskets in front of the people?": "Yes",
        "Are the baskets in front of the people?": "Yes",
        "Is the person with the blue jacket holding the green cover?": "No"
    },
    "000000479248": {
        "Is the television located in the center of the image?": "Yes",
        "Are the toys positioned to the right side of the image?": "Yes",
        "Is the lamp on the right side of the image?": "Yes",
        "Are the toys located on the right side of the table with the frames?": "Yes",
        "Is there a lamp on the table at the right side?": "Yes"
    },
    "000000482319": {
        "Is the man sitting in the center of the image?": "Yes",
        "Is the window located on the right side of the image?": "Yes",
        "Are the books on the shelf in the background?": "Yes",
        "Is the man holding the kid while sitting on the sofa?": "Yes",
        "Is the woman standing on the floor next to the man and kid?": "Yes"
    },
    "000000483999": {
        "Is the person sitting on a chair on the left side of the image?": "Yes",
        "Are there plates and cups on the table in front of the group of people?": "Yes",
        "Is a door visible in the background of the image?": "Yes",
        "Are the people sitting around the table having a conversation?": "Yes",
        "Are there plates, cups, and glasses on the table?": "Yes"
    },
    "000000485844": {
        "Is the woman positioned in the center of the image?": "Yes",
        "Is there a table on the left side of the woman?": "Yes",
        "Is there a machine at the top left corner?": "Yes",
        "Is the woman standing next to the table with plates and knives?": "Yes",
        "Is the machine located above the second table?": "Yes"
    },
    "000000488251": {
        "Is the man holding the horse with his right hand?": "Yes",
        "Is there a wooden wall in the background of the image?": "Yes",
        "Is the woman standing on the left of the image?": "Yes",
        "Is the woman standing on the left side of the man?": "Yes"
    },
    "000000489305": {
        "Is the man positioned at the center of the image?": "Yes",
        "Is the big bowl of fruits placed on a table in front of the man?": "Yes",
        "Is there a kitchen platform in the background area of the image?": "Yes",
        "Is the man holding a bowl of fruits in his hands?": "Yes"
    },
    "000000489764": {
        "Is the woman in red dress holding a remote positioned in the foreground of the image?": "Yes",
        "Is the desk located on the right side of the image?": "No",
        "Is there a door in the center of the background of the image?": "Yes",
        "Is the woman in the red dress holding an object near the man sitting in the center?": "Yes",
        "Is the cap located between the woman and the man sitting in the center?": "Yes"
    },
    "000000491008": {
        "Are the two people holding a pizza standing near tables and chairs?": "Yes",
        "Is the frame located on the right side of the image?": "Yes",
        "Can a plant pot and a can be seen on the window in the background?": "Yes",
        "Are the two people holding the pizza near the tables and chairs?": "Yes",
        "Is there a plant pot on the window in the background?": "Yes"
    },
    "000000491090": {
        "Is the man on the bike positioned in the foreground of the image?": "Yes",
        "Are the other bikes placed in the background of the image?": "Yes",
        "Is the board with the words \"LEARNER MODELS\" positioned on the left side of the image?": "Yes",
        "Is the man sitting on the bike in front of the shelter with a shutter?": "Yes",
        "Are there multiple bikes placed in the background on the path?": "Yes"
    },
    "000000491213": {
        "Is the bike positioned at the center of the image?": "Yes",
        "Are the traffic signal poles on the left side of the image?": "No",
        "Is the person walking on the left side of the image?": "Yes",
        "Are the trees surrounding the area where the bike is located?": "Yes",
        "Is there a person walking on the left side relative to the bike?": "Yes"
    },
    "000000491366": {
        "Is the man with the black jacket positioned on the left side of the image?": "Yes",
        "Is the table with monitors and projector positioned beside the man with the black shirt?": "Yes",
        "Is the TV screen positioned on the right side of the image?": "Yes",
        "Is the man with the black jacket standing in front of the TV screen?": "Yes",
        "Is the video game joystick located on the table in front of the window?": "Yes"
    },
    "000000491497": {
        "Is the person on the television positioned on the left side of the image?": "Yes",
        "Is the white chair located at the bottom of the image near the cupboards?": "Yes",
        "Are the books on the right side of the cupboard?": "Yes",
        "Is the person shown on the television located to the left of the image?": "Yes",
        "Is the white chair near the cupboards?": "Yes"
    },
    "000000492282": {
        "Is the man wearing a white shirt positioned on the left side of the image?": "Yes",
        "Is the woman wearing a black shirt on a horse to the right of the man in the white shirt?": "Yes",
        "Are most of the horses walking on the path?": "Yes",
        "Is the man in the white shirt sitting on the first horse?": "Yes",
        "Are all the horses walking on the path?": "No"
    },
    "000000492758": {
        "Is the sofa positioned on the bottom right side of the image?": "Yes",
        "Are there two chairs on the bottom left side of the image?": "Yes",
        "Is the man sitting on a sofa at the top right side of the image?": "Yes",
        "Is there a lamp on the table in the middle of the image?": "Yes",
        "Is the man sitting near the door?": "Yes"
    },
    "000000493864": {
        "Is the man holding a blue object positioned in the middle of the image?": "Yes",
        "Are the people holding white objects located on the right side of the image?": "Yes",
        "Is there a black mountain visible in the background of the image?": "Yes",
        "Is the man in the middle holding a blue object?": "Yes",
        "Are the people on the right holding white objects?": "Yes"
    },
    "000000494863": {
        "Are the two trains positioned in the center of the image?": "Yes",
        "Is there a mirror of a car in the bottom left corner of the image?": "Yes",
        "Is the pole located on the top right corner of the image?": "No",
        "Are the two trains positioned next to each other?": "Yes",
        "Is the car mirror close to the street light?": "No"
    },
    "000000494869": {
        "Is the woman positioned in front of the cupboards?": "Yes",
        "Is the dog lying on the left side of the baby?": "Yes",
        "Is there a light hanging from the roof?": "Yes",
        "Is the dog lying to the left side of the baby?": "Yes",
        "Is the woman cooking food in front of the cupboards?": "Yes"
    },
    "000000495732": {
        "Is the ceiling light positioned at the top of the image?": "Yes",
        "Is the man sitting on the sofa near the left wall of the room?": "Yes",
        "Is the houseplant located on the right side of the image?": "Yes",
        "Is the man sitting on the sofa near the wall?": "Yes",
        "Is the houseplant beside the desk on the right side of the picture?": "Yes"
    },
    "000000496722": {
        "Is the sky with clouds located at the top of the image?": "Yes",
        "Are there any buildings on the right side of the image?": "Yes",
        "Is there a post box on the left side of the image?": "Yes",
        "Are there post boxes on both the left and right sides of the image?": "Yes",
        "Are many vehicles moving on the road?": "Yes"
    },
    "000000496854": {
        "Is the man in the center of the image wearing a grey blazer and black trousers?": "Yes",
        "Is the woman on the left side of the image holding an umbrella?": "Yes",
        "Are there buildings in the background of the image?": "Yes",
        "Is the woman on the left holding an umbrella for the man in the center?": "Yes",
        "Is the woman on the right handing a bouquet to the man in the center?": "Yes"
    },
    "000000503855": {
        "Are the yellow umbrellas placed on the grass in the foreground of the image?": "Yes",
        "Is the water bank located on the left side of the image?": "No",
        "Are the people standing and sitting on chairs positioned on the road behind the grass?": "Yes",
        "Are the yellow umbrellas placed on the grassy ground in front of the road?": "Yes",
        "Is the water bank located to the right of the standing and sitting persons on the road?": "Yes"
    },
    "000000507223": {
        "Is the man in the blue t-shirt standing in the middle of the image?": "Yes",
        "Is the fencing visible in the left top corner of the image?": "Yes",
        "Are there people sitting at the top of the image?": "Yes",
        "Is the man with a navy blue t-shirt standing in front of the man with a black t-shirt and grey pants?": "Yes",
        "Is the man in the middle holding a bat?": "Yes"
    },
    "000000507797": {
        "Is the van positioned in the center of the image?": "Yes",
        "Is the tourist bus on the left side of the image?": "Yes",
        "Is there a building on the right side of the image?": "Yes",
        "Is the bus on the left side of the van?": "Yes",
        "Are the people standing at the right side of the car?": "Yes"
    },
    "000000509403": {
        "Is the man with the blue T-shirt standing on the grass?": "Yes",
        "Is one of the boys holding a flying saucer positioned beside the man?": "Yes",
        "Are there trees visible in the background behind the people and the dog?": "Yes",
        "Is the man standing near the boys?": "Yes",
        "Is the dog on the grass?": "Yes"
    },
    "000000509699": {
        "Is the couch positioned in the center of the image?": "Yes",
        "Is the television to the right of the person sitting on the couch?": "Yes",
        "Is the door located to the left of the image?": "Yes",
        "Is there a flower vase on the television?": "Yes",
        "Is the frame located behind the couch?": "Yes"
    },
    "000000510329": {
        "Is the man with the brown jacket holding an umbrella on the left side of the image?": "Yes",
        "Is there a laptop on the right side of the image?": "Yes",
        "Are there trees and a building in the background of the image?": "Yes",
        "Is the man with the brown jacket holding an umbrella?": "Yes",
        "Are there some items on the laptop, including plaster?": "Yes"
    },
    "000000512657": {
        "Is the man with the black jacket seated on the left side of the image?": "Yes",
        "Is the lady with the violet and grey t-shirt standing in the middle of the image?": "Yes",
        "Is there a yellow surfboard on the wall behind the people?": "Yes",
        "Is the man sitting beside a pillow?": "Yes",
        "Is the lady holding a white object while standing in the middle?": "Yes"
    },
    "000000513567": {
        "Are the two people holding food located at the front of the image?": "Yes",
        "Is there a group of people crossing the road behind the two people holding food?": "Yes",
        "Is there a blue building visible in the background?": "Yes",
        "Are the two people in the foreground holding food and tissues?": "Yes",
        "Is there a group of people crossing the road behind the two people?": "Yes"
    },
    "000000514797": {
        "Are two men on the right side of the image holding a kite?": "Yes",
        "Is the man wearing a red t-shirt on the left side of the image?": "Yes",
        "Is a white tower visible on the right side of the image?": "Yes",
        "Are the two men on the right side holding the kite together?": "Yes",
        "Is the tower located to the right of the men holding the kite?": "Yes"
    },
    "000000515025": {
        "Is the cat on the table eating something?": "Yes",
        "Are there cars visible in the background of the image?": "Yes",
        "Is the room located on the left side of the image?": "Yes",
        "Is the cat on the table?": "Yes",
        "Is the woman looking at the cat?": "Yes"
    },
    "000000515982": {
        "Is the person wearing the white dress on the right side of the image?": "Yes",
        "Is there a football on the top left corner of the image?": "Yes",
        "Is there green grass on the left side of the image?": "Yes",
        "Is the person in the white dress near the person lying on the ground?": "Yes",
        "Is there cloth fencing visible above the scene?": "Yes"
    },
    "000000520264": {
        "Are the two persons standing in the middle of the image?": "Yes",
        "Is the sink located on the bottom right side of the image?": "Yes",
        "Is the cupboard situated on the top left side of the image?": "Yes",
        "Is the glass window located behind the two persons standing in the middle of the image?": "Yes",
        "Is the bottle located near the sink on the bottom right side of the image?": "Yes"
    },
    "000000521259": {
        "Are the two men standing and holding something located at the bottom right side of the image?": "Yes",
        "Is the vehicle on the top left side of the image?": "Yes",
        "Are there a few people standing and walking in the middle of the image?": "Yes",
        "Are the two men standing on the bottom right holding something in their hands?": "Yes",
        "Is there a vehicle in the top left side of the image with a building behind it?": "Yes"
    },
    "000000521509": {
        "Is the camera positioned in the center of the image?": "Yes",
        "Are the lamps positioned on the sides of the bed?": "Yes",
        "Is the curtain located on the right side of the image?": "Yes",
        "Is the camera on a stand positioned in front of the person on the bed?": "Yes",
        "Are the lamps located to the side of the bed?": "Yes"
    },
    "000000522007": {
        "Is the oven located on the right side of the image?": "Yes",
        "Is the stove on the left side of the image?": "Yes",
        "Are the shoes visible at the bottom in the front of the image?": "Yes",
        "Is the speaker placed on the oven?": "Yes",
        "Are the shoes hanged to the wall in the front?": "No"
    },
    "000000523957": {
        "Is the person on the skateboard positioned between the cones?": "Yes",
        "Is the group of people looking at the skateboarder on the right side of the image?": "Yes",
        "Is the mountain on the left side of the image?": "Yes",
        "Is the person on the skateboard riding between the cones?": "Yes",
        "Is the group on the right looking at the person on the skateboard?": "Yes"
    },
    "000000524850": {
        "Are the flight engines visible on the left side of the image?": "Yes",
        "Is the white bus in the center of the image?": "No",
        "Are people holding bags in front of the bus?": "Yes",
        "Are people standing near the white bus?": "Yes",
        "Is the flight's engine to the left of the white bus?": "Yes"
    },
    "000000526728": {
        "Are the suitcases in front of the man and woman?": "Yes",
        "Is the building with the wooden door on the left side of the image?": "Yes",
        "Is the mirror wall showing images of trees and streetlights positioned beside the house building?": "Yes",
        "Are the man and the woman standing in front of the suitcases?": "Yes",
        "Is the house building in the background reflected in the mirror wall?": "No"
    },
    "000000528578": {
        "Is the flag located to the left side of the top of the building?": "Yes",
        "Is there a clock on the tower to the right side of the building?": "Yes",
        "Are people walking on the steps beside the sculpture?": "Yes"
    },
    "000000528862": {
        "Are the giraffes standing near the trees?": "Yes",
        "Are the bulls located in the top left corner of the image?": "Yes",
        "Is the wall and fencing at the bottom of the image?": "Yes",
        "Are the bulls sitting on the top left corner?": "Yes"
    },
    "000000529762": {
        "Is the person sitting on the right side of the image?": "Yes",
        "Is there a glass on the table?": "Yes",
        "Are the food items placed in front of the person?": "Yes",
        "Is the person holding a mobile while sitting on the couch?": "Yes",
        "Are there food items on the table along with a laptop?": "Yes"
    },
    "000000531135": {
        "Is the light pole positioned on the left side of the image?": "Yes",
        "Are the posters located behind the people in the image?": "Yes",
        "Are the trees positioned beyond the playing ground?": "Yes",
        "Are there people sitting and watching the match?": "Yes",
        "Is there a net between the viewer and the players?": "Yes"
    },
    "000000533816": {
        "Is the staircase ladder on the left side of the image?": "Yes",
        "Are the two ladies holding rackets standing beside the man in the center?": "Yes",
        "Are there people sitting and standing in the background?": "Yes",
        "Is the net between the two ladies holding the rackets?": "Yes",
        "Is the person with the camera standing near the staircase ladder?": "Yes"
    },
    "000000534041": {
        "Is the water bottle in front of the boy on the table?": "Yes",
        "Is there a bag near the boy?": "Yes",
        "Are there people sitting on the bench behind the woman and the boy?": "Yes",
        "Is the woman feeding the boy with the food item from the bowl?": "Yes",
        "Is the bag placed on the bench?": "No"
    },
    "000000534394": {
        "Are the sheep positioned in the center of the image?": "Yes",
        "Is the mirror of the car located at the bottom left of the image?": "Yes",
        "Are the dry grass and building located on the right side of the image?": "Yes",
        "Are the sheep running behind the tree?": "Yes",
        "Is the hand reflecting in the car mirror located at the bottom left?": "Yes"
    },
    "000000535523": {
        "Is the machine located on the right side of the image?": "Yes",
        "Are the two people standing on the left side of the image?": "Yes",
        "Is the chair positioned on the left side of the image?": "Yes",
        "Are the two people standing at the left side of the image?": "Yes",
        "Is the machine located at the right side of the image?": "Yes"
    },
    "000000535608": {
        "Are the two women sleeping on the mat positioned at the front of the image?": "Yes",
        "Is the umbrella with the two chairs located to the right side of the image?": "Yes",
        "Are the man and boy walking in the middle of the image?": "Yes",
        "Are the two women on the mat in front of the umbrella and chairs?": "Yes",
        "Are the man and the boy walking towards the water?": "Yes"
    },
    "000000537812": {
        "Is the stool with the bucket and cup on the right side of the image?": "Yes",
        "Is the toilet with the flush on the left side of the image?": "Yes",
        "Is there a box with bottles and other items inside it at the back of the image?": "Yes",
        "Is the bucket on the stool?": "Yes",
        "Is the tap near the toilet located to the left of the washroom?": "Yes"
    },
    "000000538364": {
        "Is the policeman riding a bike positioned in the front of the image?": "Yes",
        "Are the couple of people walking on the road in the left part of the image?": "Yes",
        "Is the bench located in the middle part of the image?": "Yes",
        "Is the policeman on the bike next to a person standing on the road?": "Yes",
        "Are there people walking in front of the standing person?": "Yes"
    },
    "000000540414": {
        "Are people selling fish on the right side of the image?": "Yes",
        "Is there a street light pole on the left side?": "No",
        "Are cycles visible in the background of the image?": "Yes",
        "Are the fishes being sold on the right side of the image?": "Yes",
        "Is the person selling vegetables on the left side of the image?": "Yes"
    },
    "000000541773": {
        "Is the man holding a bottle positioned near the table?": "Yes",
        "Are the wine glasses on the table?": "Yes",
        "Are the windows visible in the background?": "Yes",
        "Is the man holding a bottle near the table?": "Yes",
        "Are there wine glasses on the table?": "Yes"
    },
    "000000545100": {
        "Is the man in the blue blazer positioned on the right side of the image?": "Yes",
        "Are the two people playing basketball positioned in front of the man in the blue blazer?": "Yes",
        "Is the direction board placed above the road and trees?": "Yes",
        "Is the man in the blue blazer holding a mobile phone in front of a basketball court?": "Yes",
        "Are the cars visible on the road beside the basketball court?": "Yes"
    },
    "000000546475": {
        "Is the man standing in the middle of the image?": "Yes",
        "Is there a cloth on a hanger on the left side of the image?": "Yes",
        "Is the wall and door in the background of the image?": "Yes",
        "Is the man holding a baby in one hand?": "Yes",
        "Is there a cloth on the hanger on the left side of the image?": "Yes"
    },
    "000000548246": {
        "Is the person on the left side of the image holding a tennis racket?": "Yes",
        "Are the green colored balls on the right side of the image?": "Yes",
        "Is the sky visible at the top of the image?": "Yes",
        "Is the person on the left side holding a tennis racket?": "Yes",
        "Are there green colored balls near the fence?": "Yes"
    },
    "000000548339": {
        "Is the person standing in the middle of the image?": "Yes",
        "Are there benches behind the person?": "Yes",
        "Are bottles and tins scattered around the benches?": "Yes",
        "Is the person standing in front of the fencing?": "Yes",
        "Are the benches with people on them located behind the person?": "Yes"
    },
    "000000549390": {
        "Is the sky positioned at the top of the image?": "Yes",
        "Is the woman in grey riding her bicycle in the front of the image?": "Yes",
        "Are most of the people riding bicycles on the right side of the image?": "Yes",
        "Is the woman in front riding a bicycle?": "Yes",
        "Are there people riding bicycles on the right side?": "Yes"
    },
    "000000549930": {
        "Are the two people walking positioned on the road?": "Yes",
        "Is the board located on the right side of the image?": "Yes",
        "Are poles and trees visible on the left side of the image?": "Yes",
        "Are the two persons walking on the road?": "Yes"
    },
    "000000550691": {
        "Is the bus on the left side of the walkway?": "Yes",
        "Is there a wall to the extreme right of the image?": "Yes",
        "Are the trees and houses located in the background of the image?": "Yes",
        "Is the man inside the bus at the steering wheel?": "Yes",
        "Is there a railing on the walkway to the right of the bus?": "Yes"
    },
    "000000553669": {
        "Is the person sitting on the bench positioned on the left side of the image?": "No",
        "Are the red flowers in front of the person sitting on the bench?": "Yes",
        "Is the bin located to the right of the person sitting on the bench?": "Yes",
        "Is the person with the laptop sitting near the bin?": "Yes",
        "Are the cars on the road in front of the person with the laptop?": "Yes"
    },
    "000000554579": {
        "Is the dog positioned in front of the women?": "Yes",
        "Are the frames visible on the wall in the background?": "Yes",
        "Is the decorative Christmas tree located to the left of the women?": "Yes",
        "Are the three women standing near a decorative Christmas tree?": "Yes",
        "Is there a container on the brick wall?": "Yes"
    },
    "000000555050": {
        "Is the person sitting inside the car located in the foreground of the image?": "Yes",
        "Is the animal positioned near the building on the left side of the image?": "No",
        "Are the traffic signals in the middle section of the image?": "Yes",
        "Is the person inside the car located on the road?": "Yes",
        "Is the animal near the store?": "Yes"
    },
    "000000560474": {
        "Are there objects placed on the upper part of the car?": "Yes",
        "Can we see stickers pasted on the window of the car?": "Yes",
        "Is there a tent in the top right corner of the image?": "Yes",
        "Are there stickers pasted on the car's window?": "Yes",
        "Is there a tent visible in the top right corner of the image?": "Yes"
    },
    "000000563267": {
        "Is the man with a t-shirt positioned in the middle of the image?": "Yes",
        "Are there green bottles on the table beside the man with a t-shirt?": "Yes",
        "Is there a projector to the left of the table?": "Yes",
        "Is the man with the t-shirt standing in front of the brick wall?": "Yes",
        "Are the green bottles on the table beside the monitor?": "Yes"
    },
    "000000565853": {
        "Is the television positioned in the center of the image?": "Yes",
        "Is the man standing on the left side of the image?": "Yes",
        "Are the pictures on the wall black in color?": "Yes",
        "Is the man standing to the left of the television?": "Yes",
        "Are the black-colored bottles in front of the television?": "Yes"
    },
    "000000566282": {
        "Is the man kicking the football on the left side of the image?": "Yes",
        "Are there three persons standing on the right side of the image?": "Yes",
        "Is there a building on the left side of the image?": "Yes",
        "Is the man on the left side kicking the football?": "Yes",
        "Are the three persons standing on the right side of the image?": "Yes"
    },
    "000000567886": {
        "Is the teddy bear in front of the legs?": "Yes",
        "Is the cupboard with books located behind the teddy bear?": "Yes",
        "Are the slippers positioned in front of the legs?": "Yes",
        "Is the black box beside the cupboard?": "Yes"
    },
    "000000568584": {
        "Is the person sitting on the couch located on the right side of the image?": "Yes",
        "Is the maroon curtain on the left side of the image?": "Yes",
        "Are the lamp and few frames located in the background of the image?": "Yes",
        "Is the couch with pillows located to the left of the person sitting on the other couch?": "Yes",
        "Is the lamp positioned between the two couches?": "Yes"
    },
    "000000568814": {
        "Is the roof visible at the top of the image?": "Yes",
        "Is there a table on the left side of the image?": "Yes",
        "Are there stickers on the right side of the image?": "Yes",
        "Is the middle person wearing a tie while sitting on the right side of the image?": "Yes",
        "Are there items placed on the table located on the left side of the image?": "Yes"
    },
    "000000568981": {
        "Is the person wearing a blue t-shirt skateboarding on the right side of the image?": "Yes",
        "Is there a person kneeling down on the left side of the image?": "Yes",
        "Is there grass visible on the floor?": "Yes",
        "Is the person with the camera on the left side of the skateboarder?": "Yes",
        "Is the skateboarder on the floor?": "Yes"
    },
    "000000569030": {
        "Is the building on the top right side of the image?": "Yes",
        "Is the fire hose at the top of the image?": "No",
        "Is the person wearing a bag standing on the left side of the image?": "Yes",
        "Are the buildings positioned on both sides of the image?": "Yes",
        "Is the fire hose located at the bottom of the image?": "Yes"
    },
    "000000569976": {
        "Is the lady holding a hair dryer positioned on the right side of the image?": "Yes",
        "Is the box located on the left side of the image?": "Yes",
        "Is there a door on the right side of the image?": "Yes",
        "Is the lady using the hair dryer on the girl?": "Yes",
        "Is the box located on the opposite side of the door in the image?": "Yes"
    },
    "000000570834": {
        "Is the policeman standing near the bicycles?": "Yes",
        "Are the glass door and windows located on the right side of the image?": "Yes",
        "Are the spotlights visible on the ceiling?": "Yes",
        "Is the policeman standing next to the bicycles?": "Yes",
        "Are the glass doors and windows on the right side of the train?": "Yes"
    },
    "000000572620": {
        "Is the person wearing a blue shirt skating at the middle of the image?": "Yes",
        "Is the person in a red T-shirt taking a photograph on the right side of the image?": "Yes",
        "Are there some boards and trees in the background of the image?": "Yes",
        "Is the person wearing a blue shirt skating in the middle of the image?": "Yes",
        "Is the person in a red T-shirt on the right side of the image taking a photograph?": "Yes"
    },
    "000000575243": {
        "Is the man holding an umbrella positioned in the center of the image?": "Yes",
        "Are the cars on the right side of the image?": "Yes",
        "Is there a building on the left side of the image?": "Yes",
        "Is the man holding an umbrella beside a tree?": "Yes",
        "Are the cars standing on the road to the right of the man?": "Yes"
    },
    "000000576955": {
        "Is the boy riding a horse in the center of the image?": "Yes",
        "Is the wooden fencing on the left side of the image?": "Yes",
        "Is the person in a squat position on the right side of the image?": "Yes",
        "Is the boy riding the horse in the water located below the tree and the woman?": "Yes",
        "Is the wooden fencing located on the left side of the image?": "Yes"
    },
    "000000578489": {
        "Is the pillow on the sofa?": "Yes",
        "Are the windows in the background of the image?": "Yes",
        "Is the person holding the torch standing on the floor?": "Yes",
        "Are the two persons sitting on the sofa near the windows?": "Yes"
    },
    "000000579070": {
        "Are the glasses, bottles, and a basket positioned in the foreground of the image?": "Yes",
        "Is there a person sitting near the table in the background?": "Yes",
        "Are the two white boxes located on the table in the foreground?": "Yes",
        "Are the people in the foreground sitting around the table holding pens?": "Yes",
        "Is there a glass near the person sitting at the table in the background?": "Yes"
    },
    "000000581357": {
        "Is the boy wearing an orange shirt in the air on the skateboard?": "Yes",
        "Is there a person standing to the left of the boy?": "Yes",
        "Are the trees and buildings in the backdrop?": "Yes",
        "Is the boy with the skateboard in proximity to the table with the laptop?": "No",
        "Are there trees visible behind the people sitting in the backdrop?": "Yes"
    }
}