{
    "test_00001": {
        "Is the turtle sitting on the center of the floating tree trunk?": "Yes",
        "Is the fallen tree trunk with moss located on the far left side of the image?": "Yes",
        "Are the pieces of foam floating in the middle of the swamp?": "No",
        "Is the turtle sitting on a tree trunk?": "Yes",
        "Is there moss growing on the tree trunk where the turtle is sitting?": "Yes"
    },
    "test_00010": {
        "Is the woodpecker on the left side of the image?": "Yes",
        "Is the sky visible at the top of the image?": "Yes",
        "Are the green leaves positioned at the bottom left corner of the image?": "Yes",
        "Is the woodpecker standing on a tree branch?": "Yes",
        "Is the sky visible through the branches?": "Yes"
    },
    "test_00016": {
        "Is the banner positioned in the center of the image?": "Yes",
        "Is the blue plastic covering located behind the fence?": "Yes",
        "Is the cement located below the banner?": "Yes",
        "Is the black banner attached to the wire fence?": "Yes",
        "Is the cement on the ground located between the fence and the blue covering?": "Yes"
    },
    "test_00019": {
        "Is the grackle positioned on the top of the green cardboard box?": "Yes",
        "Is the white sticker with the bar-code located directly under the grackle?": "Yes",
        "Is the orange metal beam to the right of the grackle?": "Yes",
        "Is the grackle standing on the green cardboard box?": "Yes",
        "Are the electrical tubes behind the grackle mounted to the ceiling?": "Yes"
    },
    "test_00021": {
        "Is the front of the car facing to the left side of the image?": "Yes",
        "Are the tree trunks located behind the car?": "Yes",
        "Is the car parked on the left side of the fence?": "Yes",
        "Is the car parked parallel to the curb?": "Yes",
        "Are the tree trunks located behind the fence?": "No"
    },
    "test_00028": {
        "Is there a Beluga whale in the top left corner of the image?": "Yes",
        "Is the whale in the front swimming to the left and away from the viewer?": "Yes",
        "Is there a rock formation reflecting light in the upper right corner?": "Yes",
        "Is the whale in the top left corner swimming toward the viewer?": "Yes",
        "Are the tail fins of the whales in the center and lower right lit by light from above?": "Yes"
    },
    "test_00031": {
        "Is the armadillo positioned in the center of the image?": "Yes",
        "Is the giant longhorn on the left side of the image?": "No",
        "Are the cupcake and ice cream cone located at the bottom corner of the image?": "Yes",
        "Is the armadillo positioned in front of the buildings?": "Yes",
        "Is the longhorn looking in the direction of the SPAM can?": "No"
    },
    "test_00033": {
        "Is the white sign leaning over to the right?": "Yes",
        "Is the gravel road in the background to the left of the paved road?": "Yes",
        "Is the dark brown sign positioned to the right of the white sign?": "Yes",
        "Is the white sign positioned closer to the paved road than the dark brown sign?": "Yes",
        "Does the arrow on the white sign point towards the gravel road?": "Yes"
    },
    "test_00039": {
        "Is the black Dodge Ram truck positioned in front of the other two black cars?": "Yes",
        "Are the diagonal white lines on the pavement positioned to the right of the cars?": "Yes",
        "Is there a stoplight positioned overhead on the left side of the image?": "Yes",
        "Are the black cars parked directly behind the Dodge Ram truck?": "Yes",
        "Is the tree located next to the third parked car?": "Yes"
    },
    "test_00054": {
        "Are the two cones positioned on the green part of the court?": "Yes",
        "Is the vertical white line on the left side of the cones?": "Yes",
        "Is the red part of the court above the cones?": "Yes",
        "Are the two cones positioned on the green portion of the court?": "Yes",
        "Does the vertical white line separate the cones from each other?": "No"
    },
    "test_00068": {
        "Is the large left hand coming from the bottom left of the image?": "Yes",
        "Is the rippled black seashell positioned in the middle of the palm?": "Yes",
        "Is the cream seashell with an orange upper edge on the right side of the black seashell?": "Yes",
        "Are the two seashells touching each other in the palm?": "Yes",
        "Is the hand positioned above the sandy area?": "Yes"
    },
    "test_00076": {
        "Is the inflatable sign in front of the white brick house?": "Yes",
        "Are the road signs positioned to the right of the inflatable sign?": "Yes",
        "Is the tree casting a shadow over the left side of the yard?": "No",
        "Are the road signs positioned between the inflatable sign and the sidewalk?": "Yes",
        "Is the tree casting a shadow on the sidewalk?": "No"
    },
    "test_00078": {
        "Is the American flag positioned in the center of the image?": "No",
        "Is the blue field of the flag located in the upper left corner of the flag?": "Yes",
        "Are the clouds mostly on the left side of the image?": "Yes",
        "Is the flag positioned in front of the clouds?": "Yes",
        "Is the sun shining on the flag from the left side?": "No"
    },
    "test_00085": {
        "Are the green plants growing above the tunnel entrance?": "Yes",
        "Is the shadow on the left side of the road inside the tunnel?": "No",
        "Are the rocks located on the right side of the tunnel entrance?": "Yes",
        "Are the cement slabs on the left stacked up against the wall of the tunnel?": "No",
        "Are the rocks located to the right of the tunnel's entrance?": "Yes"
    },
    "test_00090": {
        "Is the lime green alien statue positioned in the center of the image?": "Yes",
        "Is the green cable on the left side of the image?": "Yes",
        "Is the dried-up tree directly behind the alien statue?": "Yes",
        "Is the neon light on the statue connected to a power source?": "Yes",
        "Is the dried-up tree located directly behind the alien statue?": "Yes"
    },
    "test_00101": {
        "Is the silver sedan on the left side of the dark silver Mercedes coupe?": "Yes",
        "Is the black Toyota 4-Runner SUV to the right of the white Mercedes SUV?": "Yes",
        "Is the dark silver Mercedes coupe parked over the white walkway grid?": "Yes",
        "Is the small Mercedes coupe parked over a faded white walkway grid?": "Yes",
        "Is the large white Mercedes SUV parked facing the opposite direction to the silver sedan?": "Yes"
    },
    "test_00104": {
        "Is the red circular sign board positioned in the center of the image?": "Yes",
        "Is the metal rack with a few objects on the right side of the image?": "Yes",
        "Is the hook for hanging items on the left side of the image?": "Yes",
        "Is the red circular sign mounted above the white sticker?": "Yes",
        "Are the objects arranged on a metal rack to the right of the wooden pole?": "Yes"
    },
    "test_00123": {
        "Is the black framed photo positioned below the router?": "Yes",
        "Are the white Ethernet cords extending to the right side of the image?": "Yes",
        "Is the white extension cord to the left of the router?": "Yes",
        "Is the router fastened above the framed photo?": "Yes",
        "Are the Ethernet cords extending from the right side of the router?": "Yes"
    },
    "test_00149": {
        "Is the butterfly positioned near the center of the image?": "Yes",
        "Is the light-colored wooden plank on the left side of the image?": "Yes",
        "Is the single green leaf located at the top of the image?": "Yes",
        "Is the butterfly's shadow to the right of it?": "Yes",
        "Is the wooden plank to the left of the butterfly?": "Yes"
    },
    "test_00150": {
        "Is the dog's head facing toward the bottom of the image?": "Yes",
        "Is the larger puddle located to the right of the dog?": "Yes",
        "Is there sunlight visible in the top left corner of the image?": "Yes",
        "Is the leash attached to the dog's collar extending toward the bottom of the image?": "Yes"
    },
    "test_00153": {
        "Is the metal trashcan positioned on the curb in the image?": "Yes",
        "Are the pieces of parallel landscape timber located above the curb?": "Yes",
        "Is the garden bed with thick grass on the right side of the trashcan?": "No",
        "Are the twigs and leaves spilling out of the trashcan touching the curb?": "Yes",
        "Is the raised garden bed located behind the trashcan?": "Yes"
    },
    "test_00164": {
        "Is the trunk of the tree positioned at the center bottom of the image?": "Yes",
        "Is the pink strand hanging down in the front and center of the tree trunk?": "Yes",
        "Does a strand of light blue lights cut across the top right corner to the lower right edge of the frame?": "Yes",
        "Are the strands of lights hanging vertically from the tree branches?": "Yes",
        "Does a pink strand hang in front of the tree trunk?": "Yes"
    },
    "test_00178": {
        "Is the smaller armadillo statue positioned on the left side of the image?": "Yes",
        "Is the bottom middle armadillo statue facing to the right?": "No",
        "Is the sidewalk visible at the top of the image?": "Yes",
        "Is the smaller armadillo statue positioned between the two larger armadillo statues?": "Yes",
        "Does the sidewalk run parallel to the orientation of the two larger armadillo statues?": "No"
    },
    "test_00189": {
        "Is the jack-o-lantern with circular eyes on the left side of the image?": "Yes",
        "Are the pumpkins placed next to each other in the image?": "Yes",
        "Is the light shining from the carved areas of the jack-o-lanterns yellow?": "Yes",
        "Are the jack-o-lanterns placed next to each other?": "Yes",
        "Is the light shining from the inside of the jack-o-lanterns?": "Yes"
    },
    "test_00190": {
        "Is the daisy head positioned at the top of the image?": "No",
        "Is the concrete pillar located above the person in the mural?": "Yes",
        "Is the wavy pattern of muted colors found below the person in the mural?": "Yes",
        "Are the person's hands positioned one on top of the other?": "Yes",
        "Is there a wavy pattern both on the floor and behind the person?": "Yes"
    },
    "test_00193": {
        "Is the BMW positioned close to a metal white street sign with green text?": "Yes",
        "Are the green shrubs located in front of the blue BMW?": "Yes",
        "Is the dark car visible on the left side of the blue BMW?": "No",
        "Is the BMW parked next to a dark car?": "Yes",
        "Is the street sign located in front of the BMW?": "Yes"
    },
    "test_00195": {
        "Is the mask positioned in the center of the image?": "Yes",
        "Are the two metal poles located at the bottom center of the image?": "Yes",
        "Is the red brick wall the background of the entire image?": "Yes",
        "Are the metal poles extending from the mask towards the bottom edge of the image?": "Yes",
        "Is the red brick wall covering the background behind the mask?": "Yes"
    },
    "test_00203": {
        "Is the duck with its head up located on the far right?": "Yes",
        "Are the two ducks with their heads lowered positioned left and center in the image?": "Yes",
        "Is the small rocky curb visible in the top left corner of the image?": "No",
        "Are the ducks aligned in a single row?": "Yes",
        "Is the water between the ducks and the green grass?": "Yes"
    },
    "test_00225": {
        "Is the blue monster truck positioned slightly to the left side of the image?": "Yes",
        "Is the Hot Wheels logo located in the top left corner of the image?": "Yes",
        "Are there black tire stains on the concrete pavement beneath the truck?": "Yes",
        "Is the truck facing towards the left side of the image?": "Yes",
        "Is the Hot Wheels logo located in front of the truck?": "No"
    },
    "test_00239": {
        "Are the cumulus clouds located on the left side of the image?": "Yes",
        "Does the road extend vertically from the top to the bottom of the image?": "Yes",
        "Is the shadow of the clouds cast over the right side of the image?": "Yes",
        "Are the cumulus clouds located to the left of the road?": "Yes",
        "Do the shadows of the cumulus clouds fall to the right side of the image?": "Yes"
    },
    "test_00262": {
        "Is the car facing the left direction in the image?": "Yes",
        "Is the intersection bridge visible on the right side behind the car?": "Yes",
        "Is the store located on the right side of the window view?": "No",
        "Is the car facing towards the window?": "No",
        "Is the shadow of the car on the same side as the window?": "No"
    },
    "test_00279": {
        "Is the Eastern Redbud plant inside the orange mesh fence positioned to the right of the hydrant?": "No",
        "Is the utility box located behind and to the left of the hydrant?": "Yes",
        "Is the chain-link fence seen on the right side of the image?": "Yes",
        "Is the orange mesh fence laying over the hydrant?": "Yes",
        "Is the utility box positioned behind the hydrant and the Eastern Redbud plant?": "Yes"
    },
    "test_00280": {
        "Is the falcon positioned in the center of the image?": "Yes",
        "Is the reflection of the yellow pole on the left side of the image?": "Yes",
        "Is the green exit light in the top left corner of the image?": "Yes",
        "Is the falcon's reflection visible on the glass behind it?": "Yes",
        "Is the branch the falcon is standing on attached to a platform?": "Yes"
    },
    "test_00292": {
        "Are the wooden panels positioned on the left side of the image?": "Yes",
        "Is the bird flying above the skyscrapers near the top left corner of the image?": "Yes",
        "Is the trailer visible on the left side of the panels?": "No",
        "Are the wooden panels positioned on the other side of the road from where the person stands?": "Yes",
        "Does the skyscraper with glass windows reflect a tall building on the far right side of the image?": "Yes"
    },
    "test_00293": {
        "Is the brown horse with white spots on the right side of the image?": "Yes",
        "Are the blue colored flowers scattered on the left side of the horse?": "Yes",
        "Is the tree line further back from the horse in the distance?": "Yes",
        "Is the horse moving towards the left side of the field with flowers?": "Yes",
        "Is the tree line located behind the field with blue flowers?": "Yes"
    },
    "test_00307": {
        "Is the bear positioned on the left side of the image?": "Yes",
        "Is the sheet music located above the piano keys?": "Yes",
        "Is the wooden floor visible behind the bear?": "Yes",
        "Is the bear positioned on the piano bench?": "Yes",
        "Is the bear looking at the sheet music?": "Yes"
    },
    "test_00316": {
        "Is the stratus cloud at the top of the image?": "Yes",
        "Is the raptor bird positioned on the top left side of the cumulus clouds?": "Yes",
        "Are the cumulus clouds at the bottom of the image?": "Yes",
        "Is the raptor bird flying below the stratus cloud?": "Yes",
        "Are the cumulus clouds positioned below the raptor bird?": "Yes"
    },
    "test_00330": {
        "Are the black banners placed on the left side of the parking lot?": "Yes",
        "Is the American flag flying towards the right?": "Yes",
        "Is the large square-shaped sign with red letters above the banners?": "Yes",
        "Are the banners placed in front of the trucks?": "Yes",
        "Is the American flag flying to the right of the GMC sign?": "Yes"
    },
    "test_00332": {
        "Is the chalk sketch positioned on the left side of the image?": "Yes",
        "Is the expansion line running diagonally from the top left to the bottom right of the image?": "Yes",
        "Are the mulch chips located in the lower portion of the image?": "Yes",
        "Does the expansion line run through the bottom of the cup drawing?": "Yes",
        "Are there pieces of mulch chips placed on the cup's lid?": "Yes"
    },
    "test_00333": {
        "Is the model steamboat positioned inside the window frame?": "Yes",
        "Is the small American flag on the left side of the boat?": "Yes",
        "Is the concrete walling to the right of the window?": "No",
        "Does the steamboat appear inside the window?": "Yes",
        "Are there multiple flags on the roof of the steamboat?": "Yes"
    },
    "test_00340": {
        "Is the handprint positioned near the top of the red wall?": "No",
        "Is the darker red area located in the lower left corner of the image?": "Yes",
        "Is the light glare visible across the upper portion of the red wall?": "Yes",
        "Is the handprint on the red wall overlapping in some areas?": "Yes",
        "Is the light glare affecting the lower portion of the wall?": "No"
    },
    "test_00346": {
        "Is the white and brown stuffed dog positioned in the center of the black shelf?": "Yes",
        "Is the black camera located on the left side of the stuffed dog?": "No",
        "Is the shaggy black stuffed dog on the right side of the white and brown stuffed dog?": "Yes",
        "Is the small camera in front of the white and brown stuffed dog on the shelf?": "Yes",
        "Is the black stuffed dog lying down under the white and brown stuffed dog?": "Yes"
    },
    "test_00355": {
        "Is the caterpillar sculpture positioned in front of the fence?": "Yes",
        "Is the concrete curb visible in the foreground of the image?": "Yes",
        "Are the orange panels part of the fence on the left side of the image?": "Yes",
        "Does the concrete curb cut through the grass where the caterpillar sculpture is placed?": "Yes",
        "Is the caterpillar sculpture positioned in front of the fence made of vertical panels?": "Yes"
    },
    "test_00369": {
        "Is the Volvo positioned on the right side of the image?": "No",
        "Are the two long trees above the Volvo extending towards the right side of the image?": "Yes",
        "Is the white house to the left of the Volvo visible in the image?": "No",
        "Is the white house located to the left of the Volvo?": "Yes",
        "Are the long trees positioned above the Volvo?": "Yes"
    },
    "test_00388": {
        "Is the tree trunk in the center of the image?": "Yes",
        "Are the two trees with skinny trunks to the left of the main tree trunk?": "Yes",
        "Is there a tree to the right of the trunk casting shadows on the ground?": "Yes",
        "Are there shadows on the ground near the tree trunk?": "Yes",
        "Are there two trees to the left of the main tree trunk?": "Yes"
    },
    "test_00406": {
        "Is the moon positioned in the upper right of the image?": "Yes",
        "Is the Earth partially visible on the left side of the image?": "Yes",
        "Are the bright green LED lights located above the image?": "Yes",
        "Are the shadows cast to the right of the restaurant?": "Yes",
        "Is the Earth partially visible behind the restaurant?": "Yes"
    },
    "test_00417": {
        "Is the yellow school bus with the number \"69\" positioned in the foreground of the image?": "Yes",
        "Is the other yellow school bus parked to the right of the school bus with the number \"69\"?": "Yes",
        "Are the tall light poles in the background of the image?": "Yes",
        "Is the second school bus parked behind the first school bus?": "Yes",
        "Are the shadows in the image casting towards the camera?": "Yes"
    },
    "test_00441": {
        "Is the yellow bug positioned in the middle of the image?": "Yes",
        "Is the black hanging light fixture on the left side of the image?": "Yes",
        "Is the wicker chair backrest extending from the right side of the image?": "Yes",
        "Is the yellow hexagenia limbata positioned on the right side of the wicker chair backrest?": "Yes",
        "Is the black hanging light fixture positioned to the left of the yellow hexagenia limbata?": "Yes"
    },
    "test_00457": {
        "Are the square tables predominantly positioned in the center of the image?": "Yes",
        "Are the round tables mostly located on the left side of the image?": "No",
        "Is the vine roof mainly arching over the top center of the frame?": "Yes",
        "Are most of the tables under the vine roof?": "Yes",
        "Are the square tables mostly surrounded by chairs?": "Yes"
    },
    "test_00475": {
        "Is the seagull positioned in the lower half of the image?": "Yes",
        "Are the two metal cleats located on the left side of the dock?": "Yes",
        "Is the ladder attached to the dock positioned behind the seagull?": "Yes",
        "Is the seagull about to land on the white wooden dock with metal cleats?": "Yes",
        "Is there a ladder attached to the dock behind the bird?": "Yes"
    },
    "test_00476": {
        "Is the woman statue holding the black pot in the center of the image?": "Yes",
        "Is the blue bignose unicornfish positioned at the bottom left of the image?": "No",
        "Are the large rocks positioned behind the statue?": "Yes",
        "Is the statue holding the black pot above the blue bignose unicornfish?": "Yes",
        "Are the aquarium rocks placed behind the statue?": "Yes"
    },
    "test_00482": {
        "Is the graffiti sign on the left side of the graffiti car?": "Yes",
        "Is the blue colored design behind the Chevrolet Chevelle art?": "Yes",
        "Are the green leaves visible above the Chevrolet Chevelle graffiti?": "Yes",
        "Is the graffiti sign located to the left of the Chevrolet Chevelle art?": "Yes",
        "Are the green leaves positioned above the Chevrolet Chevelle art?": "Yes"
    },
    "test_00487": {
        "Is the truck facing towards the left side of the image?": "Yes",
        "Is the blue tarp located at the top left corner of the image?": "Yes",
        "Are the tire marks visible under the rear tire of the truck?": "Yes",
        "Are the tire marks on the ground related to the rear left tire of the truck?": "Yes",
        "Is the blue tarp situated above the truck in the image?": "Yes"
    },
    "test_00492": {
        "Is the wooden case positioned against the wall?": "Yes",
        "Does the shaft of sunlight point towards the bench?": "Yes",
        "Is the poster with the burning log fire located above the bench?": "Yes",
        "Is the bench in front of the poster?": "Yes",
        "Does the sunlight point at the bench?": "Yes"
    },
    "test_00510": {
        "Is the highest peak located in the top right corner of the image?": "Yes",
        "Are the small, three-piece sections of green that look like islands located between the blue areas?": "Yes",
        "Is the large blue section at the bottom of the image considered the water area?": "Yes",
        "Is the blue section representing a body of water located between the two green land pieces?": "Yes",
        "Does the highest peak with a dark red-orange color connect to a section with a large lake-like blue area?": "Yes"
    },
    "test_00520": {
        "Is the statue placed in the middle of the movie theater lobby?": "Yes",
        "Is the poster with \"FUG DAL PIANETA / DELLA SCIMMIE\" on the left side of the image?": "Yes",
        "Is the red and golden carpet in front of the statue?": "Yes",
        "Is the scroll at the pedestal end being grabbed by the statue's right hand?": "Yes",
        "Are the four black stanchion posts connected by rope surrounding the statue?": "Yes"
    },
    "test_00554": {
        "Is the small bush located at the bottom of the frame?": "Yes",
        "Is the bare tree with snow on its branches on the right side of the frame?": "No",
        "Is sunlight hitting the upper edge of the trees in the center part at the top of the image?": "Yes",
        "Is the small bush positioned below the bare tree with snow-covered branches in the frame?": "Yes",
        "Are the trees with frost-covered branches located at the horizon of the field?": "Yes"
    },
    "test_00559": {
        "Is the bumblebee directly above the seat of the bench?": "Yes",
        "Is the cement wall partially visible in the top left corner of the image?": "Yes",
        "Is the wooden deck surface visible below the bench on the right side of the image?": "Yes",
        "Is the bumblebee flying above the bench?": "Yes",
        "Is the bench resting against a cement wall?": "Yes"
    },
    "test_00567": {
        "Is the car positioned between two white painted lines?": "Yes",
        "Is the grassy field located on the left side of the car?": "Yes",
        "Is the metal street sign visible to the right of the car?": "Yes",
        "Is the vehicle parked between the two white painted lines?": "Yes",
        "Does the asphalt trail run parallel to the wooden residential fence line?": "Yes"
    },
    "test_00574": {
        "Is the bird nearest in view positioned toward the right side of the image?": "Yes",
        "Is the bird walking ahead facing the top right corner of the image?": "Yes",
        "Are most of the seashells piled up in the bottom left and right sides of the image?": "Yes",
        "Is the nearest bird to the right walking behind the other bird?": "Yes",
        "Are most of the seashells piled up on the bottom right and left sides of the image?": "Yes"
    },
    "test_00590": {
        "Is the vehicle in the far right lane of the road?": "Yes",
        "Is the solid yellow line on the right side of the road?": "No",
        "Are the bushes visible on both sides of the road?": "Yes",
        "Is the vehicle traveling on the far right lane separated by a dashed white line?": "Yes",
        "Are there bushes on both sides of the road?": "Yes"
    },
    "test_00621": {
        "Is the dragon's head facing the bottom right corner of the image?": "Yes",
        "Is the tree located behind the dragon in the background?": "Yes",
        "Are there clouds visible near the top of the image?": "Yes",
        "Is the dragon facing towards the sky?": "No",
        "Is the tree positioned behind the dragon?": "Yes"
    },
    "test_00624": {
        "Is the tallest building with the red \"W\" logo located near the center of the image?": "Yes",
        "Are the two identical buildings with cupolas located on the left side of the image?": "Yes",
        "Is the reflection of the red \"W\" logo centered on the water in the foreground?": "Yes",
        "Is the water reflecting the red light from the building with the \"W\" logo?": "Yes",
        "Are the two identical buildings located to the left of the tallest building?": "Yes"
    },
    "test_00632": {
        "Is the handle of the skillet extending from the bottom left corner of the image?": "Yes",
        "Is the maroon towel visible in the very top right corner of the image?": "No",
        "Is the black marble countertop partially visible on the left side of the image?": "Yes",
        "Are the onions inside the skillet?": "Yes",
        "Is the towel hanging over a handle not part of the skillet?": "Yes"
    },
    "test_00633": {
        "Is the shadow of the stop sign positioned in the center of the image?": "No",
        "Is the metal pole visible on the left side of the image?": "Yes",
        "Is the curb on the right side of the concrete in the image?": "Yes",
        "Is the shadow of the stop sign cast on the concrete?": "Yes",
        "Is the metal pole connected to the stop sign embedded in the concrete?": "Yes"
    },
    "test_00636": {
        "Is the cat sitting on a light brown hardwood floor?": "Yes",
        "Are the white wood cabinet doors located to the left of the cat?": "Yes",
        "Is the shadow of the cat cast directly down onto the floor?": "Yes",
        "Is the cat sitting in front of the cabinet doors?": "Yes"
    },
    "test_00660": {
        "Is the helicopter positioned in the center of the image?": "No",
        "Are the clouds mostly above the helicopter?": "Yes",
        "Is the clear blue sky mostly below the helicopter?": "Yes",
        "Is the helicopter flying closer to the clouds than the clear blue sky?": "Yes",
        "Are the helicopter blades positioned in different directions?": "Yes"
    },
    "test_00661": {
        "Is the red double-decker bus positioned behind the four multi-colored cars?": "Yes",
        "Are the buildings with large LED screens behind the line of cars and the bus?": "Yes",
        "Is there another line of cars on the left side of the original line of multi-colored cars?": "Yes",
        "Are the multi-colored cars in front of the double-decker bus?": "Yes",
        "Is there a line of cars to the left of the multi-colored cars?": "Yes"
    },
    "test_00663": {
        "Is the metal structure outside the train on the left side of the window?": "Yes",
        "Are the two lines running along the right side of the field?": "Yes",
        "Is the black sticker located on the bottom left of the window?": "Yes",
        "Is the metal structure outside the train to the left of the wind turbines?": "Yes",
        "Are the wind turbines lined up behind the field of grass?": "Yes"
    },
    "test_00666": {
        "Is the squirrel sitting on top of the geometric climbing dome?": "Yes",
        "Is the tree positioned in front of the climbing dome?": "Yes",
        "Is the trampoline located behind the climbing dome?": "Yes",
        "Is the squirrel sitting on top of the metal climbing dome?": "Yes",
        "Are the dried leaves on the ground beneath the dome?": "Yes"
    },
    "test_00681": {
        "Is the gray cat positioned on the right side of the desk?": "Yes",
        "Is the laptop on top of the pile of books on the left side of the desk?": "Yes",
        "Is the desk lamp positioned to the left of the gray cat?": "No",
        "Are both cats looking at the computer screen?": "Yes",
        "Is the lamp positioned to the right of the gray cat?": "Yes"
    },
    "test_00685": {
        "Are the three pillars positioned in the center of the image?": "Yes",
        "Is the grass visible on both sides of the image?": "Yes",
        "Is the partially visible bridge piece with stains and rust above the center pillars?": "Yes",
        "Are the three pillars connected by a horizontal piece above them?": "Yes",
        "Is there visible grass between the three pillars and the pillars in the background?": "Yes"
    },
    "test_00688": {
        "Are the microphones positioned to the left of the sign?": "Yes",
        "Is the spotlight located above on the right and turned off?": "Yes",
        "Is the soft sunlight on the bottom right of the image?": "Yes",
        "Are the microphones positioned in front of the sign?": "Yes",
        "Is the sunlight shining directly on the microphones?": "No"
    },
    "test_00691": {
        "Is the shovel positioned in the center of the image?": "Yes",
        "Is the pile of wood beams on the right side of the shovel?": "No",
        "Is the shadow from the shovel's handle cast to the right of the shovel?": "Yes",
        "Is the shadow of the shovel cast in front of and to the right of the shovel?": "Yes",
        "Is the pile of wood beams positioned to the left of the shovel?": "Yes"
    },
    "test_00700": {
        "Is the urinal positioned in the center of the image?": "Yes",
        "Are the lavender paint smears on the left of the urinal?": "Yes",
        "Is the corner on the right side of the urinal?": "Yes",
        "Is the urinal positioned near a corner?": "Yes",
        "Are the lavender paint smears located on the wall behind the urinal?": "No"
    },
    "test_00705": {
        "Is the wooden box positioned on the right side of the image?": "Yes",
        "Is the light black stand supporting the box in the center of the image?": "Yes",
        "Is the heavily shadowed area on the ceiling on the right side of the image?": "Yes",
        "Is the wooden door of the box open?": "Yes",
        "Is the wooden box standing on a black stand?": "Yes"
    },
    "test_00712": {
        "Is the white Porsche Panamera GTS facing slightly to the right side of the image?": "Yes",
        "Is the dark gray Porsche positioned to the right of the white Porsche?": "Yes",
        "Are the rectangular windows located to the right of the cars?": "Yes",
        "Is the white Porsche Panamera GTS facing slightly towards the right in relation to the camera view?": "Yes",
        "Are the bright lights reflecting off both cars visible in the image?": "Yes"
    },
    "test_00729": {
        "Is the motorcycle's front tire facing almost straight upwards in the image?": "Yes",
        "Is the person positioned on the right side of the motorcycle?": "Yes",
        "Is the light source coming from above, affecting the visibility of the motorcycle fender?": "Yes",
        "Is the person holding the handlebars of the motorbike?": "Yes",
        "Is the front tire of the motorbike facing upward?": "Yes"
    },
    "test_00733": {
        "Is the yellow diamond sign positioned in the center of the image?": "Yes",
        "Is the sidewalk to the left of the sign in the image?": "Yes",
        "Is the road on the right side of the pole with the sign?": "Yes",
        "Is the sign attached to a pole?": "Yes",
        "Is the sidewalk located to the left of the sign?": "Yes"
    },
    "test_00740": {
        "Is the turtle swimming from right to left near the top of the image?": "No",
        "Are the small pieces of natural debris floating on the water's surface visible throughout the image?": "Yes",
        "Is there a reflection visible towards the top left of the image?": "Yes",
        "Is the turtle swimming below the water's surface?": "Yes",
        "Are the small pieces of natural debris floating on the water's surface?": "Yes"
    },
    "test_00773": {
        "Is the fountain positioned in front of the building?": "Yes",
        "Are there cement walls on both sides of the fountain?": "Yes",
        "Are the trees visible directly behind the fountain?": "No",
        "Are the cement walls connected to the round cement border of the fountain?": "Yes"
    },
    "test_00777": {
        "Is the sculpture positioned on a gray stone-paved circle?": "Yes",
        "Are the three thin tubes on the right side of the top section?": "Yes",
        "Is there a part of a gear shape behind the top left corner of the left piece?": "Yes",
        "Are the three thin tubes on the top section attached to the horizontal piece?": "Yes",
        "Is the entire sculpture supported by the vertical tall pieces in the bottom section?": "Yes"
    },
    "test_00785": {
        "Is the graffiti positioned on the right side of the wall?": "Yes",
        "Is the tree cover visible in the left part of the image?": "Yes",
        "Is the star shape situated towards the bottom of the vertical line?": "No",
        "Does the circle overlap the top of the triangle in the graffiti?": "Yes",
        "Is the star shape positioned toward the top of the vertical line connecting the circle and triangle?": "Yes"
    },
    "test_00796": {
        "Is the cream colored racket on the left side of the image?": "Yes",
        "Is the light switch located to the right of both rackets?": "No",
        "Is the red and light wood racket positioned to the right of the cream colored racket?": "Yes",
        "Are the two tennis rackets mounted on the same wall?": "Yes",
        "Is the light switch to the left of the cream-colored racket?": "Yes"
    },
    "test_00808": {
        "Is the tire standing against the stone border?": "Yes",
        "Are there dry leaves to the right of the tire?": "Yes",
        "Is the grass surface level with the stone border and to the left of the tire?": "Yes",
        "Is the tire leaning against the stone border?": "Yes",
        "Are there dry leaves both inside and outside the tire?": "Yes"
    },
    "test_00859": {
        "Is the tire positioned in the center of the image?": "Yes",
        "Is the light gray portion of the road located below the tire?": "Yes",
        "Is the car body more visible on the left side of the tire compared to the right?": "No",
        "Are the lug nuts around the center circle of the rim?": "Yes",
        "Is the light gray portion of the road directly underneath the tire?": "Yes"
    },
    "test_00864": {
        "Is the datura flower positioned in the center of the image?": "Yes",
        "Are the two bees near the center of the datura flower?": "Yes",
        "Is the blurred brown surface in the bottom right of the image?": "Yes",
        "Are the bees touching the center of the flower?": "Yes",
        "Are the leaves surrounding the flower?": "Yes"
    },
    "test_00880": {
        "Are all three sea dragons positioned towards the right side of the image?": "Yes",
        "Is the large rock positioned behind the sea dragons to the left?": "Yes",
        "Is the small water plant located on the left side of the image?": "No",
        "Are the sea dragons facing the same direction as the small water plant?": "Yes",
        "Is the large rock positioned behind the sea dragons relative to their direction?": "Yes"
    },
    "test_00884": {
        "Is the painted stone positioned in the bottom center of the image?": "Yes",
        "Are there 3 round brown stones to the left of the painted stone?": "Yes",
        "Is the loaf shaped gray stone directly above the painted stone?": "Yes",
        "Is the painted stone below the loaf-shaped gray stone?": "Yes",
        "Are the round brown stones to the left of the painted stone?": "Yes"
    },
    "test_00886": {
        "Is the road visible on the right side of the image?": "Yes",
        "Are the cirrostratus clouds located in the middle portion of the image?": "Yes",
        "Is the hill or mountainous area on the left side of the image?": "Yes",
        "Is the road angled towards the left side of the image?": "Yes",
        "Are the trees located on both sides of the road?": "Yes"
    },
    "test_00907": {
        "Is the cat positioned on the left side of the image?": "Yes",
        "Is the sticker on the wooden wall located on the left side of the image?": "No",
        "Is the black star on the floor underneath the box visible on the right side of the image?": "No",
        "Is the cat lying on the pizza box?": "Yes",
        "Is the white sticker located on the right side of the wooden wall?": "Yes"
    },
    "test_00908": {
        "Is the light positioned at the top left of the painting?": "Yes",
        "Is the white light switch below the painting on the wooden wall?": "Yes",
        "Are the wooden steps at the bottom of the image?": "Yes",
        "Is the light above the painting on the wooden wall?": "Yes",
        "Is the light switch located to the right of the painting?": "Yes"
    },
    "test_00909": {
        "Is the bell tower positioned in the center of the image?": "Yes",
        "Is the large office building with glass walls on the right side of the image?": "Yes",
        "Are the birds positioned at the top of the bell tower?": "Yes",
        "Are the birds positioned above the bells on the tower?": "Yes",
        "Is the office building situated to the right of the bell tower?": "Yes"
    },
    "test_00956": {
        "Are the purple verbena flowers located mostly in the center of the image?": "No",
        "Is there a bush with long thin leaves on the right side of the image?": "Yes",
        "Are there patches of dirt at the bottom of the image?": "Yes",
        "Are the purple verbena flowers growing behind the bush with long thin leaves?": "Yes",
        "Are there patches of dirt visible below the flowers?": "Yes"
    },
    "test_00965": {
        "Is the silver bottle on the far left side of the shelf?": "Yes",
        "Is the light brown wooden ship wheel directly below the fish?": "Yes",
        "Is the teal glass vase on the right side of the brown wooden shelf?": "Yes",
        "Is the taxidermy fish located above the sign that reads \"CALIFORNIA WHITE SEABASS\"?": "Yes",
        "Is the teal glass vase positioned to the left of the dark colored lamp on the shelf?": "Yes"
    },
    "test_00984": {
        "Is the text \"RESTROOM\" located in the bottom section of the wall?": "Yes",
        "Is the hand outline to the right of the text \"RESTROOM\" pointing towards the left?": "No",
        "Does the Rhombile tiling appear on the left edge of the wall?": "Yes",
        "Is the hand pointing towards the Rhombile tiling?": "No",
        "Is the text \"RESTROOM\" located below the hand outline?": "Yes"
    },
    "test_00987": {
        "Are the bright yellow colored lights positioned at the base of the pillars?": "Yes",
        "Is the tree located directly behind the walkway?": "Yes",
        "Is the sky visible on the left side of the image?": "Yes",
        "Are the lights positioned in front of the brick pillars?": "Yes",
        "Is the tree located behind the walkway?": "Yes"
    },
    "test_00990": {
        "Is the water tower positioned in the center of the image?": "Yes",
        "Is the partial view of the home on the bottom right of the image?": "Yes",
        "Are the trees positioned across the middle of the view in front of the water tower?": "Yes",
        "Are the trees positioned in front of the water tower?": "Yes",
        "Is the street pole in front of the house?": "Yes"
    },
    "test_01006": {
        "Is the beetle positioned on top of the seashell?": "Yes",
        "Is the beetle facing to the right side of the image?": "No",
        "Is the seashell lying on a sandy surface?": "Yes",
        "Is the rhinoceros beetle on top of the seashell?": "Yes",
        "Are the beetle and seashell placed on a sandy surface?": "Yes"
    },
    "test_01028": {
        "Is the roulette wheel positioned in the center of the image?": "Yes",
        "Are the muted green squares with the numbers \"0\", \"000\", and \"00\" on the right side of the image?": "Yes",
        "Is the plexiglass wall surrounding the bottom and right side of the wheel?": "Yes",
        "Is the roulette wheel enclosed by plexiglass on the right side?": "Yes",
        "Is the silver border inside the numbers adjacent to the polished wood of the roulette wheel?": "Yes"
    },
    "test_01032": {
        "Is the statue positioned in the center of the image?": "Yes",
        "Are the two brown birds located on the right side of the image?": "No",
        "Are the benches positioned behind the statue in the image?": "Yes",
        "Are there plants at the base of the statue pedestal?": "Yes",
        "Are the benches positioned in front of the building?": "Yes"
    },
    "test_01034": {
        "Is the duck on the left sitting under the shade of the overhanging branches?": "Yes",
        "Is the duck on the right resting in the sunlight?": "Yes",
        "Is the shallow body of water located behind the ducks?": "Yes",
        "Are both ducks sitting under the low-hanging tree branch?": "Yes",
        "Is the duck on the left sitting in the sunlight?": "No"
    },
    "test_01046": {
        "Are the square shaped bricks positioned mostly in the top half of the image?": "Yes",
        "Are the stains visible more on the gray colored bricks than the light tan bricks?": "Yes",
        "Are the small dark twigs seen mostly in the bottom half of the image?": "No",
        "Are the square shapes positioned among the rectangles in the design?": "Yes",
        "Do the small dark twigs lie on top of the bricks?": "Yes"
    },
    "test_01047": {
        "Is the balcony on the far right of the building?": "Yes",
        "Are the tall glass and concrete buildings in the background to the left side of the image?": "Yes",
        "Is the long light positioned on the left side of the sign?": "Yes",
        "Are the metal beams attached to the wall holding the sign?": "No",
        "Are the tall glass buildings in the background to the left of the main building?": "Yes"
    },
    "test_01057": {
        "Is the blackboard sign positioned in the center of the image?": "Yes",
        "Are the two blue flame agave located in front of the blackboard sign?": "Yes",
        "Is the plant with large green leaves on the left side of the sign?": "No",
        "Is the blackboard sign surrounded by blue flame agave plants?": "Yes",
        "Are the dried-up leaves on the ground around the blackboard sign?": "Yes"
    },
    "test_01063": {
        "Is the pink plastic water bottle positioned to the left side of the image?": "Yes",
        "Is the sidewalk located on the right side of the water bottle?": "Yes",
        "Is the patch of dirt behind the pink plastic water bottle?": "Yes",
        "Is the teal switch positioned below the clear plastic lid?": "Yes",
        "Are the gray nylon ropes looped through the bottle to the left of the teal switch?": "No"
    },
    "test_01065": {
        "Is the chandelier positioned in the center of the sky ceiling?": "Yes",
        "Are the clouds painted around the chandelier part of the ceiling?": "Yes",
        "Is the engraved design part of the light beige colored ceiling surrounding the sky design?": "Yes",
        "Is the chandelier mounted at the center of the sky-designed ceiling?": "Yes",
        "Is the sky-designed ceiling surrounded by more ceiling with engraved designs?": "Yes"
    },
    "test_01068": {
        "Is the reflection of the apartment building positioned vertically in the water?": "Yes",
        "Are the tall palm trees reflected on the left side of the water?": "Yes",
        "Is the overhanging branch visible in the reflection on the far left?": "Yes",
        "Is the reflection of the apartment building directly in line with the actual building?": "Yes",
        "Are the palm trees positioned between the apartment building and the water?": "Yes"
    },
    "test_01103": {
        "Is the person's right hand positioned in the left half of the image?": "Yes",
        "Is the bright orange glow inside the furnace centered in the image?": "Yes",
        "Are the two iron rods supporting the furnace located on both the left and right sides of the furnace?": "Yes",
        "Is the person's hand directing the rod into the left half of the furnace?": "Yes",
        "Are the two supporting iron rods positioned on opposite sides of the furnace?": "Yes"
    },
    "test_01105": {
        "Is the ball with yellow markings on the right side of the image?": "Yes",
        "Is the metal stand for the left ball in front of the ball and to the left?": "Yes",
        "Is the large screw connecting the balls visible in the image?": "Yes",
        "Are both balls held in place by metal stands?": "Yes",
        "Is there a screw connecting both balls?": "Yes"
    },
    "test_01108": {
        "Is the green Sky Trak positioned on the right side of the image?": "Yes",
        "Are the three flattened red cars in front of the green Sky Trak?": "Yes",
        "Is the orange van positioned behind the green Sky Trak?": "Yes",
        "Is the green Sky Trak vehicle positioned behind the red flattened cars?": "Yes",
        "Are the yellow flattened cars located behind the orange van?": "Yes"
    },
    "test_01111": {
        "Is the white pillar candle positioned at the top of the wooden shelf?": "Yes",
        "Is the black chain with white flowers located on the right side of the image?": "Yes",
        "Is the blue slanted banner with words on it visible on the left side of the image?": "No",
        "Is the white pillar candle sitting on the carved wooden decorative shelf?": "Yes",
        "Are the white flowers around the black chain in a basket?": "Yes"
    },
    "test_01161": {
        "Is the knife and fork positioned towards the right side of the plate?": "Yes",
        "Is the small white bowl located on the left half of the plate?": "Yes",
        "Are the wooden beams positioned vertically in the image?": "No",
        "Is the fork lying parallel to the knife on the plate?": "Yes",
        "Is the small white bowl positioned on the left half of the plate?": "Yes"
    },
    "test_01179": {
        "Is the largest red triangle positioned along the near side of the view?": "Yes",
        "Are the small yellow light bulbs hanging towards the left side of the view?": "Yes",
        "Is the building positioned towards the middle of the view?": "Yes",
        "Are the bottom two corners of the large red triangle connected to poles?": "Yes",
        "Do the two thin lines with small yellow light bulbs connect to the pole on the left?": "Yes"
    },
    "test_01182": {
        "Is the discoloration causing the rock to become chalk white located in the bottom left corner?": "Yes",
        "Is the damp area with dark green algae found in the top left corner of the rock?": "No",
        "Is the rock casting a shadow on the left side underneath it?": "Yes",
        "Is the discoloration on the rock in the bottom left corner?": "Yes",
        "Is the rock placed on an ammonite fossil?": "Yes"
    },
    "test_01198": {
        "Is the arrow pointing diagonally down and to the left?": "Yes",
        "Is the upper ledge of the building made of red brick?": "Yes",
        "Is the wall below the red brick stained and peeling?": "Yes",
        "Is the arrow pointing towards the gray brick wall?": "Yes",
        "Is the sky positioned above the red brick ledge?": "Yes"
    },
    "test_01203": {
        "Is the gray muscle car positioned toward the left side of the image?": "Yes",
        "Is the sign with \"TRUCKS\" located above the gray muscle car?": "Yes",
        "Are the highway signs in the top right corner of the image?": "Yes",
        "Is there a car in front of the gray muscle car with its hood up?": "Yes",
        "Are the rearview mirrors on both sides of the gray muscle car?": "Yes"
    },
    "test_01247": {
        "Is the squirrel positioned towards the bottom center of the image?": "Yes",
        "Are the blue spray-painted markings located in the bottom left corner of the image?": "Yes",
        "Is the squirrel facing slightly towards the right side of the image?": "No",
        "Is the squirrel standing on the paved road?": "Yes",
        "Are the blue spray painted markings in front of the squirrel?": "Yes"
    },
    "test_01277": {
        "Is the fountain positioned in the center of the image?": "Yes",
        "Are the mannequins located in the top left corner of the image?": "Yes",
        "Is the swordfish model on the right side of the image?": "Yes",
        "Is the fountain positioned up against a tile wall?": "Yes",
        "Are the mannequins located behind the fountain?": "Yes"
    },
    "test_01284": {
        "Are the tire marks positioned diagonally from the bottom left to the top right of the image?": "Yes",
        "Are there multiple marks imprinted on the concrete surface?": "Yes",
        "Are there any shadows visible in the image?": "No",
        "Do the tire marks run from the bottom left to the upper right of the view?": "Yes",
        "Are multiple marks present on the concrete surface?": "Yes"
    },
    "test_01285": {
        "Is the center post of the staircase on the right side of the image?": "Yes",
        "Is the wooden handrail on the left side of the steps?": "No",
        "Is the round, protruding circle visible on the left side of the center post?": "Yes",
        "Is the handrail adjacent to the concrete wall?": "Yes",
        "Is the center post to the left of the staircase steps?": "No"
    },
    "test_01286": {
        "Is the butterfly positioned in the center of the image?": "Yes",
        "Is the shadow on the top right corner of the image?": "Yes",
        "Is the butterfly's body facing towards the back of the image?": "Yes",
        "Is the butterfly on top of the cement pieces?": "Yes",
        "Is the shadow on the cement pieces separate from the butterfly?": "Yes"
    },
    "test_01288": {
        "Is one Gleditsia sinensis plant attached to the center of the tree trunk?": "Yes",
        "Is there an out of focus area filled with bushes to the left of the tree trunk?": "No",
        "Is one Gleditsia sinensis plant attached on the bottom right of the trunk?": "Yes",
        "Are any Gleditsia sinensis plants located at the center of the tree trunk?": "Yes",
        "Is there a shadow being cast on the tree trunk?": "Yes"
    },
    "test_01291": {
        "Is the numeral one on the left side of the image?": "Yes",
        "Is the numeral three positioned to the right of the numeral two?": "Yes",
        "Is the placard centered on the cinder block wall?": "No",
        "Are the numerals behind the graphics arranged in numerical order from left to right?": "Yes",
        "Is the placard mounted on a contrasting colored wall?": "Yes"
    },
    "test_01294": {
        "Is the murky green water in the lower part of the image?": "Yes",
        "Are the bright green trees located in the center of the image?": "Yes",
        "Are the dried out and dead trees positioned on the edges of the image?": "Yes",
        "Are the segments of rock separated by gaps?": "Yes",
        "Are the trees with green leaves located above the central segments of rock?": "Yes"
    },
    "test_01301": {
        "Is the scooter positioned to the left of the utility cover?": "Yes",
        "Is the black bicycle located in the lower-right corner of the image?": "Yes",
        "Is the aluminum tube attached to the top of the wall moving towards the bottom of the image?": "Yes",
        "Is the scooter positioned next to the utility cover?": "Yes",
        "Is the bicycle in contact with the scooter?": "No"
    },
    "test_01306": {
        "Is the shipping container green?": "Yes",
        "Are the white bags placed in front of the fence?": "Yes",
        "Is the graffiti word \"BUSCAR\" positioned above the tarp?": "Yes",
        "Is the graffiti on the fence tarp visible through the holes?": "Yes",
        "Are the white bags in front of the curb?": "No"
    },
    "test_01307": {
        "Is the scuba diver positioned in the center of the image?": "Yes",
        "Are the fish predominantly located in the bottom right corner of the image?": "Yes",
        "Are the bubbles from the scuba diver's face located above the diver?": "Yes",
        "Is the scuba diver facing away from the fish?": "Yes",
        "Are there bubbles near the scuba diver's face?": "Yes"
    },
    "test_01314": {
        "Is the hexagon shaped object in the center of the image?": "Yes",
        "Is the dried leaf positioned at the upper left of the hexagon?": "Yes",
        "Is the pen object in a dirt patch on the right side of the image?": "No",
        "Is the hexagon object surrounded by rocky concrete?": "Yes",
        "Is the dried leaf positioned above the hexagon?": "Yes"
    },
    "test_01336": {
        "Is the red door on the left side of the image?": "No",
        "Is the brown shingle roof at the top of the image?": "Yes",
        "Is the cement on the ground visible at the bottom of the image?": "Yes",
        "Is the painting of the rose extending from the door onto the wall?": "Yes",
        "Is there cement between the door and the car?": "Yes"
    },
    "test_01352": {
        "Is the dark grey Chevrolet Corvette C8 parked in the center of the image?": "No",
        "Is the white car in the background moving to the left side of the image?": "Yes",
        "Is the billboard positioned on the right side of the image?": "Yes",
        "Is the Chevrolet Corvette C8 parked near other cars?": "Yes",
        "Is the arrow in the parking lot pointing toward the white car on the street?": "No"
    },
    "test_01353": {
        "Are the bricks stacked near the center of the image?": "Yes",
        "Is the shadow of the brick stack cast toward the left side of the image?": "Yes",
        "Are the bricks positioned more toward the bottom right corner of the image?": "No",
        "Are the bricks stacked on top of each other?": "Yes",
        "Is there a shadow cast by the bricks on the sand?": "Yes"
    },
    "test_01370": {
        "Is the gray BMW station wagon positioned on the left side of the image?": "Yes",
        "Is the tree located on the far right side of the image?": "Yes",
        "Is the black car parked directly behind the BMW station wagon?": "No",
        "Is the cargo box on top of the gray BMW station wagon?": "Yes",
        "Is the black car parked under the tree?": "Yes"
    },
    "test_01399": {
        "Is the hippopotamus statue's head facing to the right side of the image?": "Yes",
        "Are the gray exhaust pipes positioned on the back of the hippopotamus statue?": "Yes",
        "Is the bare patch of ground located in the bottom left corner of the image?": "Yes",
        "Is the hippopotamus statue standing on a rock base?": "Yes",
        "Are the gray exhaust pipes located on the back of the hippo?": "Yes"
    },
    "test_01440": {
        "Is the Breeo Smokeless Fire Pit positioned in the center of the image?": "Yes",
        "Are the medium sized stones surrounding the fire pit positioned uniformly around it?": "Yes",
        "Are the small parts of the tops of bushes seen in the corners of the image?": "Yes",
        "Are the medium-sized stones surrounding the concrete base of the fire pit?": "Yes",
        "Are the bushes in the background forming a corner of a square?": "Yes"
    },
    "test_01455": {
        "Is the male mannequin in the red blazer on the left side of the image?": "Yes",
        "Is the female mannequin in the red and pink dress on the far right side of the image?": "Yes",
        "Is the chandelier positioned above the heads of the mannequins?": "Yes",
        "Is the chandelier above all the mannequins?": "Yes",
        "Are the male mannequins positioned in front of the female mannequins?": "No"
    },
    "test_01461": {
        "Is the tall beige building located in the back right corner of the image?": "Yes",
        "Are the seven yellow bins with gray tops positioned at the lower right of the image?": "Yes",
        "Is the gas station visible in the upper left corner of the image?": "Yes",
        "Is the semi truck traveling towards the right crossing the intersection?": "Yes",
        "Are the yellow bins positioned as a median between opposing traffic at the crosswalk?": "Yes"
    },
    "test_01462": {
        "Is the speaker positioned in the center of the image?": "Yes",
        "Is the black bag on the right side of the air conditioning unit box?": "No",
        "Is the gray wooden shed located in the top right corner of the image?": "Yes",
        "Is the speaker mounted on the tripod?": "Yes",
        "Is the black bag resting against the air conditioning unit?": "Yes"
    },
    "test_01476": {
        "Is the whale shark positioned to the left side of the image?": "Yes",
        "Is the diver located in front of the whale shark?": "Yes",
        "Is the dark gray fish on the top right side of the image?": "Yes",
        "Is the diver positioned in front of the whale shark?": "Yes",
        "Are the bubbles surrounding the dark gray fish?": "Yes"
    },
    "test_01513": {
        "Are the pink and red flowers positioned directly in front of the model?": "Yes",
        "Are the tall Monstera plants growing over the right side of the model?": "Yes",
        "Is the patch of crimson flowers located below the log fence?": "Yes",
        "Are the pink and red flowers located in front of the miniature model?": "Yes",
        "Is the Monstera growing above the right side of the model?": "Yes"
    },
    "test_01519": {
        "Is the chandelier positioned at the center of the image?": "Yes",
        "Is the silver ladder located at the bottom right of the shelf?": "Yes",
        "Is the venting system visible on both the left and right sides of the image?": "Yes",
        "Is the chandelier hanging above the shelves?": "Yes",
        "Is the ladder attached to the metal rod on the shelves?": "Yes"
    },
    "test_01522": {
        "Is the rooster positioned in the center of the image?": "Yes",
        "Are the witch legs to the right of the \"DARE\" sign?": "Yes",
        "Is the skeleton leaning against the porch post behind the yellow mums?": "Yes",
        "Are the witch legs in front of the trellis?": "Yes",
        "Is the skeleton behind the potted plant of mums?": "Yes"
    },
    "test_01524": {
        "Is the fire hydrant positioned in the center of the image?": "Yes",
        "Is the wired metal gate with a black tarp towards the top left of the image?": "Yes",
        "Is the tree trunk with dark gray bark directly behind the fire hydrant?": "Yes",
        "Is the hydrant in front of the tree trunk?": "Yes",
        "Is the metal gate to the left of the hydrant?": "Yes"
    },
    "test_01527": {
        "Is the Kawasaki Mule facing the left side of the image?": "Yes",
        "Is the dirt surface on the left side of the vehicle?": "Yes",
        "Are there tree trunks behind the red vehicle?": "Yes",
        "Is the vehicle parked on the gray cement surface?": "Yes",
        "Are the tree trunks behind the vehicle?": "Yes"
    },
    "test_01568": {
        "Is the white water tower positioned on the left side of the red building?": "Yes",
        "Is the black gate located below the red building?": "No",
        "Are the light pink and red dots scattered around the left side of the image?": "Yes",
        "Is the tall white water tower on the left side of the building?": "Yes",
        "Are the trees located behind the black gate?": "Yes"
    },
    "test_01581": {
        "Is the clay dalmatian puppy positioned in the corner of the image?": "Yes",
        "Is the puppy facing towards the right side of the image?": "Yes",
        "Is there any object other than the clay puppy in the image?": "No",
        "Is the clay dalmatian puppy facing slightly toward the viewer?": "Yes",
        "Is the shadow of the puppy under the model?": "Yes"
    },
    "test_01587": {
        "Is the squirrel facing to the right side of the image?": "Yes",
        "Is the upright iron pole located on the left side of the roof?": "Yes",
        "Is the chain link fence partially visible in the bottom right corner of the frame?": "Yes",
        "Is the squirrel positioned to the right of the base with the pole?": "Yes",
        "Is the chain link fence located below the level of the roof?": "Yes"
    },
    "test_01594": {
        "Is the fork positioned on the left side of the place mat?": "Yes",
        "Is the ramekin of broth located in the top left corner of the plate?": "Yes",
        "Is the knife placed on the right side of the plate?": "Yes",
        "Is the knife placed to the right of the plate?": "Yes",
        "Are the fried plantains located in the lower left corner of the plate?": "Yes"
    },
    "test_01602": {
        "Are the 3 chairs and small white table positioned on the left side of the image?": "Yes",
        "Is the green fence with poles situated on the right side of the image?": "Yes",
        "Are the tall buildings in the distance located beyond the tennis courts?": "Yes",
        "Are the chairs positioned next to the green pole?": "Yes",
        "Is the white table closer to the tennis courts than the tall buildings?": "Yes"
    },
    "test_01609": {
        "Is the mirror positioned directly above the glass table?": "Yes",
        "Is the black lamp located on the right side of the table?": "Yes",
        "Is the plant situated to the left of the glass table?": "Yes",
        "Is the table positioned against the wall?": "Yes",
        "Is the plant to the left of the table?": "Yes"
    },
    "test_01612": {
        "Is the alligator's head positioned towards the bottom right of the image?": "Yes",
        "Are the treetops reflected in the upper left corner of the image?": "Yes",
        "Is the steel handrail visible at the top of the image?": "No",
        "Is the alligator moving towards the bottom right corner of the image?": "Yes",
        "Are the treetops visible in the reflection on the water near the upper left corner?": "Yes"
    },
    "test_01619": {
        "Is the black fly positioned in the upper left corner of the sign?": "Yes",
        "Is the reflection of the building above the sign?": "Yes",
        "Is the text \"NO SMOKING\" centered on the sign?": "Yes",
        "Is the fly sitting on the sign?": "Yes"
    },
    "test_01621": {
        "Is the frog positioned at the center of the image?": "Yes",
        "Are more rocks located behind the frog and at the bottom of the image?": "Yes",
        "Is dirt covering some of the rocks surrounding the frog?": "Yes",
        "Are there rocks surrounding the frog?": "Yes",
        "Is the frog camouflaged among the dead leaves?": "Yes"
    },
    "test_01632": {
        "Are the light fixtures placed in an alternating pattern along the hallway?": "Yes",
        "Is the window located at the end of the hallway?": "Yes",
        "Are the signs indicating room numbers placed between each set of doors?": "Yes",
        "Are the lamps placed in an alternating pattern in relation to the sets of doors?": "Yes",
        "Is the natural light coming from a window at the end of the hallway?": "Yes"
    },
    "test_01634": {
        "Is the dog sleeping on the left side of the image?": "Yes",
        "Is the table with a navy blue base located on the right side of the image?": "Yes",
        "Are the two black plugs inside the white socket located on the left side of the plant?": "Yes",
        "Is the plant placed in front of the dog bed?": "Yes",
        "Are the wooden shelves with items on top to the left of the dog bed?": "Yes"
    },
    "test_01636": {
        "Is the white \"x\" closer to the center of the image?": "Yes",
        "Is the shorter line of the \"x\" on the right side?": "Yes",
        "Are the brown leaves mainly located along the top portion of the \"x\"?": "Yes",
        "Is the shorter line on the right side of the \"x\"?": "Yes",
        "Are the leaves located along the top portion of the \"x\"?": "Yes"
    },
    "test_01642": {
        "Is the black and white cat positioned on the left side of the image?": "Yes",
        "Is the dark gray cat moving towards the right side of the image?": "No",
        "Are the reflections of the cats visible on the stairs?": "Yes",
        "Is the black and white cat sitting on the stairs?": "Yes",
        "Is the dark gray cat moving toward the left side of the stairs?": "Yes"
    },
    "test_01651": {
        "Are the yellow cars positioned side-by-side across the image?": "Yes",
        "Is the checkered flag visible in the top left corner of the image?": "Yes",
        "Are the right wheels of the car on the right placed inside tires that are laying flat on the cement surface?": "Yes",
        "Are the right wheels of the car on the right placed inside another set of wheels?": "Yes",
        "Is the rear bumper of the car second to the right detached from it?": "Yes"
    },
    "test_01667": {
        "Is the white plane flying over the left side of the island?": "Yes",
        "Is the ship located at the bottom of the image?": "No",
        "Is the island extending from the bottom right side of the image?": "Yes",
        "Is the plane flying over the beach on the island's left side?": "Yes",
        "Is the ship located above the island in the image?": "Yes"
    },
    "test_01675": {
        "Is the moon positioned in the center of the image?": "Yes",
        "Are the trees located beneath the moon?": "Yes",
        "Is the sky visible in between the gaps of the tree's branches?": "Yes",
        "Are the trees positioned beneath the moon in the image?": "Yes",
        "Can the sky be seen through the gaps in the tree branches?": "Yes"
    },
    "test_01676": {
        "Are the large white rocks located on the left side of the river?": "Yes",
        "Is the statue positioned facing the right?": "Yes",
        "Are the tall plants with large green leaves on the right side of the river?": "Yes",
        "Are the tall blades of grass growing above the rocks on the left side of the river?": "Yes",
        "Is the statue facing the same direction as the flow of the river?": "Yes"
    },
    "test_01679": {
        "Is the pumpkin positioned in the foreground of the image?": "Yes",
        "Is there another bench to the left of the pumpkin?": "Yes",
        "Is the gravel floor visible behind the pumpkin?": "Yes",
        "Is the pumpkin sitting on the wooden table?": "Yes"
    },
    "test_01683": {
        "Is the blue Ford Galaxie parked in front of the white stucco building?": "Yes",
        "Is the hood of the Ford Galaxie open with the carburetor cover visible?": "Yes",
        "Is there a red car partially visible on the left side of the image?": "Yes",
        "Is the Ford Galaxie parked directly in front of the white stucco building?": "Yes",
        "Is there a shadow cast under the car?": "Yes"
    },
    "test_01684": {
        "Is the orange overhang located at the top of the window?": "Yes",
        "Is the skull neon light positioned in the center of the window?": "Yes",
        "Is the square metal box located to the left of the window?": "Yes",
        "Is the neon skull light positioned in front of the white blinds?": "Yes",
        "Is the metal box located to the left of the window?": "Yes"
    },
    "test_01686": {
        "Is the statue casting a shadow on the wall to the left of it?": "Yes",
        "Are the letters \"IN\" visible on the far right side of the image?": "Yes",
        "Is the name \"AUDUBON\" carved on the front of the block under the statue?": "Yes",
        "Is the statue placed on a block with a name carved into it?": "Yes",
        "Is the shadow of the statue cast to the left of it?": "Yes"
    },
    "test_01700": {
        "Is the spider positioned in the center of the web?": "Yes",
        "Is the bush located to the left of the web?": "Yes",
        "Is the area of grass on the left side of the bush?": "No",
        "Is the spider positioned at the center of the web?": "Yes"
    },
    "test_01703": {
        "Is the dark brown peahen positioned on the right side of the image?": "Yes",
        "Is the small stone wall located to the left of the peahen?": "Yes",
        "Is the second peahen located on the grass patch behind the stone wall on the left side of the image?": "Yes",
        "Is the stone wall located to the left of the peahen on the dirt road?": "Yes",
        "Is the second peahen standing on the grass patch to the left of the stone wall?": "Yes"
    },
    "test_01711": {
        "Is the flood light located on the left part of the court?": "Yes",
        "Are the empty seats located on the opposite side of the green fence?": "Yes",
        "Is the small solar light located in the left corner on the side of the court?": "Yes",
        "Is the solar light positioned on the same side as the lit part of the court?": "Yes",
        "Are the empty seats located behind the green fence?": "Yes"
    },
    "test_01723": {
        "Is the gray water tower positioned in the center of the image?": "Yes",
        "Are the power lines extending across the top part of the image?": "Yes",
        "Are the buildings located in the bottom right corner of the image?": "Yes",
        "Are the power lines positioned above the water tower?": "Yes",
        "Is the group of buildings located to the right of the water tower?": "Yes"
    },
    "test_01732": {
        "Is the blue Hot Wheels monster truck driving towards the right side of the image?": "Yes",
        "Are the two paintings of flames positioned above the truck?": "Yes",
        "Is the race flag located between the two paintings of flames?": "Yes",
        "Is the monster truck driving on its back wheels with the front wheels slightly touching the ground?": "Yes",
        "Are the paintings of flames on the wall positioned on either side of the race flag?": "Yes"
    },
    "test_01734": {
        "Is the road sign slightly shifted to the left on the road?": "Yes",
        "Is the tree located in the top right corner of the image?": "No",
        "Is the external light coming from the left side of the image?": "Yes",
        "Is the tree located to the left of the road sign?": "Yes",
        "Is the black curved wire directly behind the road sign?": "Yes"
    },
    "test_01744": {
        "Is the red star positioned in the center of the image?": "No",
        "Is the outline of the mat visible on the left side of the frame?": "Yes",
        "Is the partial view of the white and yellow cup located in the bottom left corner of the frame?": "Yes",
        "Is the red star positioned closer to the center of the mat than the edges?": "Yes",
        "Is the cup located outside the boundary of the mat?": "Yes"
    },
    "test_01751": {
        "Is the structure in the center of the image?": "Yes",
        "Is the light underneath the structure evenly spread on all sides?": "Yes",
        "Is the gray colored ceiling above the structure?": "Yes",
        "Is the 2D woman's profile mounted to the wooden wall?": "Yes",
        "Is the glowing yellow light surrounding the structure on all sides?": "Yes"
    },
    "test_01756": {
        "Is the rooster sculpture positioned in the center of the image?": "Yes",
        "Is the painting depicting two people standing on a rock on the left side of the image?": "No",
        "Is the shadow of the rooster cast on the gray platform?": "Yes",
        "Is the sculpture positioned on a platform on the floor?": "Yes",
        "Are the paintings in the background directly behind the rooster sculpture?": "Yes"
    },
    "test_01762": {
        "Is the Cheshire cat positioned in the center of the image?": "Yes",
        "Are the four black wires positioned horizontally across the image?": "Yes",
        "Is the glare on the right near the edge of the image?": "Yes",
        "Is the Cheshire cat sitting behind the black wires?": "Yes",
        "Is the \"Good Luck\" sign located between the legs of the Cheshire cat?": "Yes"
    },
    "test_01771": {
        "Is the trash can positioned above the Beetle in the image?": "Yes",
        "Are the wood chips below the sidewalk in the image?": "Yes",
        "Is the rear bumper of the car on the left side of the trash can?": "Yes",
        "Is the trash can placed above the Volkswagen Beetle on the curb?": "Yes",
        "Are the wood chips located below the sidewalk?": "Yes"
    },
    "test_01787": {
        "Is the orange cone positioned on the right side of the wooden platform?": "Yes",
        "Is the red food truck located behind the wooden platform?": "Yes",
        "Are the small pebbles scattered around on the dirt area in front of the wooden platform?": "Yes",
        "Is the orange cone placed on the wooden platform?": "Yes",
        "Is the red food truck parked behind the wooden platform?": "Yes"
    },
    "test_01792": {
        "Is the large skull sculpture positioned to the right of the center of the image?": "Yes",
        "Is the partially visible skull on the left side of the large skull sculpture?": "Yes",
        "Is the shadow being cast to the right of the skull sculpture?": "No",
        "Is the large stone sculpture placed on a stone-brick walkway?": "Yes",
        "Is there a heavy shadow being cast to the left of the skull?": "Yes"
    },
    "test_01793": {
        "Is the butterfly positioned in the lower part of the image?": "Yes",
        "Is the leaf above the recessed border line?": "Yes",
        "Is the sunlight hitting the lower part of the image?": "No",
        "Is the butterfly above the words \"SEGUIMOS SIENDO NINOS\"?": "Yes",
        "Is the sunlight hitting the lower part of the sidewalk?": "No"
    },
    "test_01795": {
        "Is the football field positioned in the center of the image?": "Yes",
        "Is the baseball field to the left of the soccer field?": "Yes",
        "Is the flat top of a commercial building in the bottom right corner of the frame?": "Yes",
        "Is the baseball field positioned to the left of the soccer field?": "Yes",
        "Are the bleachers located on both sides of the football field?": "Yes"
    },
    "test_01811": {
        "Is the dog facing towards the left side of the image?": "Yes",
        "Is the red leash extending to the right side of the image?": "Yes",
        "Are the houses and trees visible on the left side of the image?": "Yes",
        "Is the red leash attached to the dog's collar?": "Yes",
        "Are the houses in the distance on the left side of the dog?": "Yes"
    },
    "test_01822": {
        "Are the hand prints located on the right side of the image?": "Yes",
        "Is the foliage positioned to the right of the hand prints?": "Yes",
        "Is the sheet metal positioned above the cinder block wall?": "Yes",
        "Are the handprints located on the right end of the wall?": "Yes",
        "Is the foliage to the right of the hand prints?": "Yes"
    },
    "test_01826": {
        "Is the door positioned on the left side of the image?": "Yes",
        "Is the gold chain link on the left side of the door?": "No",
        "Are the gas meters positioned directly in front of the side of the building?": "Yes",
        "Is the gas meter located to the right of the door?": "Yes",
        "Does the mural continue over the door?": "Yes"
    },
    "test_01832": {
        "Is the rhinoceros statue facing left in the image?": "Yes",
        "Are the tan stone blocks positioned directly below the black base?": "Yes",
        "Is there dead patchy grass visible to the left and right of the statue?": "Yes",
        "Is the rhino statue resting on top of the two tan blocks?": "Yes",
        "Are the red-orange bricks located below the tan blocks?": "Yes"
    },
    "test_01845": {
        "Is the dragonfly's head facing towards the upper left corner of the image?": "Yes",
        "Is the light green color primarily on the dragonfly's wings?": "No",
        "Is the light shining on the lower half of the image?": "Yes",
        "Is the head of the dragonfly facing towards the upper left corner of the frame?": "Yes",
        "Does the light shine on the lower half of the mosaic art piece?": "Yes"
    },
    "test_01847": {
        "Is the squirrel positioned in the center of the image?": "Yes",
        "Is the shadow falling on the left side of the image?": "No",
        "Are there dead leaves visible throughout the grassy area?": "Yes",
        "Is the squirrel standing in a shaded area?": "Yes",
        "Is the squirrel's tail positioned over the grass?": "Yes"
    },
    "test_01859": {
        "Is the massive Nimbostratus storm cloud positioned in the center of the image?": "Yes",
        "Are the surrounding clouds darker than the storm cloud?": "No",
        "Is there a section of Stratus clouds at the top of the frame?": "Yes",
        "Is the rain appearing to be attached to the Nimbostratus cloud?": "Yes",
        "Are the clouds surrounding the Nimbostratus cloud darkened by the storm?": "No"
    },
    "test_01860": {
        "Is the gray metal pole positioned on the left side of the image?": "Yes",
        "Are the large piles of coal visible on the right corner of the image?": "Yes",
        "Is the gray road located below the bushes in the image?": "Yes",
        "Is the grass field located between the mining facility and the storage building?": "No",
        "Are the square-shaped basins of water below the gray road?": "Yes"
    },
    "test_01879": {
        "Is the puddle of syrup located at the top right corner of the pancake?": "Yes",
        "Are the blueberries and strawberries under the butter slice?": "Yes",
        "Is the plate positioned on a white marble table?": "Yes",
        "Is the slice of butter directly touching the pancake?": "No",
        "Are there blueberries in the puddle of syrup on the plate?": "Yes"
    },
    "test_01888": {
        "Is the square sign with the red \"4\" located at the top center of the green board?": "Yes",
        "Is the drawing of the girl with long eyelashes positioned towards the bottom center of the green board?": "Yes",
        "Are the smears and scribbles to the left of the drawing of the girl?": "Yes",
        "Is the square sign with the red \"4\" attached above the main green board?": "Yes",
        "Can you see the sky through the metal fence behind the green board?": "Yes"
    },
    "test_01890": {
        "Is the red box truck located on the right side of the image?": "Yes",
        "Is the airplane flying towards the left side of the image?": "Yes",
        "Is the garden bed positioned in the lower left foreground of the image?": "Yes",
        "Is the archway being constructed in front of the Hoover Tower entrance?": "Yes",
        "Is the truck parked to the right of the platform where the archway is being constructed?": "Yes"
    },
    "test_01891": {
        "Is the two of clubs on the right side of the image?": "Yes",
        "Are the red velvet drapes visible below the sign to the left of the cards?": "Yes",
        "Is the blue light from the sign shining on the upper right corner of the ceiling?": "Yes",
        "Is the nine of clubs behind the four of diamonds?": "Yes",
        "Are the velvet drapes below the two of clubs?": "No"
    },
    "test_01896": {
        "Is the mantis positioned near the person's wrist on the left hand?": "Yes",
        "Is the blue shirt visible in the top left corner of the image?": "No",
        "Is the hand on the right tilted slightly to the side with fingers under the left hand's fingers?": "Yes",
        "Is the mantis on the palm of the left hand?": "Yes",
        "Are the fingers of the right hand under the fingers of the left hand?": "Yes"
    },
    "test_01915": {
        "Is the top of the Empire State Building in the center of the image?": "Yes",
        "Is the corner of the building with tan siding on the left side of the image?": "No",
        "Are the grasses positioned below the railing?": "No",
        "Is the glass wall behind the grass?": "Yes",
        "Does the Empire State Building appear above the grass tops?": "Yes"
    },
    "test_01925": {
        "Is the puppy sitting on the gray concrete curb?": "Yes",
        "Are the pinkladies flowers located behind the puppy?": "Yes",
        "Are the dried leaves found to the right of the puppy?": "Yes",
        "Is the puppy sitting in front of the flower bed?": "Yes",
        "Are the dried leaves positioned to the right of the puppy?": "Yes"
    },
    "test_01929": {
        "Is the glass toothpick dispenser on the left of the Foo Dog statue?": "Yes",
        "Is the alcohol spray bottle positioned to the right of the statue?": "Yes",
        "Is the red velvet base below the jade statue inside the glass box?": "Yes",
        "Is the glass toothpick dispenser to the left of the glass box with the statue?": "Yes",
        "Is the isopropyl alcohol bottle located to the right of the glass box with the statue?": "Yes"
    },
    "test_01936": {
        "Is the statue of the Goddess of Liberty located at the highest point of the building?": "Yes",
        "Is the statue holding the golden star with her right hand?": "No",
        "Is the sky behind the statue gray?": "Yes",
        "Is the statue of the Goddess of Liberty on top of the Texas State Capitol building?": "Yes",
        "Is the sky behind the structure blank and gray?": "Yes"
    },
    "test_01937": {
        "Is the dog positioned towards the right side of the image?": "Yes",
        "Is the stone surface brighter towards the bottom right of the image?": "Yes",
        "Is the tail of the dog pointing towards the left of the image?": "Yes",
        "Is the dog standing on a stone surface?": "Yes",
        "Is the sun shining on the surface in front of the dog?": "Yes"
    },
    "test_01952": {
        "Is the howitzer positioned in the center of the image?": "Yes",
        "Is the tree located behind the howitzer on the right side of the image?": "No",
        "Is the stone wall on the far right side of the image?": "Yes",
        "Is the howitzer resting against a wooden plank?": "Yes",
        "Is the tree located behind the howitzer?": "Yes"
    },
    "test_01968": {
        "Is the blue toy monster truck positioned towards the right side of the image?": "Yes",
        "Is the white wall with wooden border located at the top of the image?": "Yes",
        "Are the orange sports cars in front of the blue toy monster truck?": "Yes",
        "Is the monster truck positioned on top of the toy van?": "Yes",
        "Are the two orange sports cars in front of the monster truck?": "Yes"
    },
    "test_01978": {
        "Is the dome-type art structure centered in the image?": "Yes",
        "Is the metal building on the left side of the image?": "Yes",
        "Is the wood pole positioned on the right side of the image?": "Yes",
        "Is the blue light shining on the metal building on the left?": "Yes",
        "Are the electrical wires going across the sky above the dome-type structure?": "Yes"
    },
    "test_01980": {
        "Is the square sign centered where two concrete sections meet?": "Yes",
        "Is the heart located in the upper left corner of the sign?": "Yes",
        "Is the water stain located within the front tire of the bicycle drawing?": "Yes",
        "Is the sign located where two sections of concrete meet?": "Yes"
    },
    "test_02007": {
        "Is the plane centered in the image?": "Yes",
        "Is the gate with the yellow tag on the left side of the plane?": "No",
        "Are the parked planes in the background on the left side of the image?": "Yes",
        "Is the plane backing up towards the runway?": "Yes",
        "Are there trucks near the bottom left of the frame?": "Yes"
    },
    "test_02011": {
        "Is the flag positioned towards the left side of the image?": "Yes",
        "Is the white pole of the flag pointing towards the top right corner of the image?": "No",
        "Are the puffy white clouds surrounding the royal blue sky in the upper part of the image?": "Yes",
        "Is the flag attached to a pole?": "Yes",
        "Is the pole pointing towards the top left corner of the image?": "Yes"
    },
    "test_02020": {
        "Is the intersection in the center of the image?": "Yes",
        "Is the white car with a sunroof in the top right corner of the image?": "No",
        "Is the person wearing a white shirt in the top left corner of the image?": "Yes",
        "Is the white car positioned near the intersection?": "Yes",
        "Are there crosswalk markings visible on the road extending to the left?": "Yes"
    },
    "test_02027": {
        "Is the table on the left side of the couch?": "No",
        "Is the teddy bear positioned above the middle cushion of the couch?": "Yes",
        "Is the glass wall on the right side of the image behind the couch?": "Yes",
        "Is the teddy bear sitting on the couch?": "Yes",
        "Is the white table to the right of the couch?": "Yes"
    },
    "test_02029": {
        "Is the support beam with \"1010\" located on the left side of the image?": "Yes",
        "Is the concrete floor visible on the bottom of the image?": "Yes",
        "Are the metal bar support beams aligned horizontally across the image?": "Yes",
        "Are the metal bar support beams connected both horizontally and vertically?": "Yes",
        "Does the support beam with \"1010\" have a bolt next to it?": "Yes"
    },
    "test_02043": {
        "Is the black wall sconce positioned in the center of the image?": "Yes",
        "Is the gold portion of the fixture located at the top of the black portion?": "Yes",
        "Is there white trimming on both the left and right sides of the wall?": "Yes",
        "Is the thin cylindrical structure attached to the sconce?": "Yes",
        "Is the glass sphere located on the gold portion of the fixture?": "Yes"
    },
    "test_02060": {
        "Are the raccoons positioned on top of a tree trunk?": "Yes",
        "Is the algae-filled water located below the tree trunk?": "Yes",
        "Is the raccoon on the left showing only its body?": "Yes",
        "Are the raccoons sitting side by side on the tree trunk?": "Yes",
        "Are any of the tree trunk roots submerged in the water?": "Yes"
    },
    "test_02061": {
        "Is the gray tabby cat positioned in the center of the image?": "Yes",
        "Are the white cat legs with black paw pads in front of the gray tabby cat?": "Yes",
        "Is the tall brown bookshelf located in the back right corner of the room?": "Yes",
        "Is the gray tabby cat looking towards the bookshelf?": "No"
    },
    "test_02073": {
        "Is the largest leaf positioned on the right side of the plant?": "Yes",
        "Is there dark green moss growing above and towards the left of the plant?": "Yes",
        "Are the small dark gray rocky formations along the light gray section on the right side of the image?": "Yes",
        "Is the largest leaf on the right side of the plant?": "Yes",
        "Is the moss growing both to the left and right of the plant?": "Yes"
    },
    "test_02078": {
        "Is the blue \"T\" painted in the lower left part of the image?": "Yes",
        "Is the crease in the pavement running vertically to the right of the blue \"T\"?": "Yes",
        "Is the red square with the black \"x\" circle located above the blue \"T\"?": "Yes",
        "Is the red square painted above the blue \"T\"?": "Yes",
        "Does the crease run vertically to the right of the blue \"T\"?": "Yes"
    },
    "test_02079": {
        "Are the six streams of water positioned in the center of the fountain?": "Yes",
        "Is the metal black lamp with 3 lights visible on the left side of the fountain?": "Yes",
        "Is the bell tower located in the upper right corner of the image?": "Yes",
        "Are the weak streams of water shooting towards the center of the fountain?": "Yes",
        "Is the sun positioned behind the bell tower?": "Yes"
    },
    "test_02090": {
        "Is the purple conch shell sign positioned in the center of the image?": "Yes",
        "Are the brown iron posts holding the sign visible at the bottom of the shell?": "Yes",
        "Is the green wire running from the bottom of the sign positioned to the right of the stone barrier?": "No",
        "Are the iron posts supporting the conch shell sign?": "Yes",
        "Is the green wire running from the sign into the trees?": "Yes"
    },
    "test_02112": {
        "Is the drum set on the left side of the image?": "Yes",
        "Is the sousaphone located between the bass drum and the piano?": "Yes",
        "Are the frosted glass doors with the \"EXIT\" sign on the left side of the image?": "Yes",
        "Is the sousaphone positioned between the large white bass drum and the upright piano?": "Yes",
        "Are the chairs with red seat cushions placed in front of the sousaphone?": "Yes"
    },
    "test_02116": {
        "Is the tree positioned in the center of the image?": "Yes",
        "Is the black object on the right side of the tree?": "Yes",
        "Is the orange brick building located on the left side of the image?": "Yes",
        "Is the black object mostly under the shade of the tree?": "Yes",
        "Does the sidewalk curve under the tree before meeting the paved area?": "Yes"
    },
    "test_02133": {
        "Is the light gray tree trunk positioned in the center behind the staircase?": "Yes",
        "Is the patch of grass located in the bottom right corner of the image?": "Yes",
        "Are the trees with lime green leaves positioned on the left side of the staircase?": "Yes",
        "Is the black aluminum fence on the left side of the staircase?": "Yes",
        "Are the shadows of the tree branches falling on the staircase?": "Yes"
    },
    "test_02167": {
        "Is the train bridge extending from the top right corner of the image to the left side of the image?": "Yes",
        "Is there a skyscraper visible in the distance above the bridge on the right side of the image?": "No",
        "Is the wide gray cement pillar holding up the section of the bridge is below the bridge?": "Yes",
        "Is the bridge positioned above the cement pillar?": "Yes",
        "Do the streetlights illuminate the road beneath the bridge?": "Yes"
    },
    "test_02180": {
        "Is the stuffed dog positioned in the corner of the shelf?": "Yes",
        "Is the blue monkey on the wood block facing forward?": "Yes",
        "Is the red \"E\" on the right side of the wood block from the viewer's perspective?": "Yes",
        "Is the stuffed dog's head resting on the wood block?": "Yes",
        "Is the block with the \"MONKEY\" on the front located between the stuffed dog's paws?": "Yes"
    },
    "test_02181": {
        "Is the monster truck positioned on top of the steel water fountain?": "Yes",
        "Is the other water fountain higher and on the left side of the main one?": "Yes",
        "Is the shadow of a person holding their phone in the bottom left corner of the image?": "Yes",
        "Is the monster truck on top of the water fountain?": "Yes",
        "Is the shadow of the monster truck seen below it on the water fountain?": "Yes"
    },
    "test_02189": {
        "Is the tallest pull-up bar on the left side of the image?": "Yes",
        "Is the largest water puddle beneath the middle pull-up bar?": "No",
        "Is the bench located on the right side of the image?": "Yes",
        "Are the pull-up bars aligned horizontally with each other?": "Yes",
        "Is the water puddle located beneath the pull-up bars?": "Yes"
    },
    "test_02196": {
        "Are the bananas positioned in the middle of the image?": "Yes",
        "Is the shadow on the left side of the bananas?": "Yes",
        "Is the light shining from the bottom-right corner of the table?": "Yes",
        "Are the bananas placed in the center of the table?": "Yes",
        "Is the shadow of the bananas cast to the left?": "Yes"
    },
    "test_02222": {
        "Is the passionflower positioned in the center of the image?": "Yes",
        "Are the leaves on the left side of the image more illuminated by the sun compared to the right side?": "Yes",
        "Are the three yellow stigmas in the center of the flower leaning towards the top of the image?": "Yes",
        "Are the stigmas positioned above the fan-like structures?": "Yes",
        "Are the leaves on the right in the shadow?": "Yes"
    },
    "test_02224": {
        "Is the broken tree branch positioned in the center of the image?": "Yes",
        "Are the clusters of tall grass growing at the base of the tree branch?": "Yes",
        "Is the body of water in front of the swamp-like woods?": "Yes",
        "Is the broken tree branch protruding from the body of water?": "Yes",
        "Are the tall grasses growing at the base of the broken tree branch?": "Yes"
    },
    "test_02232": {
        "Is the \"EXIT\" sign positioned at the very top of the door?": "Yes",
        "Is the black arrow on the sign curved to the left?": "No",
        "Is there missing paint on the left side of the door handle?": "No",
        "Is the white directional sign attached to the door?": "Yes",
        "Is the silver door handle located below the white directional sign?": "Yes"
    },
    "test_02253": {
        "Is the large painted pole positioned in the center of the image?": "Yes",
        "Is the thick mesh fabric fence on the right side of the image?": "Yes",
        "Is the smaller pole on the left side of the large pole?": "Yes",
        "Is the chain link fence attached to the bottom of the fabric fence?": "Yes",
        "Is the cuff located at the top of the center pole above the areas where the paint is peeling?": "Yes"
    },
    "test_02254": {
        "Is the almond-shaped cave positioned at the center of the image?": "Yes",
        "Is the larger, elongated cave positioned below the almond-shaped cave?": "Yes",
        "Is there green plant life covering parts of the rock wall?": "Yes",
        "Is the almond-shaped cave located above the larger elongated cave?": "Yes",
        "Are the green and dried plants growing from the rock wall?": "Yes"
    },
    "test_02255": {
        "Is the illuminated green sign directly above the elevator door?": "Yes",
        "Is the square device with a silver plate located on the right side of the elevator door?": "Yes",
        "Is the black square object positioned on the left side of the elevator's door frame?": "Yes",
        "Is the reflection of another elevator visible on the golden door?": "Yes",
        "Is the silver plate located above the square device on the right side of the elevator?": "Yes"
    },
    "test_02279": {
        "Are the letters \"A E / C L R\" spray-painted in the middle of the slanted slab?": "Yes",
        "Is the concrete sidewalk above the slanted slab?": "Yes",
        "Are there patches of grass on both the left and right sides of the slanted slab?": "Yes",
        "Is the slanted rectangular slab of concrete adjacent to the sidewalk?": "Yes",
        "Are the patches of green grass located on both sides of the slanted slab?": "Yes"
    },
    "test_02284": {
        "Is the brown ceramic vase positioned in the lower half of the image?": "Yes",
        "Is the gray cement sidewalk located above the brown ceramic vase in the image?": "Yes",
        "Are the black marks spray painted on the left side of the image?": "Yes",
        "Is the metal post sticking out of the dirt in the vase?": "Yes",
        "Is the pebble surface located below the cement sidewalk?": "Yes"
    },
    "test_02294": {
        "Is the Star of Texas positioned between the two metal rods?": "Yes",
        "Is the ivory wall on the left side of the image?": "Yes",
        "Is the red brick wall on the right side of the image?": "Yes",
        "Is the Star of Texas attached to both metal rods?": "Yes",
        "Does the wall have two different colors separated vertically?": "Yes"
    },
    "test_02321": {
        "Is the wagon facing the bottom right corner of the image?": "Yes",
        "Are the back wheels of the wagon bigger than the front wheels?": "Yes",
        "Is the dummy sitting at the front of the wagon holding the reins?": "Yes",
        "Are the back wheels of the wagon placed on planks?": "Yes",
        "Is the dummy holding the reins of the wagon?": "Yes"
    },
    "test_02323": {
        "Is the top of the head positioned towards the left side of the image?": "Yes",
        "Is there a gap in the sunglasses on the right side of the image?": "Yes",
        "Is the chin closer to the bottom edge of the image than the top of the head is to the top edge?": "Yes",
        "Is there a gap between the top of the impression and the top edge of the wall?": "Yes",
        "Are the plastic cylinders pressed in except for the face impression?": "Yes"
    },
    "test_02334": {
        "Are the letters \"PELOTA\" positioned at the bottom of the image?": "Yes",
        "Is the word \"DEFIANCE\" located within the blue shape on the right side of the wall?": "Yes",
        "Are the multi-colored metal objects positioned above the brick wall?": "Yes",
        "Are the black letters on the overhanging roof in front of the multicolored spray paint on the wall?": "Yes",
        "Is the metal railing positioned above the brick wall?": "Yes"
    },
    "test_02341": {
        "Is the thumb positioned to the right of the image?": "Yes",
        "Is the chair centered against the white wall?": "Yes",
        "Are the gray smudges located at the base of the palm?": "Yes",
        "Is the chair resting on the tiled floor?": "Yes",
        "Is the chair positioned in front of the white wall?": "Yes"
    },
    "test_02347": {
        "Is the rainbow-painted slated structure on the right side of the image?": "Yes",
        "Is the silhouette of a person and dog facing towards the left of the image?": "Yes",
        "Is the half-moon shaped black plexiglass located below the silhouettes?": "Yes",
        "Is the silhouette of the person positioned on the plexiglass?": "Yes",
        "Does the slated structure meet the corrugated roof?": "Yes"
    },
    "test_02354": {
        "Is the mammoth fossil positioned facing the left side of the image?": "Yes",
        "Is the prehistoric map graphic on the left side of the mammoth?": "Yes",
        "Are the small black projector lights located on the ceiling?": "Yes",
        "Is the mammoth facing towards the prehistoric map?": "Yes",
        "Are the projector lights positioned above the mammoth fossil?": "Yes"
    },
    "test_02359": {
        "Is the skull positioned to the right of the table in the image?": "Yes",
        "Are the pages showing the wolf and mammoth on the wooden trim above the skull?": "Yes",
        "Is the other animal bone partially cut off from the left side of the image?": "Yes",
        "Is the skull positioned on the same surface as the small dark scratches?": "Yes",
        "Are the pages on animals set higher than the skull?": "Yes"
    },
    "test_02362": {
        "Are the tips of the jousting lances pointing towards the lower right of the image?": "Yes",
        "Is the square wooden pole located to the left of the lances?": "No",
        "Are the two red wooden square poles positioned near the top left of the image?": "Yes",
        "Are the lances positioned with their tips pointing towards the square wooden pole?": "No",
        "Is the shadow on the ground to the left of the red wooden poles?": "Yes"
    },
    "test_02374": {
        "Is the yellow post in front of the green turf?": "Yes",
        "Is the mini golf putter to the left of the yellow post?": "Yes",
        "Are the purple, pink, and white stripes on the concrete wall on the left side of the image?": "Yes",
        "Is the mini golf putter laying on the ground next to the yellow post?": "Yes",
        "Does the short concrete wall connect to the green turf area?": "Yes"
    },
    "test_02385": {
        "Are the light purple flowers positioned in the middle front of the image?": "Yes",
        "Are the large green leaves located on the far left side of the image?": "Yes",
        "Are the bright yellow flowers surrounding the light purple flowers?": "Yes",
        "Are the tall flowers surrounding the small group of light purple flowers?": "Yes",
        "Is the group of large green leaves located separately from the purple flowers?": "Yes"
    },
    "test_02391": {
        "Is the black vulture positioned on the right side of the image?": "Yes",
        "Are there faint cirrus clouds on the right side of the image?": "Yes",
        "Is the tallest tree on the left side of the image?": "Yes",
        "Is the vulture flying above the roof?": "Yes",
        "Are the clouds located on the right side of the image?": "Yes"
    },
    "test_02393": {
        "Is the traffic jam visible in the rear-view mirror?": "Yes",
        "Is there grass visible past the mirror on the right side of the image?": "Yes",
        "Is the gray cement wall located on the left side of the image?": "Yes",
        "Are the cars lined up on the road in the mirror moving in a curve?": "Yes",
        "Is the cement wall on the left positioned between the road and the grass?": "Yes"
    },
    "test_02400": {
        "Is the manhole cover in the center of the image?": "Yes",
        "Is the black spray-painted rectangle with white text \"VMX\" above the middle of the concrete base?": "No",
        "Are the rocks and dirt positioned on the left side of the concrete base in the image?": "Yes",
        "Is the manhole cover positioned on top of the concrete base?": "Yes",
        "Are the rocks surrounding the concrete base arranged randomly?": "Yes"
    },
    "test_02406": {
        "Is the Texas flag on the right side of the image?": "Yes",
        "Is the American flag further from the vantage point compared to the Texas flag?": "Yes",
        "Are the treetops visible along the bottom half of the image?": "Yes",
        "Is the Texas flag on the right side of the American flag?": "Yes",
        "Are both flags attached to black flagpoles?": "Yes"
    },
    "test_02413": {
        "Is the drawing positioned directly above the sink?": "Yes",
        "Is the black soap dispenser to the right of the drawing?": "Yes",
        "Is the faucet made of brushed nickel located above the cabinet?": "Yes",
        "Is the drawing located above the sink?": "Yes",
        "Is the soap dispenser attached to the wall next to the drawing?": "Yes"
    },
    "test_02419": {
        "Is the brick building positioned in the center of the image?": "Yes",
        "Is the Chevrolet Tahoe parked on the left side of the image?": "No",
        "Is the \"KLOBS\" sign to the left of the brick building?": "No",
        "Is the blue sign with the text \"KLOBS\" vertically aligned next to the central brick building?": "Yes",
        "Is the Chevrolet Tahoe parked in front of the brick layered walkway?": "Yes"
    },
    "test_02443": {
        "Is the end of the airplane engine on the right side of the image?": "Yes",
        "Are there roads and houses in a grid-like pattern at the bottom of the image?": "Yes",
        "Are the large number of circular farm fields located at the top of the image?": "Yes",
        "Are the roads and houses located below the circular farm fields near the middle of the image?": "Yes",
        "Is the engine of the plane positioned to the right of the circular farm fields in the image?": "Yes"
    },
    "test_02448": {
        "Is the painting directly above the electrical socket?": "Yes",
        "Are the benches positioned symmetrically on either side of the electrical socket?": "Yes",
        "Is the white tag located to the bottom right of the painting?": "Yes",
        "Is the electrical socket between the two benches on the wall?": "Yes",
        "Is the painting casting a shadow onto the wall?": "Yes"
    },
    "test_02471": {
        "Is the arrow pointing to the left positioned below the windows?": "Yes",
        "Is the crack on the sidewalk located on the left side of the image?": "Yes",
        "Are the window frames painted white and visible above the sign?": "Yes",
        "Is the arrow sign located beneath the windows?": "Yes",
        "Is the crack in the sidewalk on the same side as the arrow's direction?": "No"
    },
    "test_02472": {
        "Are the tall grassy weeds to the left of the ducks in the image?": "Yes",
        "Is the shadow of the trees covering the entire group of ducks?": "No",
        "Is the duck looking onto the water positioned at the back of the group?": "Yes",
        "Are two ducks pecking at their backs in different positions within the group?": "Yes",
        "Is the shadow of the trees covering part of the grass and two ducks?": "Yes"
    },
    "test_02486": {
        "Is the word \"FLIP\" positioned at the top center of the image?": "Yes",
        "Is the word \"WHEN\" directly below the word \"DOT\"?": "Yes",
        "Is the reflection of light on the top right portion of the wooden surface?": "No",
        "Are the words \"FROZE\" and \"DOT\" connected by a common letter block?": "Yes",
        "Does the word \"WHEN\" intersect with the word \"HACK\"?": "No"
    },
    "test_02487": {
        "Is the numeral two positioned in the center of the image?": "Yes",
        "Is the gold-green triangle located in the top left corner of the image?": "Yes",
        "Does the blue in the background become darker toward the right edge of the frame?": "Yes",
        "Are the two lines of the numeral connected to each other?": "No",
        "Is the gold-green triangle touching the numeral two?": "No"
    },
    "test_02491": {
        "Is the skull positioned in the center of the image?": "Yes",
        "Is the green light on the left side of the image?": "Yes",
        "Is the power cord visible at the top of the image?": "Yes",
        "Is the power cord positioned above the plastered skull?": "Yes",
        "Is there an unidentifiable object partially seen to the left of the skull?": "Yes"
    },
    "test_02498": {
        "Is the white \"No Parking\" sign attached to a pole in the center of the image?": "Yes",
        "Is the black light pole positioned to the left of the metal holed pole?": "Yes",
        "Are the trash cans lined up on the right side of the brown wooden fence?": "Yes",
        "Is the white \"No Parking\" sign attached to the metal pole?": "Yes",
        "Are the trash cans lined up against the brown wooden fence?": "Yes"
    },
    "test_02505": {
        "Is the top card a club positioned at the top of the image?": "Yes",
        "Is the diamond card positioned below the club card?": "Yes",
        "Is the spade card positioned below the diamond card?": "Yes",
        "Are the cards arranged in a straight line?": "Yes",
        "Is the bottom card directly below the middle card?": "Yes"
    },
    "test_02508": {
        "Is the blue recycling can on the left side of the image?": "Yes",
        "Is the water tower positioned above the row of tree tops?": "Yes",
        "Is the crane extending from the right side of the image?": "Yes",
        "Does the construction crane extend behind the water tower?": "Yes"
    },
    "test_02519": {
        "Is the \"U\" shaped rooftop located in the bottom left corner of the image?": "Yes",
        "Is the bridge positioned to the left of the \"U\" shaped rooftop?": "Yes",
        "Are there high-rise buildings located across the river?": "Yes",
        "Is the bridge crossing over the river located to the left of the rooftop?": "Yes",
        "Are there trees hugging both sides of the river?": "Yes"
    },
    "test_02530": {
        "Is the turtle positioned on the right side of the image?": "Yes",
        "Is the cement curb behind the turtle?": "Yes",
        "Are there leaves scattered across the dirt surface?": "Yes",
        "Is the turtle in contact with the dirt surface?": "Yes",
        "Is the pile of leaves adjacent to the cement curb?": "Yes"
    },
    "test_02532": {
        "Are the tops of palm trees visible across the bottom of the image?": "Yes",
        "Is the \"LINCOLN\" sign located in the bottom left of the image?": "Yes",
        "Are clouds reflected in the glass panels on the left and right sides of the building?": "Yes",
        "Are the palm trees in front of the office building?": "Yes",
        "Is the \"LINCOLN\" sign located to the left of the office building?": "Yes"
    },
    "test_02533": {
        "Is the Yield sign in the foreground of the image?": "Yes",
        "Are the tree trunks on the right side of the image?": "Yes",
        "Is the sidewalk attached to the sidewalk behind the Yield sign located on the left side of the image?": "Yes",
        "Is the \"YIELD\" sign attached to a short metal pole that is stuck in the ground?": "Yes",
        "Is there dirt and dried leaves both in front of and behind the \"YIELD\" sign?": "Yes"
    },
    "test_02537": {
        "Is the large white pumpkin positioned in the center of the image?": "Yes",
        "Is the stem of the large white pumpkin pointing towards the left edge of the image?": "Yes",
        "Is the large orange pumpkin located in the top left corner of the image?": "Yes",
        "Is the large white pumpkin holding its own stem?": "Yes",
        "Is the pile of shavings located on the same pallet as the carved pumpkin?": "Yes"
    },
    "test_02541": {
        "Is the horse positioned in the center of the image?": "Yes",
        "Is the dirt road on the left side of the horse?": "No",
        "Are the trees behind the green field?": "Yes",
        "Is the horse walking parallel to the dirt road?": "Yes",
        "Is the tree line located behind the grassy field where the horse is walking?": "Yes"
    },
    "test_02551": {
        "Are the Texas Betony plants primarily located in the foreground of the image?": "Yes",
        "Are the tree trunks located in the top right corner of the image?": "Yes",
        "Do the Betony plant stems stretch from the bottom left corner to the top right of the image?": "Yes",
        "Do the Texas Betony stems stretch from the bottom left to the top right of the frame?": "Yes",
        "Are tree trunks partially visible in the top right corner of the image?": "Yes"
    },
    "test_02555": {
        "Is the walking path located on the left side of the image?": "Yes",
        "Are the buildings visible in the distance on the right side of the image?": "Yes",
        "Is the metal guardrail positioned between the water and the walking path?": "Yes",
        "Does the tree on the left reach over the path to nearly touch the tree on the right?": "Yes",
        "Are the buildings reflected in the water visible behind the guardrail?": "Yes"
    },
    "test_02582": {
        "Is the shoe print located in the center of the pile of wooden shavings?": "Yes",
        "Is the yellow cable positioned above the shoe print?": "Yes",
        "Is the red cable visible in the top left corner of the image?": "Yes",
        "Is the black cable in front of the shoe print?": "Yes",
        "Is the yellow cable above the shoe print?": "Yes"
    },
    "test_02602": {
        "Is the sign positioned in the center of the image?": "Yes",
        "Are the bright green leaves visible in the bottom right corner of the image?": "Yes",
        "Is the lake visible to the left of the sign in the image?": "Yes",
        "Is the sign attached to a metal pole?": "Yes",
        "Are the bright green trees behind the lake?": "Yes"
    },
    "test_02610": {
        "Is the brown leather chair positioned centrally in front of the brown wooden wall?": "Yes",
        "Is the LED sign with yellow and red colors located on the upper left side of the chair?": "Yes",
        "Does the shadow of the chair fall on the right side?": "Yes",
        "Is the chair directly in front of the wooden wall?": "Yes",
        "Does the wire lead behind the chair?": "Yes"
    },
    "test_02611": {
        "Is the blue sofa on the right side of the vase?": "Yes",
        "Is the pillar to the left of the vase?": "Yes",
        "Are the electrical light switches on the right side of the image?": "Yes",
        "Is the vase to the left of the sofa?": "Yes",
        "Are the light switches to the right of the sofa?": "Yes"
    },
    "test_02615": {
        "Is the stone pillar positioned in the center of the image?": "Yes",
        "Are the banners stretching from the left to the right side of the image?": "Yes",
        "Is the fake tree located behind the stone pillar?": "Yes",
        "Is the stone pillar positioned in the center of the banner?": "Yes",
        "Is the fake lit up tree placed above the stone pillar?": "Yes"
    },
    "test_02639": {
        "Is the raccoon on the left facing the left side of the image?": "Yes",
        "Is the raccoon on the right partially blocked by the tree from view?": "Yes",
        "Are the tree roots visible at the bottom of the image?": "Yes",
        "Is the raccoon on the left standing on higher roots than the raccoon on the right?": "Yes",
        "Is the raccoon on the right partially blocked from view by the tree?": "Yes"
    },
    "test_02644": {
        "Is the 'D' sign positioned in the center of the image?": "Yes",
        "Is the black bubble camera on the right side of the pole?": "Yes",
        "Is the small gray power box on the left side of the pole?": "Yes",
        "Is the 'D' sign attached to the same pole as the camera and power box?": "Yes",
        "Are the metal rings holding both the camera and the power box?": "Yes"
    },
    "test_02661": {
        "Is the vase to the left of the leopard sculpture's head?": "Yes",
        "Is the closed book on the left side of the view near the sculpture?": "No",
        "Is there a wooden ledge above the leopard sculpture's back?": "Yes",
        "Is the sculpture positioned between the pot or vase and the closed book?": "Yes",
        "Is the ledge or table above the sculpture held up by a metal frame?": "Yes"
    },
    "test_02685": {
        "Is the solar panel on top of the black street pole?": "Yes",
        "Is the mailbox positioned to the left of the black street pole?": "Yes",
        "Is the walkway to the right of the black street pole?": "Yes",
        "Is the solar panel positioned above all the traffic signs?": "Yes",
        "Is the mailbox to the left of the black street pole?": "Yes"
    },
    "test_02695": {
        "Is the green street pole positioned near the center of the image?": "Yes",
        "Is the \"WELCOME TO NEW ORLEANS\" sign located at the bottom right of the image?": "Yes",
        "Is the traffic light with the yellow signal on the left side of the green street pole?": "Yes",
        "Is the street pole positioned at the corner of St. Charles Street?": "Yes",
        "Does the traffic light's mast arm extend above the street?": "Yes"
    },
    "test_02713": {
        "Is the brown soil visible on the right side of the garden bed?": "Yes",
        "Are the leafless bushes positioned behind the colorful flowers in the garden bed?": "Yes",
        "Are the stone ledges located in the upper right corner of the image behind the tree?": "Yes",
        "Are the leafless bushes behind the garden bed?": "Yes",
        "Is the concrete pathway beside the garden bed on the right?": "Yes"
    },
    "test_02716": {
        "Is the small white sign positioned in front of the tree trunk?": "Yes",
        "Are the dried tall grasses located on both the right and left sides of the image?": "Yes",
        "Are the small branches from a tree visible on the left side of the image?": "Yes",
        "Is the sign placed in front of the tree trunk?": "Yes",
        "Are there large dried leaves surrounding the tree trunk?": "Yes"
    },
    "test_02721": {
        "Are the green leaves positioned in front of the raccoon?": "Yes",
        "Is the raccoon standing on a log that is partly submerged in the water?": "Yes",
        "Is the sunlight visible on the right side of the water?": "Yes",
        "Are the leaves partially blocking the view of the raccoon?": "Yes"
    },
    "test_02723": {
        "Is the magnifying glass positioned in the center of the image?": "Yes",
        "Is the pink leash on the left side of the image?": "No",
        "Is the light shining on the wood floor behind the dog on the right side of the image?": "Yes",
        "Is the magnifying glass positioned in front of the dog's nose?": "Yes",
        "Is the pink leash wrapped around the bottom of a chair leg?": "Yes"
    },
    "test_02726": {
        "Is the large wind chime positioned on the left side of the image?": "Yes",
        "Is the sculpted rooster at the top of the wind chime?": "Yes",
        "Is the clapper at the bottom of the image?": "Yes",
        "Is the clapper hanging below the metal cylinders?": "Yes"
    },
    "test_02746": {
        "Is the butterfly in the back right fully atop its purple flower?": "Yes",
        "Are there more green and purple flowers to the back right of the butterflies?": "Yes",
        "Is the butterfly in the front left positioned as if it is climbing the green stem?": "Yes",
        "Are both butterflies standing on purple flowers?": "Yes",
        "Is the butterfly in the front left positioned lower on the plant than the butterfly in the back right?": "Yes"
    },
    "test_02753": {
        "Is the liquor sign positioned in the bottom right corner of the frame?": "Yes",
        "Is the parking lot light post on the left half of the frame?": "Yes",
        "Are the green trees located at the bottom quarter portion of the frame?": "Yes",
        "Is the liquor sign positioned to the right of the light post?": "Yes",
        "Are the trees positioned behind both the light post and the liquor sign?": "Yes"
    },
    "test_02759": {
        "Is the large tree positioned in the center of the image?": "Yes",
        "Are the thin white electrical cables on the left side of the tree?": "Yes",
        "Are the larger branches on the right side of the tree closer to the ground?": "Yes",
        "Are the electrical cables to the left of the large tree?": "Yes",
        "Do the large branches on the right side of the tree reach closer to the ground than the smaller branches on the left side?": "Yes"
    },
    "test_02768": {
        "Is the garden bed with three leafy plants located behind the one with two small green plants?": "Yes",
        "Is the house with the plain wood-sided garden bed on the left side of the image?": "Yes",
        "Are the small, smooth, tan rocks surrounding the raised garden beds?": "Yes",
        "Are there more leafy green plants in the garden bed behind compared to the one on the left?": "Yes",
        "Is the raised garden bed with plain wood sides located across the street?": "Yes"
    },
    "test_02774": {
        "Is the fountain on the left side of the image?": "Yes",
        "Does the wall extend to the top right corner of the image?": "Yes",
        "Is the tree visible behind the wall?": "Yes",
        "Is the fountain built into the stone wall?": "Yes",
        "Is the tree located behind the wall?": "Yes"
    },
    "test_02778": {
        "Is the cricket facing the right side of the image?": "Yes",
        "Is there a patch of soil to the right of the cricket?": "Yes",
        "Are shadows visible under the grass in the top left of the image?": "Yes",
        "Is the cricket facing away from the patch of soil?": "Yes",
        "Are the shadows positioned to the left of the cricket?": "Yes"
    },
    "test_02791": {
        "Is the blue truck visible through the doorway on the far side of the hallway?": "Yes",
        "Are the horizontal wooden planks located on both the left and right sides of the closer doorway?": "Yes",
        "Are the wooden beams on the ceiling running vertically relative to the image?": "Yes",
        "Are the wooden planks on the left side of the first doorway aligned horizontally with the planks on the left side of the other doorway?": "Yes",
        "Is the blue truck visible through the second doorway, beyond the hallway?": "Yes"
    },
    "test_02800": {
        "Is the red trolley positioned in the center of the image?": "Yes",
        "Is the blue \"Canal\" sign located above the trolley on the right side of the image?": "Yes",
        "Are the two tall buildings positioned behind the red trolley on the left side of the image?": "No",
        "Is the red trolley in front of the tall buildings?": "Yes",
        "Is the blue sign on the same side of the trolley as the orange sign?": "Yes"
    },
    "test_02808": {
        "Are the salmon slabs in the center bottom of the freezer box?": "Yes",
        "Are the catfish filets on the right of the salmon?": "Yes",
        "Is the long narrow grate in front of the fish?": "Yes",
        "Are the salmon and catfish filets separated by other types of fish?": "No",
        "Is the grate in front of all the types of fish filets?": "Yes"
    },
    "test_02811": {
        "Is the broken wooden stick located at the bottom edge of the image?": "Yes",
        "Is the green floor visible on the right side of the bench?": "Yes",
        "Are the rusted bolts on the bench drilled into its surface?": "Yes",
        "Is the rusted chain link in front of the wooden bench?": "Yes",
        "Is the broken wooden stick under the bench?": "Yes"
    },
    "test_02835": {
        "Is the ceiling fan positioned in the center of the ceiling?": "Yes",
        "Are the glass panels shaped like trapezoids located behind the ceiling fan?": "Yes",
        "Are the two larger glass panels positioned in the center between the smaller ones?": "Yes",
        "Are the fan blades attached to the larger circle?": "Yes",
        "Are the glass panels positioned behind the ceiling fan?": "Yes"
    },
    "test_02840": {
        "Are the safety cones angled from the right forefront to the top left background in the image?": "Yes",
        "Is the chain link fence located to the left of the curb?": "No",
        "Are the cones aligned to create a lane preventing curbside parking?": "Yes",
        "Are the safety cones aligned parallel to the chain link fence?": "Yes",
        "Do the safety cones create a lane that prevents parking next to the curb?": "Yes"
    },
    "test_02854": {
        "Is the blue trashcan on the leftmost side of the image?": "Yes",
        "Is the Yucca plant directly behind the silver trashcan?": "No",
        "Is the split-trunk tree to the right of the trashcans?": "Yes",
        "Is the Yucca plant directly behind the green trashcan?": "Yes",
        "Is the tree with a slight s-curve to the trunk located to the left of the blue trashcan?": "Yes"
    },
    "test_02862": {
        "Is the word \"JIGSAW\" located at the top of the image?": "Yes",
        "Are the black and white hands pointed downwards and slightly to the left?": "Yes",
        "Is the word \"PUZZLES\" below the word \"JIGSAW\" on the cardboard?": "Yes",
        "Are the hands attached to the bottom of the cardboard sign?": "Yes",
        "Is the word \"Jigsaw\" positioned above the word \"Puzzles\"?": "Yes"
    },
    "test_02868": {
        "Is the heart shape in the center of the \"I\" and Pi symbol?": "Yes",
        "Is the crack in the concrete running between the heart and the Pi symbol?": "Yes",
        "Is the horizontal line embedded into the concrete positioned above the chalk writing?": "Yes",
        "Is the heart shape positioned between the \"I\" and the Pi symbol?": "Yes",
        "Does the crack in the concrete run between the heart and Pi symbol?": "Yes"
    },
    "test_02888": {
        "Is the cat facing to the right side of the image?": "Yes",
        "Is the light reflection on the wood floor above the white paw?": "Yes",
        "Is the cat's tail sticking out to the left side?": "No",
        "Is the cat's head turned toward the light reflection?": "Yes",
        "Is the light reflection closer to the cat's front paw than its hind legs?": "Yes"
    },
    "test_02897": {
        "Is the text \"BOOKS\" placed above the illustration of a book?": "Yes",
        "Is the shadow extending horizontally across the bottom half of the image?": "Yes",
        "Is the word \"DEVOLVER\" written below the black line?": "Yes",
        "Is there a shadow cast over the top portion of the sign?": "Yes",
        "Does the shadow extend horizontally at any point in the image?": "Yes"
    },
    "test_02900": {
        "Is the green field visible behind the long grass plants on the dashboard screen?": "Yes",
        "Is the silver car depicted on the right side of the dashboard screen?": "Yes",
        "Is the red hazard button located between the two black air conditioning vents?": "Yes",
        "Are the grass plants displayed on the dashboard screen in front of the houses?": "Yes",
        "Is the red hazard button located between the two air conditioning vents?": "Yes"
    },
    "test_02910": {
        "Is the metal board attached to the wooden fence?": "Yes",
        "Are the leafy tree limbs above the fence?": "Yes",
        "Is the teal fabric visible above the right side of the fence?": "Yes",
        "Are the tree limbs positioned above the fence?": "Yes"
    },
    "test_02941": {
        "Are the clouds positioned mostly in the upper part of the image?": "Yes",
        "Is the Hudson River visible on the left side of the city skyline?": "Yes",
        "Do the shadows of the tall buildings fall towards the right?": "Yes",
        "Are the shadows of the tall buildings cast toward the right in relation to the clouds?": "Yes",
        "Is the Hudson River positioned behind the city skyline?": "Yes"
    },
    "test_02955": {
        "Is the car positioned on the left side of the image?": "No",
        "Is the yellow building located behind the car?": "Yes",
        "Is the reflective window on the right side of the car?": "Yes",
        "Is the car parked on the grassland next to the cement trimming?": "Yes",
        "Is the large tree visible in the reflection of the window?": "Yes"
    },
    "test_02964": {
        "Is the skeleton positioned across the grille of the bus?": "Yes",
        "Is the string of lights on the left side of the bus?": "No",
        "Is the white tent to the left of the bus?": "Yes",
        "Is the skeleton lying across the grille of the bus?": "Yes"
    },
    "test_02968": {
        "Is the orange hat on top of the skeleton's head?": "Yes",
        "Is the chair with a gray cushion on the left side of the skeleton?": "No",
        "Are the green plants located to the left of the skeleton?": "Yes",
        "Is the skeleton seated to the left of the chair?": "No",
        "Are the wooden logs located behind the green plants?": "Yes"
    },
    "test_02973": {
        "Is the Jesus figure sitting in the center of the image?": "Yes",
        "Is the large bird figure located to the right of the throne?": "Yes",
        "Are the six-point stars located above the head of the Jesus figure?": "Yes",
        "Is the large bird figure standing to the right of the throne with its wings following the shape of the throne?": "Yes",
        "Are six-point stars lining the upper part of the throne?": "Yes"
    },
    "test_02975": {
        "Is the wide portion of the glass building on the left side of the image?": "Yes",
        "Is the tall, thin part of the building on the right side of the image?": "Yes",
        "Are there two tiny clouds on the left side of the large dark gray cloud?": "Yes",
        "Is the rectangular building mostly in front of the wide section of the glass building?": "Yes",
        "Are the tiny clouds located to the left of the vertical cloud?": "Yes"
    },
    "test_02976": {
        "Is the excavator facing the right side of the image?": "Yes",
        "Are the boulders positioned in front of the excavator's bucket?": "Yes",
        "Is the sky mostly filled with clouds above the excavator?": "Yes",
        "Is the bucket of the excavator resting on the ground?": "Yes",
        "Is the pile of white boulders in front of the excavator's bucket?": "Yes"
    },
    "test_03014": {
        "Is the metal cube placed on top of the stack of bricks?": "Yes",
        "Are the bricks casting a shadow to the back left side?": "Yes",
        "Is the second brick from the bottom slightly diagonal?": "Yes",
        "Is the metal cube resting directly on the top brick?": "Yes",
        "Do the diagonal bricks cast a shadow on the bricks below them?": "Yes"
    },
    "test_03016": {
        "Is the caterpillar positioned in the center of the image?": "No",
        "Is the left end of the caterpillar facing the bottom left corner of the image?": "Yes",
        "Is the cement surface surrounding the caterpillar on all sides?": "Yes",
        "Is the caterpillar positioned on the cement surface?": "Yes"
    },
    "test_03047": {
        "Is the cat positioned on the left side of the bath mat?": "Yes",
        "Are the metal clothespins on the left and right sides of the dresser?": "Yes",
        "Is the light hitting the upper half of the bath mat?": "No",
        "Is the bath mat held in place by clothespins?": "Yes",
        "Is the cat lying on top of the bath mat on the dresser?": "Yes"
    },
    "test_03050": {
        "Is the carved wood object positioned at the center of the image?": "Yes",
        "Is the text seen to the left of the carved wood object?": "Yes",
        "Is the shadow cast by the carved wood object on its left side?": "Yes",
        "Is the wooden plate hanging on the wall?": "Yes",
        "Is the light source to the right of the carved object?": "Yes"
    },
    "test_03061": {
        "Is the window with black frames located in the bottom right corner of the image?": "Yes",
        "Are the three white buttons positioned at the top of the sign above the coiled thread?": "Yes",
        "Is the red tile roof located on the right side of the image in the background?": "Yes",
        "Is the coiled cylinder of threads located below the white buttons on the sign?": "Yes",
        "Is the sign attached beside the red tile roof?": "Yes"
    },
    "test_03065": {
        "Is the balloon positioned in the center of the image?": "Yes",
        "Is the blue light shining on the floor below the balloon?": "Yes",
        "Is there a black cabinet above the baseboard directly behind the balloon?": "Yes",
        "Is the balloon placed directly on the wooden surface?": "Yes",
        "Is the blue light from the balloon shining on the baseboard behind it?": "Yes"
    },
    "test_03070": {
        "Is the tree trunk in the top right quadrant of the image?": "Yes",
        "Is the swing facing the bottom left corner of the image?": "Yes",
        "Are there areas of pooled water on the grass surface?": "Yes",
        "Is the swing attached to the tree?": "Yes",
        "Is the tree trunk visible near the swing?": "Yes"
    },
    "test_03090": {
        "Is the bridge positioned in the center of the image?": "Yes",
        "Is the tan building on the left side of the image?": "Yes",
        "Are the cranes located behind the bridge in the distance?": "Yes",
        "Does the bridge cross over both roads?": "Yes",
        "Are there buildings on both sides of the street below the bridge?": "Yes"
    },
    "test_03097": {
        "Is the brown bookshelf to the left of the canvases?": "Yes",
        "Is the window with the tree visible through the panes to the right of the canvases?": "Yes",
        "Is the cream window curtain below the top of the window frame?": "Yes",
        "Is the bookshelf located to the left of the canvases?": "Yes",
        "Is the window located to the right of the canvases?": "Yes"
    },
    "test_03099": {
        "Is the bench positioned in front of the two large windows?": "Yes",
        "Is the big red flower pot on the left side of the bench?": "No",
        "Are the Christmas lights surrounding the windows yellow?": "Yes",
        "Are the Christmas lights surrounding the windows?": "Yes",
        "Is there a flower pot on the right side of the bench?": "Yes"
    },
    "test_03116": {
        "Is the blue recycling bin on the right side of the image?": "Yes",
        "Is the brown landfill bin positioned to the left of the blue recycling bin?": "Yes",
        "Are both bins located on a concrete surface near grass?": "Yes",
        "Are the words on both bins positioned vertically down the bins?": "Yes",
        "Is the blue bin located to the right of the brown bin?": "Yes"
    },
    "test_03119": {
        "Is the roadway positioned from the bottom left to the top right of the image?": "Yes",
        "Are the trees located near the point where the roadway splits?": "Yes",
        "Are most of the cars primarily gathered near the bottom left corner?": "Yes",
        "Is there a road splitting off to the left side of the main roadway?": "Yes",
        "Are the reversed images of the bridge visible on the water surface?": "Yes"
    },
    "test_03126": {
        "Is the fountain positioned in the center of the image?": "Yes",
        "Is the gray building with pillars on the left side of the image?": "No",
        "Is the statue to the right of the stairs?": "Yes",
        "Is the statue on the right side of the stairs?": "Yes",
        "Is the gate located directly behind the fountain?": "Yes"
    },
    "test_03134": {
        "Is the corn cob positioned in the center of the image?": "Yes",
        "Is the top of the cob pointing toward the top left corner?": "Yes",
        "Is the dried sprig of weeds in the bottom right corner of the image?": "Yes",
        "Is the corn cob positioned centrally within the cracked dirt area?": "Yes",
        "Does the husk spread out in multiple directions around the corn cob?": "Yes"
    },
    "test_03157": {
        "Are the two metal sign boards positioned next to each other in the center of the image?": "No",
        "Is the pile of blue and pink tubs located at the top right of the rightmost sign?": "Yes",
        "Is the grass trail located at the bottom of the image?": "Yes",
        "Are the two sign boards positioned next to each other?": "Yes",
        "Is the pile of blue and pink tubs located near the rightmost sign?": "Yes"
    },
    "test_03181": {
        "Is the writing centered in the image?": "Yes",
        "Are the black and red spray paint lines located on the right side of the image?": "Yes",
        "Is the small white pipe on the bottom left of the image?": "Yes",
        "Is the writing positioned in the middle of the wall?": "Yes",
        "Are the spray paint lines to the right of the writing?": "Yes"
    },
    "test_03201": {
        "Is the small puddle located to the upper left of the electric symbol?": "Yes",
        "Is the larger piece of mulch positioned to the right of the symbol?": "Yes",
        "Are the faded tire marks located to the right of the symbol?": "Yes",
        "Is the small piece of mulch next to the symbol on the left side?": "Yes",
        "Do the tire marks appear to be originating from the symbol?": "Yes"
    },
    "test_03206": {
        "Is the base of the feather on the left side of the image?": "Yes",
        "Are the plants supporting the feather mostly horizontal in orientation?": "Yes",
        "Is the tip of the feather on the right side of the image?": "Yes",
        "Is the feather resting on top of the plants?": "Yes",
        "Are the plants casting shadows on the ground?": "Yes"
    },
    "test_03219": {
        "Is the fire hydrant positioned near the center of the image?": "Yes",
        "Is the rusted-out circle with the word \"WATER\" in front of the hydrant?": "Yes",
        "Is the dark green grass field located behind the fire hydrant?": "Yes",
        "Is the rusted-out circle in front of the fire hydrant?": "Yes",
        "Is the dark green grass field behind the fire hydrant?": "Yes"
    },
    "test_03220": {
        "Is the word \"ART\" positioned in the top right corner of the sign?": "Yes",
        "Is the bird facing the left side of the image?": "No",
        "Is the white post and frame visible in the bottom left corner of the image?": "Yes",
        "Is the bird facing the same direction as the neon lights behind it?": "Yes",
        "Are the white and blue lights illuminating separate halves of the sign?": "Yes"
    },
    "test_03232": {
        "Are the treetops covering the entire bottom half of the image?": "Yes",
        "Is the large gray cement tower on the left side of the image?": "No",
        "Is there a small cirrus cloud visible at the very top of the image?": "Yes",
        "Are the treetops in front of the nearest cement tower?": "Yes",
        "Is the cupola structure on top of the building further away from view?": "Yes"
    },
    "test_03243": {
        "Is the gourd positioned in the center of the image?": "Yes",
        "Is the stain on the wooden surface on the right side of the image?": "Yes",
        "Is the light shining on the top part of the wooden surface?": "Yes",
        "Is the gourd positioned directly on the wooden surface?": "Yes",
        "Is the light shining on the same side as the stain cut off?": "No"
    },
    "test_03267": {
        "Is the word \"AVO\" on the building located on the left side of the image?": "Yes",
        "Are the small white string lights positioned in front of the black building?": "Yes",
        "Is the dark brown building to the left of the black building?": "No",
        "Are the electrical wires running between the two buildings?": "Yes",
        "Are the string lights in front of the black building attached to poles?": "Yes"
    },
    "test_03278": {
        "Is the red metal doorway in the center of the building's front?": "Yes",
        "Are the stratocumulus clouds visible on the left side of the image?": "Yes",
        "Is the bush located in front of the window to the right of the door?": "No",
        "Is the tower structure on top of the building centered above the red metal doorway?": "Yes",
        "Are the tree limbs and leaves located on the left side of the doorway when viewed from the image?": "Yes"
    },
    "test_03282": {
        "Is the pond extending diagonally toward the bottom right corner of the image?": "Yes",
        "Are the lily pads located near the bottom right corner of the image?": "Yes",
        "Is the wooden shed visible in the top left corner of the image?": "Yes",
        "Does the water from the waterfall flow directly into the pond?": "Yes",
        "Are the lily pads located near the edge of the pond?": "Yes"
    },
    "test_03288": {
        "Is the blue concrete ball positioned towards the bottom center of the image?": "Yes",
        "Is the curb visible in the top right corner of the image?": "Yes",
        "Are the yellow parking lot lines located near the top of the image?": "Yes",
        "Is the concrete ball casting a shadow on the asphalt road?": "Yes",
        "Is the curb located above the concrete ball in the image?": "Yes"
    },
    "test_03298": {
        "Are the trees positioned throughout the image?": "Yes",
        "Is there mud at the bottom portion of the image?": "Yes",
        "Are the large yellow leaves on the top part of the trees?": "Yes",
        "Are the trees growing through the water covered with algae?": "Yes",
        "Do the shadows of the branches and leaves fall along the algae?": "Yes"
    },
    "test_03329": {
        "Is the big, tall tree positioned on the left side of the image?": "Yes",
        "Is the reflection of the big tree in the middle of the water?": "Yes",
        "Are the short trees with light green leaves on the right side of the image?": "Yes",
        "Is the reflection of the tall tree visible in the water?": "Yes",
        "Are the short trees to the right of the tall tree?": "Yes"
    },
    "test_03333": {
        "Is the Eurycnema goliath positioned in the center of the image?": "Yes",
        "Is the human hand pointing to the left side of the image?": "No",
        "Is the dark green tarp located on the left side underneath the insect?": "Yes",
        "Is the insect positioned on top of the human hand?": "Yes",
        "Is the tarp located below the human hand and insect?": "Yes"
    },
    "test_03338": {
        "Are the solar panels positioned in the center of the image?": "Yes",
        "Is the wooden fence on the left side of the image?": "Yes",
        "Is the dirt-covered floor in front of the solar panels?": "Yes",
        "Are the solar panels positioned above the dirt-covered floor?": "Yes",
        "Is the wooden fence located behind the solar panels?": "Yes"
    },
    "test_03339": {
        "Is the topaz crystal positioned in the center of the image?": "Yes",
        "Is the yellow smithsonite crystal behind the topaz crystal?": "Yes",
        "Is the yellow brucite crystal placed on the highest platform in the image?": "Yes",
        "Is the topaz crystal placed on a lower platform than the smithsonite crystal?": "Yes",
        "Is the brucite crystal positioned behind the smithsonite crystal on a higher platform?": "Yes"
    },
    "test_03342": {
        "Is the squirrel facing to the left side of the image?": "Yes",
        "Is the tip of the squirrel's tail positioned to the right on the deck?": "Yes",
        "Are there several fallen leaves spread across the deck?": "Yes",
        "Is the squirrel standing on the top step of the deck?": "Yes",
        "Is the squirrel's tail resting on the deck to the right of its body?": "Yes"
    },
    "test_03347": {
        "Is the \"EAT\" sign centered in the image?": "Yes",
        "Is there a natural light reflection in the bottom right corner of the image?": "Yes",
        "Is the shadow of the \"EAT\" sign slightly to the right of its center?": "Yes",
        "Is the \"EAT\" sign placed on the black, glossy circle?": "Yes",
        "Is the shadow of the sign directly below it?": "Yes"
    },
    "test_03349": {
        "Is the canal positioned at the center of the image?": "Yes",
        "Are the multi-colored cars on the left side of the canal?": "No",
        "Are the bushy trees positioned behind the street bridge?": "Yes",
        "Is the street bridge positioned above the canal?": "Yes",
        "Are the trees located behind the street bridge?": "Yes"
    },
    "test_03353": {
        "Are the vehicles parked to the left side of the pit?": "Yes",
        "Does the river run across the top of the image in the background?": "Yes",
        "Is the city street located to the middle left edge extending toward the top right corner?": "Yes",
        "Are vehicles parked to the left side of the pit?": "Yes",
        "Does the city street run parallel to the river?": "No"
    },
    "test_03362": {
        "Is the clock attached to the pole on the right side of the image?": "Yes",
        "Is the green canopy above the clock in the image?": "Yes",
        "Is the tan building visible on the right side behind the streetlights?": "No",
        "Is the clock attached to the pole?": "Yes",
        "Is the reflection of a tree on the clock's glass face?": "Yes"
    },
    "test_03386": {
        "Is the vivianite crystal positioned on top of the brown rock?": "Yes",
        "Does the segment of the crystal extend from the top left quadrant of the image to the right side of the image?": "Yes",
        "Is the light projection shaped like the crystal visible on the wall around the sides of the crystal?": "Yes",
        "Is the vivianite crystal embedded into the rock?": "Yes",
        "Is the light being projected onto the black surface by the crystal?": "Yes"
    },
    "test_03392": {
        "Is the name \"JACK\" carved in the center of the image?": "Yes",
        "Does the tree bark surface extend from the right side to the left side of the image?": "Yes",
        "Is there another gray surface extending forward at a perpendicular angle relative to the tree bark surface?": "Yes",
        "Is the name \"JACK\" carved into the tree bark on the majority surface of the image?": "Yes",
        "Does the gray surface extend perpendicular to the tree bark surface?": "Yes"
    },
    "test_03420": {
        "Is the black chalk line located at the upper center of the image?": "Yes",
        "Are the balloons positioned on the left side of the image?": "Yes",
        "Is the tire track running through the middle of the balloons?": "Yes",
        "Does the black chalk line circle around the tops of some balloons?": "Yes",
        "Does the tire track run through the middle of the balloons?": "Yes"
    },
    "test_03422": {
        "Is the car facing left in the image?": "Yes",
        "Is the tree positioned behind the car?": "Yes",
        "Is the curb on the right side of the car?": "No",
        "Is the convertible parked next to the curb?": "Yes",
        "Is the tree blocking part of the view of the house?": "Yes"
    },
    "test_03437": {
        "Are the planes positioned in front of the gray building?": "Yes",
        "Is the strip of dried grass located behind the visible runway in the front?": "Yes",
        "Are the white clouds in the sky primarily on the left side of the image?": "No",
        "Are the planes positioned on cement near the building?": "Yes",
        "Are there any runways between the dried grass and the building?": "Yes"
    },
    "test_03439": {
        "Is the concrete divider on the left side of the image?": "Yes",
        "Is the semi-truck with \"TITAN\" on it positioned in front of the ambulance?": "Yes",
        "Are the skyscrapers located in the middle of the image in the distance?": "Yes",
        "Is the concrete divider on the left of the ambulance?": "Yes",
        "Are the green street signs above the lanes?": "Yes"
    },
    "test_03441": {
        "Is the light fixture positioned in the center of the image?": "Yes",
        "Is the pole attaching the light fixture to the tent positioned vertically?": "Yes",
        "Is the light fixture casting a shadow on the underside of the tent?": "Yes",
        "Is the light fixture hanging from the center of the tent?": "Yes",
        "Are the lights inside the glass lamp shade spaced evenly apart?": "Yes"
    },
    "test_03458": {
        "Is the copper-colored tile positioned on the bottom right side of the image?": "Yes",
        "Are the subway doors located towards the right side of the image?": "Yes",
        "Is the rectangular-shaped window to the left of the subway doors?": "Yes",
        "Is the subway near the edge of the platform?": "Yes",
        "Are the doors of the subway near the yellow bumpy tiles?": "Yes"
    },
    "test_03463": {
        "Is the 'Do not use' sign centered on the pin board?": "Yes",
        "Is the sign positioned towards the top of the pin board?": "Yes",
        "Is the reflective laminate visible around all sides of the sign?": "Yes",
        "Is the sign attached to the pin board?": "Yes",
        "Is the excess laminate surrounding the sign touching the pin board?": "Yes"
    },
    "test_03464": {
        "Is the steeple located at the top center of the church building?": "Yes",
        "Are the two ionic pillars on the left side of the building entrance?": "No",
        "Is the black traffic light positioned at the bottom right corner of the image?": "Yes",
        "Are the two ionic pillars located at the top of the stairs?": "Yes",
        "Is the tree obscuring the right side of the church?": "Yes"
    },
    "test_03474": {
        "Is the tree shadow covering the majority of the left side of the image?": "Yes",
        "Is the gravel surface visible on the right side of the image?": "Yes",
        "Is the smooth dirt path on the right side of the image?": "No",
        "Is the shadow of the tree covering the majority of the dirt surface?": "Yes",
        "Is the sun shining on the right side of the image without casting shadows?": "Yes"
    },
    "test_03476": {
        "Is the small tree with dead branches in the foreground positioned on the left side of the image?": "Yes",
        "Is the 18-wheeler trailer truck parked on the right side of the image behind the trees?": "Yes",
        "Are the vertical windows of the white building visible on the left side of the image?": "Yes",
        "Is the small tree in the foreground overlapping the front end of the truck?": "Yes",
        "Are the long vertical windows of the white building positioned to the left of the elm trees?": "Yes"
    },
    "test_03480": {
        "Is the tall, dark blue, glass building on the left side of the image?": "Yes",
        "Is the light blue pool located to the left side of the central white-roofed building?": "Yes",
        "Are the soft clouds located in the top left corner of the image?": "Yes",
        "Are the balconies on the light blue glass building on the left side?": "Yes",
        "Is the pool located in front of the short building with light orange brick walls?": "Yes"
    },
    "test_03486": {
        "Is the rabbit facing to the left in the image?": "Yes",
        "Are the large green plants positioned behind the rabbit?": "Yes",
        "Is the tree trunk leaning to the left in the image?": "Yes",
        "Is the rabbit in front of the tree trunk?": "Yes",
        "Are the weeds in front of the rabbit?": "Yes"
    },
    "test_03488": {
        "Is the dotted yellow line shown on the lower part of the screen?": "Yes",
        "Are the air vents located below the display screen?": "Yes",
        "Is the tall tree located on the right side of the image?": "Yes",
        "Is the yellow box on the display positioned above the dotted horizontal line?": "Yes",
        "Are the air vents located below the screen in the car?": "Yes"
    },
    "test_03500": {
        "Is the toy horse angled towards the bottom left corner of the image?": "Yes",
        "Are the bubbles positioned to the right of the toy horse?": "Yes",
        "Is the strand of curly hair located below and to the left of the bubbles?": "Yes",
        "Is the yellow toy horse positioned closer to the group of bubbles than to the curly hair?": "Yes",
        "Is the curly hair located below the group of bubbles in the image?": "Yes"
    },
    "test_03502": {
        "Is the gravel trail positioned in the center of the image?": "Yes",
        "Is the wooden fence on the left side of the image?": "Yes",
        "Are the trees located at the end of the gravel trail?": "Yes",
        "Is the wooden fence located to the left of the trail?": "Yes",
        "Does the trail lead towards the trees?": "Yes"
    },
    "test_03503": {
        "Is the green lacewing positioned on the letter \"I\" in the word \"PINT\"?": "Yes",
        "Are the smaller letters \"ATX\" located below the word \"PINT\"?": "Yes",
        "Is there a partial view of a larger letter \"P\" to the right of \"ATX\"?": "Yes",
        "Is the lacewing positioned on top of the letter \"I\"?": "Yes",
        "Are the smaller letters \"ATX\" directly below the larger letters \"PINT\"?": "Yes"
    },
    "test_03538": {
        "Is the robin positioned towards the left side of the image?": "Yes",
        "Are the robin's tail feathers extending towards the right side of the image?": "Yes",
        "Is the small patch of mud located at the top of the image?": "Yes",
        "Is the robin facing towards the patch of mud?": "No",
        "Are the robin's tail feathers extending over the grass?": "Yes"
    },
    "test_03540": {
        "Are the cat's paws positioned at the bottom center of the image?": "Yes",
        "Is the black string located in front of the cat's paws?": "Yes",
        "Are the white paint chips on the left side of the image near the wall?": "Yes",
        "Are the cat's paws touching the wooden threshold?": "Yes",
        "Is the black string in front of the cat's paws?": "Yes"
    },
    "test_03544": {
        "Is the black heart located in the upper left corner of the image?": "Yes",
        "Is the animated large exclamation point to the left of the writing \"mas\"?": "No",
        "Is the indiscernible black shape located on the right side of the image?": "Yes",
        "Is the daisy located to the left of the writing \"te amo mas\"?": "Yes",
        "Are the hearts positioned above the daisy?": "Yes"
    },
    "test_03549": {
        "Is the jar with the green plants and pink flowers placed on the left side of the image?": "Yes",
        "Is the mug on the left side of the jar?": "No",
        "Is the horse design on the mug facing the right side of the image?": "Yes",
        "Is the jar placed to the left of the mug on the table?": "Yes",
        "Does the handle of the mug face away from the jar?": "Yes"
    },
    "test_03556": {
        "Are the words \"New & USED / DRUM SETS\" positioned at the top of the image?": "Yes",
        "Is the large tree located on the right side of the image?": "No",
        "Is the yellowish hi-hat located on the rightmost side of the drum set in the painting?": "Yes",
        "Is the man in the painting playing the drums with sticks?": "Yes",
        "Is the tree reflected on the left side of the glass panel?": "Yes"
    },
    "test_03573": {
        "Is the center light in the top row of lights turned on?": "Yes",
        "Is the blue circle button with a white pictogram of a man to the left of the cigarette symbol?": "Yes",
        "Are the closed circular vents positioned directly below the row of lights?": "Yes",
        "Is the blue circle button with the white pictogram of a man to the left of the cigarette symbol?": "Yes",
        "Are the circular vents directly above the fan exhaust?": "No"
    },
    "test_03577": {
        "Is the large flower positioned in the center of the image?": "Yes",
        "Are the black marks on the right side of the cement wall?": "Yes",
        "Is the left side of the wall a light gray color?": "Yes",
        "Are the three carved flowers surrounded by a rectangle?": "Yes",
        "Is the large flower in the center surrounded by two smaller flowers?": "Yes"
    },
    "test_03593": {
        "Is the Egyptian sculpture seated on the chair positioned on the right side of the image?": "Yes",
        "Are the three bases with animal statues positioned diagonally to the left of the Egyptian sculpture?": "Yes",
        "Are the palm trees located directly behind the animal statues?": "Yes",
        "Are the animal statues positioned diagonally in front of the Egyptian sculpture on the chair?": "Yes",
        "Are the palm trees located behind the animal statues?": "Yes"
    },
    "test_03598": {
        "Is the sign attached to the pole positioned in the center of the image?": "No",
        "Is the brick wall located to the right of the sign in the image?": "Yes",
        "Is the wooden doorway on the left side of the sign in the image?": "Yes",
        "Is the sign attached to a metal pole inserted into a concrete block?": "Yes",
        "Is the brick wall to the right of the sign?": "Yes"
    },
    "test_03624": {
        "Is the wine glass positioned in the center of the image?": "Yes",
        "Are the dried brown leaves located at the base of the wine glass?": "Yes",
        "Is the brown fence visible at the top part of the image?": "Yes",
        "Is the wine glass positioned among dried leaves?": "Yes",
        "Is the grass taller than the wine glass?": "No"
    },
    "test_03630": {
        "Is the dog's head positioned to the right side of the image?": "Yes",
        "Is the leash leading to the bottom right corner of the image?": "Yes",
        "Are the houses located behind the dog in the image?": "Yes",
        "Is the leash connected to the dog's collar positioned in front of the dog?": "Yes",
        "Are the houses in the background behind the dog?": "Yes"
    },
    "test_03677": {
        "Is the white delivery truck facing towards the left?": "Yes",
        "Is the rooster on the side of the truck facing towards the left?": "No",
        "Are the red painted letters positioned above the man on the wooden wagon?": "Yes",
        "Is the rooster facing the opposite direction of the delivery truck's front?": "Yes",
        "Is the donkey pulling the wagon behind the rooster?": "Yes"
    },
    "test_03678": {
        "Is the word \"MISSION\" centered on the wall in the image?": "Yes",
        "Is the letter \"E\" to the left of \"MISSION\" partially visible?": "Yes",
        "Is the discoloration located at the top of the \"I\" in \"MISSION\"?": "No",
        "Is the \"E\" positioned to the left of \"MISSION\"?": "Yes",
        "Is light reflecting off the black wall?": "Yes"
    },
    "test_03694": {
        "Is the maroon cement pillar positioned in the center of the image?": "Yes",
        "Are the objects to the left and right of the middle object identical in structure?": "Yes",
        "Is there natural debris visible on the surface of the ground?": "Yes",
        "Are the objects placed side by side with equal spacing between them?": "Yes",
        "Is the maroon cement pillar positioned on top of the middle object?": "Yes"
    },
    "test_03707": {
        "Is the blue vinyl chair visible at the upper left corner of the image?": "Yes",
        "Are the poker chip cutouts located around the front and ends of the craps table?": "Yes",
        "Is there another craps table behind the first one in the image?": "Yes",
        "Is the blue vinyl chair in front of the craps table?": "Yes",
        "Are there digital casino games located behind the craps table?": "Yes"
    },
    "test_03708": {
        "Is the black frame centered on the white wall?": "Yes",
        "Is the car facing towards the left side of the picture?": "Yes",
        "Is the word Google positioned on the right side of the car?": "Yes",
        "Is the car facing towards the sunset depicted in the picture on the door?": "Yes",
        "Is the shadow of the picture cast directly underneath it?": "Yes"
    },
    "test_03710": {
        "Is the Monarch by Windsor Apartments building located on the left side of the image?": "Yes",
        "Is the Bowie apartment building positioned to the right of the Monarch by Windsor Apartments building?": "Yes",
        "Is the mural of the snake positioned below the tree in the image?": "Yes",
        "Is the tree positioned in front of the Monarch by Windsor Apartments building?": "No",
        "Does the gray railing intersect horizontally above the mural of the snake?": "Yes"
    },
    "test_03714": {
        "Is the white natural color of the stone wall visible at the very bottom of the image?": "Yes",
        "Are the vines hanging down from the top edge of the wall?": "Yes",
        "Is the slope of the foliage leading towards the edge of the stone wall visible at the top of the image?": "Yes",
        "Are the vines hanging off the edge of the stone wall?": "Yes",
        "Do the bushes and plants grow at the edge of the stone wall?": "Yes"
    },
    "test_03716": {
        "Is the kitten positioned on the right side of the chair?": "Yes",
        "Is the person with the striped shirt on the left side of the image?": "Yes",
        "Is the kitten's head facing towards the right side of the image?": "Yes",
        "Is the kitten touching the chair with its left paw?": "Yes",
        "Is the person's arm hanging down on the side of the chair in the distance?": "Yes"
    },
    "test_03719": {
        "Is the gray stone in the center of the image?": "Yes",
        "Is the patch of tall grass on top of the gray stone?": "Yes",
        "Is the shore located at the top of the image?": "Yes",
        "Is the tall grass growing on top of the stone?": "Yes",
        "Are the stones under the water located near the shore?": "Yes"
    },
    "test_03729": {
        "Is the yellow background located under the right side of the turtle?": "Yes",
        "Is the grey asphalt strip of road in the top part of the image?": "No",
        "Is the red color above the white cloud in the image?": "Yes",
        "Is the manhole cover integrated into the letter \"O\" of the word \"ONE\"?": "Yes",
        "Does the blue wavy water line go over the shell of the turtle?": "Yes"
    },
    "test_03750": {
        "Is the withered, leafless tree on the right side of the image?": "Yes",
        "Does the swamp cover the lower half of the frame?": "Yes",
        "Is the clear blue sky visible at the top of the forest?": "Yes",
        "Is the withered tree next to the tall green grass?": "Yes",
        "Are the trees casting shadows on the swamp?": "Yes"
    },
    "test_03758": {
        "Is the lizard positioned at a forty-five degree angle on the log?": "Yes",
        "Are the plants with long green leaves on both the left and right sides of the lizard?": "Yes",
        "Is the thermometer behind the lizard pointing to 90 degrees Fahrenheit?": "Yes",
        "Is the thermometer behind the lizard?": "Yes",
        "Are there plants on both sides of the lizard?": "Yes"
    },
    "test_03801": {
        "Is the lion sculpture positioned at the edge of the building?": "Yes",
        "Is the window panel located to the left of the sculpture?": "Yes",
        "Are the designs engraved and embossed visible on the beige building walls?": "Yes",
        "Is the sculpture positioned on the edge of the building?": "Yes"
    },
    "test_03802": {
        "Is the sticker positioned in the center of the trash bin?": "Yes",
        "Are the black burn marks located at the bottom of the sticker?": "Yes",
        "Is the scrape on the bin below the sticker?": "Yes",
        "Is the sticker located in the center of the trash bin?": "Yes",
        "Does the scrape go under the sticker on the trash bin?": "Yes"
    },
    "test_03814": {
        "Is the black Toyota 4Runner facing towards the left in the image?": "Yes",
        "Is the gray electrical box located to the left of the black Toyota 4Runner?": "Yes",
        "Is the no parking sign positioned in front of the black Toyota 4Runner?": "No",
        "Is the no parking sign located behind the Toyota 4Runner near the hood?": "Yes",
        "Is there a tree with long limbs extending over the Toyota 4Runner?": "Yes"
    },
    "test_03823": {
        "Is the sculpture facing the left side of the image?": "Yes",
        "Are the wooden chairs on the left side of the sculpture?": "Yes",
        "Is the plant on the right side of the sculpture?": "Yes",
        "Is the sculpture standing on the white glass object?": "Yes",
        "Are the wooden chairs stacked on the left side of the sculpture?": "Yes"
    },
    "test_03824": {
        "Is the window built into a cadet blue colored wall?": "Yes",
        "Is the cat looking towards the right side of the image?": "No",
        "Are there twigs located towards the bottom left of the image?": "Yes",
        "Is the cat looking out of the window?": "Yes",
        "Are the twigs located below the window?": "Yes"
    },
    "test_03835": {
        "Is the sterlet fish positioned in the center of the image?": "Yes",
        "Is the orange fish on the left side of the image?": "Yes",
        "Is the large stone almost reaching the top edge of the image on the right side?": "Yes",
        "Is the large stone on the right side of the image taller than the fish?": "Yes",
        "Are the two fish swimming over the slanted stone facing the same direction?": "Yes"
    },
    "test_03841": {
        "Is the window providing light on the left side of the image?": "Yes",
        "Are the stacked books located on the right side of the image?": "Yes",
        "Is the cat positioned in the foreground of the image?": "Yes",
        "Is the cat lying on the human's legs?": "Yes",
        "Are the stacked books behind the cat?": "Yes"
    },
    "test_03848": {
        "Is the Mega Wrex monster truck facing to the right of the image?": "Yes",
        "Is the orange vehicle situated on the right side of the image?": "Yes",
        "Is the other monster truck located on the left side in the background?": "Yes",
        "Is the Mega Wrex monster truck landing on the line of red cars?": "Yes",
        "Is the orange vehicle on the right of the Mega Wrex monster truck?": "Yes"
    },
    "test_03861": {
        "Are the bananas arranged in the center of the image?": "Yes",
        "Is the glare from the light predominantly on the top half of the image?": "Yes",
        "Are the bananas positioned in a circular pattern?": "Yes",
        "Are the bananas arranged in a circle?": "Yes",
        "Are the bananas' stems directed upward?": "Yes"
    },
    "test_03869": {
        "Is the dog positioned in the center of the image?": "Yes",
        "Is the dirt road in the background of the image?": "Yes",
        "Is the fork in the road on the top right corner of the image?": "Yes",
        "Is the dog facing the dirt road?": "No",
        "Is the fork in the road visible behind the dog?": "Yes"
    },
    "test_03874": {
        "Is the ledge positioned diagonally through the view of the image?": "Yes",
        "Are the large rocks lined up on the uneven edge on the right side of the image?": "Yes",
        "Is the calm water located on the left side of the image?": "Yes",
        "Are the rocks positioned along the edge blocking the water flow?": "Yes",
        "Is the water rougher at the location of the drop-off than before it?": "Yes"
    },
    "test_03879": {
        "Is the female mannequin positioned on the left side of the image?": "Yes",
        "Is the male mannequin wearing a black shirt?": "Yes",
        "Is the display with more merchandise behind the mannequins?": "Yes",
        "Are the two mannequins placed side by side?": "Yes",
        "Is the display behind the mannequins showing more merchandise?": "Yes"
    },
    "test_03903": {
        "Is the desk positioned slightly to the left of the image?": "Yes",
        "Is the trash can on the right side of the desk?": "No",
        "Is the collage of pictures located on the wall behind the desk?": "Yes",
        "Is the trash can located to the left of the desk?": "Yes",
        "Can the reflections of the TVs be seen on the desk?": "Yes"
    },
    "test_03928": {
        "Is the school bus facing left in the image?": "Yes",
        "Is the folded stop sign on the front of the bus?": "Yes",
        "Is the white building behind the bus taller than the bus?": "Yes",
        "Is the yellow school bus parked parallel to the road?": "Yes",
        "Are the trees located behind the bus?": "Yes"
    },
    "test_03931": {
        "Are the ceiling lights parallel to each other?": "Yes",
        "Is the white thin line attached to the ceiling between the two lights?": "Yes",
        "Is the lower level ceiling located behind the lights?": "Yes",
        "Are the two round ceiling lights parallel to each other?": "Yes",
        "Is there another light source inside the ceiling, partially viewed in the image?": "Yes"
    },
    "test_03935": {
        "Is the wooden sign positioned near the center of the image?": "Yes",
        "Are the brown tables positioned behind the sign?": "Yes",
        "Is the large brick school building located in the background of the image?": "Yes",
        "Is the wooden sign spiked into the dirt in front of the tables?": "Yes",
        "Are the trees behind the tables in front of the brick building?": "Yes"
    },
    "test_03941": {
        "Is the white SUV positioned on the left side of the road?": "No",
        "Are the traffic signs on the right side of the road?": "Yes",
        "Is the group of trees located beyond the car in the distance?": "Yes",
        "Is the SUV driving towards the pole with the traffic signs?": "Yes",
        "Are the trees located beyond the SUV on the road?": "Yes"
    },
    "test_03947": {
        "Is the trash can positioned on the right side of the image?": "Yes",
        "Is the duck located to the left of the bench?": "Yes",
        "Are the benches behind the trash can?": "Yes",
        "Is the duck in front of the left bench?": "Yes",
        "Is the trash can on the same dirt patch as the duck?": "Yes"
    },
    "test_03950": {
        "Is the Ford Raptor truck positioned in the center of the image?": "Yes",
        "Is the grass hill located behind the truck?": "Yes",
        "Are the painted white lines parallel to the truck?": "Yes",
        "Is the truck parked between two painted white lines?": "Yes",
        "Is there a green grass hill behind the cement curb?": "Yes"
    },
    "test_03965": {
        "Is the mask positioned in the center of the pole?": "Yes",
        "Is the word \"ARMPIT\" located above the mask on the pole?": "Yes",
        "Is the road visible on the left side of the pole?": "Yes",
        "Is the triangle-shaped artwork located below the mask?": "Yes",
        "Does the word \"ARMPIT\" appear above the mask on the pole?": "Yes"
    },
    "test_03974": {
        "Is the yellow safety pole positioned on the left side of the image?": "Yes",
        "Is the plastic pipe situated to the right of the owl painting?": "Yes",
        "Is the rat trap positioned directly under the owl painting?": "Yes",
        "Is the yellow safety pole positioned to the left of the owl painting?": "Yes",
        "Is the rat trap placed on the ground in front of the owl painting?": "Yes"
    },
    "test_03977": {
        "Is the motor scooter positioned on the right side of the image?": "Yes",
        "Is the garage door located on the left side of the image?": "Yes",
        "Is the graffiti with the devil face located to the right of the bubble letters?": "Yes",
        "Is the motor scooter parked to the right of the garage door?": "Yes",
        "Is the light gray post attached to the brick wall to the left of the scooter?": "Yes"
    },
    "test_03998": {
        "Are the four corner cylinders flipped to the black side?": "Yes",
        "Is the cream color slide located behind the tic tac toe game?": "Yes",
        "Is the black metal platform visible at the bottom of the image?": "Yes",
        "Are the four corner cylinders flipped to the same side?": "Yes"
    },
    "test_04007": {
        "Is the miniature soccer ball positioned in the top left corner of the arrangement?": "Yes",
        "Is the small orange ball located to the right of the baseball?": "Yes",
        "Is the light shining on the bottom left of the wooden surface?": "No",
        "Is the small orange ball positioned at the front right of the arrangement?": "Yes",
        "Is the miniature soccer ball directly behind the baseball?": "No"
    },
    "test_04020": {
        "Is the bus parked next to a curb?": "Yes",
        "Is the corrugated silver metal fence on the right side of the image?": "Yes",
        "Are the trees hanging over the top of the bus?": "Yes",
        "Are trees hanging over the top of the bus?": "Yes",
        "Is the bus parked next to a corrugated silver metal fence?": "Yes"
    },
    "test_04024": {
        "Is the black square sign located above the subway entrance?": "Yes",
        "Are the handrails positioned on both sides of the stairs?": "Yes",
        "Is the stone walkway at the top of the stairs?": "No",
        "Is the black square sign attached to the fence above the subway entrance?": "Yes",
        "Are the metal handrails attached to the brick walls on either side of the stairs?": "Yes"
    },
    "test_04027": {
        "Is the cicada positioned on top of the basketball?": "Yes",
        "Is the shiny spot located to the right of the cicada on the basketball?": "Yes",
        "Is the shadow of the basketball being cast to the left on the patio?": "No",
        "Is the cicada casting a shadow on the basketball?": "Yes",
        "Is the basketball casting a shadow on the patio?": "Yes"
    },
    "test_04041": {
        "Is the padlock positioned in the center of the image?": "Yes",
        "Is the rusty chain connected to the top of the padlock?": "Yes",
        "Is the shiny chain positioned along the lower right of the shackle?": "Yes",
        "Is the padlock connecting the rusty and shiny chains together?": "Yes",
        "Does the sun create shadows on the rusty chain?": "Yes"
    },
    "test_04047": {
        "Is the round black table positioned in front of the two brown quilted chairs?": "Yes",
        "Is the hallway located on the right side of the image?": "Yes",
        "Is the gray wall with gray molding at the bottom found on the left side of the image?": "Yes",
        "Are the chairs positioned with space between them?": "Yes",
        "Is the table in front of the chairs?": "Yes"
    },
    "test_04062": {
        "Is the red support pillar in the foreground of the image?": "Yes",
        "Are the cars parked behind the red support pillar?": "Yes",
        "Is the blue striping for the cross-walk in front of the support pillar?": "Yes",
        "Is the pillar in front of the parked cars?": "Yes",
        "Are the support pillars in the distance painted the same as the main pillar?": "Yes"
    },
    "test_04076": {
        "Is the Indian flag waving towards the left side of the image?": "Yes",
        "Is the Ashoka Chakra positioned in the center of the white column of the flag?": "Yes",
        "Is the partial view of the dark blue sky on the top left part of the image?": "Yes",
        "Is the flag attached to a pole?": "Yes",
        "Is the flag waving towards the left when viewed from the bottom?": "Yes"
    },
    "test_04093": {
        "Is the sedan on the far right lane of the highway?": "Yes",
        "Is the building with the blue and white sign on the right side of the image?": "Yes",
        "Are the two tallest buildings positioned in the center of the group of buildings?": "Yes",
        "Is the sedan in the rightmost lane relative to the direction of the highway?": "Yes",
        "Is the building with the blue and white sign to the right of the other tall building?": "Yes"
    },
    "test_04110": {
        "Are the tops of trees located at the bottom of the image?": "Yes",
        "Is the row of trees starting on the right side of the image?": "No",
        "Is the sky visible at the top of the image?": "Yes",
        "Are the tops of the trees in the foreground closer to the viewer than the row of trees on the other side of the water?": "Yes",
        "Is the reflection of the trees in the water located between the foreground trees and the row of trees on the opposite side?": "Yes"
    },
    "test_04113": {
        "Is the sun positioned in the middle of the sunroof opening?": "Yes",
        "Are the green leafy tree branches protruding into the view from the left side of the sunroof frame?": "No",
        "Does the wide black strip that splits the sunroof slant from the top right corner downward to the top left corner?": "Yes",
        "Is the sun in the middle of the sunroof opening?": "Yes",
        "Do tree branches protrude into the view of the sunroof from the right side toward the left?": "Yes"
    },
    "test_04118": {
        "Is the Harris hawk positioned in the center of the image?": "Yes",
        "Is the big white stain on the vertical boards to the left of the Harris hawk?": "Yes",
        "Is the corner of vertical wooden boards behind the bird in the right side of the image?": "No",
        "Is the Harris hawk standing on a two by four that is horizontal?": "Yes",
        "Is the big white stain on the vertical boards located to the left of the Harris hawk?": "Yes"
    },
    "test_04134": {
        "Is the Central Park Tower the tallest building visible in the image?": "Yes",
        "Is the Central Park South tower located to the right of the Central Park Tower?": "Yes",
        "Is there a treetop visible in the top right corner of the image?": "Yes",
        "Is the Central Park Tower taller than the trees in the image?": "Yes",
        "Are the shadows on the grass cast by the trees in the foreground?": "Yes"
    },
    "test_04143": {
        "Is the reflection of the building positioned to the left side of the image?": "Yes",
        "Are the small black poles with yellow lights located towards the bottom of the image?": "Yes",
        "Is the entrance of the glass building on the right side of the image?": "No",
        "Is the reflection of the building visible on the glass of the skyscraper facing east?": "No",
        "Are the green bushes positioned between the metal tiles and the glass entrance of the building?": "Yes"
    },
    "test_04147": {
        "Are the three tall goats positioned on the right side of the image?": "Yes",
        "Is the taller gnarled wood fence post located to the left of the goats?": "Yes",
        "Is the gray faded wood outbuilding in the top right corner of the image?": "No",
        "Are the three tall goats positioned on the left side of the fence?": "Yes",
        "Is the outbuilding located in the top left corner of the image in relation to the fence?": "Yes"
    },
    "test_04156": {
        "Is the green tennis ball between the dog's legs?": "Yes",
        "Is the red leash on the right side of the dog?": "No",
        "Are the yellow doors with windows behind the dog?": "Yes",
        "Is the tennis ball between the dog's legs?": "Yes",
        "Is the red leash to the left of the dog?": "Yes"
    },
    "test_04164": {
        "Is the suitcase oriented toward the bottom left corner of the image?": "Yes",
        "Is there a window door located in the top left corner of the image?": "No",
        "Is the wooden chair's shadow cast on the right side of the image?": "Yes",
        "Is the suitcase positioned in front of the curtain?": "Yes",
        "Is the cat inside the suitcase facing away from the window door?": "Yes"
    },
    "test_04168": {
        "Are the bananas positioned in the center of the plate?": "Yes",
        "Is the watch lying horizontally across the banana bunch?": "No",
        "Are the banana ends pointing toward the bottom left corner of the image?": "Yes",
        "Is the watch lying across the banana bunch?": "Yes",
        "Is the ceramic plate underneath the banana bunch mostly hidden?": "Yes"
    },
    "test_04169": {
        "Are the blue bonnets positioned in front of the black smooth rocks?": "Yes",
        "Are the small white and brown pebbles behind the black smooth rocks?": "Yes",
        "Are the blue bonnets on the near side spaced out more than those on the far side?": "Yes",
        "Are the blue bonnets growing in a line next to the black smooth rocks?": "Yes",
        "Are the small white and brown pebbles located on the opposite side of the black smooth rocks from the blue bonnets?": "Yes"
    },
    "test_04190": {
        "Is the white rectangular sign positioned in the center of the image?": "Yes",
        "Is the garbage bin located behind the sign?": "Yes",
        "Is the sunlight illuminating the lower left and upper right portions of the image?": "Yes",
        "Is the sign attached to the wooden crate-like structure?": "Yes",
        "Is the garbage bin inside the crate behind the sign?": "Yes"
    },
    "test_04198": {
        "Is the first cross on the left side of the image colored blue?": "Yes",
        "Is the wooden fence at the top of the image painted black?": "Yes",
        "Are the blue and red square crosses alternating from left to right at the bottom half of the image?": "Yes",
        "Are the square crosses alternating between blue and red?": "Yes",
        "Is the wooden fence with square crosses painted a different color from the upper half of the fence?": "Yes"
    },
    "test_04215": {
        "Are the two ponds positioned on opposite sides of the development?": "Yes",
        "Is the large grass field located towards the top right of the development?": "No",
        "Are the scattered buildings surrounded by street roads located towards the top left?": "Yes",
        "Are the two ponds located on opposite sides of the housing development?": "Yes",
        "Is the red and beige dirt field surrounded by trees?": "Yes"
    },
    "test_04219": {
        "Is the plant pot located on the far left side of the image?": "Yes",
        "Is the mug positioned to the right of the kettle?": "No",
        "Is the shadow of the cabinet directly above the plant pot in the top left corner of the image?": "Yes",
        "Is the mug located to the right of the plant pot?": "No",
        "Is the spout of the kettle hanging off the counter?": "Yes"
    },
    "test_04248": {
        "Is the caterpillar on the left side of the image?": "No",
        "Are the pink rectangles positioned behind the black circle with writing?": "Yes",
        "Is the dark green grass patch beneath the caterpillar?": "Yes",
        "Is the caterpillar sculpture placed on a patch of grass?": "Yes",
        "Is the black circle sign positioned to the right of the caterpillar?": "Yes"
    },
    "test_04258": {
        "Is the olive green wall behind the blue strings?": "Yes",
        "Is the white ceiling fixture positioned above the black ceiling fixture?": "Yes",
        "Is the sunlight shining on the left side of the wooden board?": "Yes",
        "Are the blue strings attached to the black poles?": "Yes",
        "Is the semi-flush-mount ceiling fixture above the black poles?": "Yes"
    },
    "test_04264": {
        "Is the dark rock formation positioned in the center of the image?": "Yes",
        "Is the light brown rock formation with small bumps on the right side of the image?": "Yes",
        "Is the smoother light brown rock formation on the left side of the dark formation?": "Yes",
        "Is the rock formation in the middle connected to the narrow crack submerged in darkness?": "Yes",
        "Is the smoother light brown rock formation located to the left of the dark formation?": "Yes"
    },
    "test_04265": {
        "Is the squirrel positioned on the right side of the image?": "Yes",
        "Are the light green leaves below the squirrel?": "Yes",
        "Is the blue sky visible in the top left corner of the image?": "Yes",
        "Is the squirrel holding onto the tree branch?": "Yes"
    },
    "test_04266": {
        "Is the elephant positioned on the left side of the image?": "Yes",
        "Are the blue chalk marks located underneath the trunk of the elephant?": "Yes",
        "Is the white and pink smear of chalk on the right side of the image?": "No",
        "Is the elephant drawn over the thin blue chalk marks?": "Yes",
        "Is the tiny leaf positioned on the crack in the concrete?": "Yes"
    },
    "test_04284": {
        "Is the orange and black pneumatic tire roller facing the left side of the image?": "Yes",
        "Are the three gray cement pillars located behind the roller?": "Yes",
        "Is the road with a cement barrier on the left side of the image?": "No",
        "Is the orange and black pneumatic tire roller underneath the highway?": "Yes",
        "Are the trees partially blocked from view by the cement pillars?": "Yes"
    },
    "test_04296": {
        "Is the white board with text positioned in the center of the image?": "Yes",
        "Is the traffic cone located on the left side of the image?": "Yes",
        "Are the greenhouses in the background positioned behind the white entrance gate arch sign?": "Yes",
        "Are the stones placed near the wooden sculpture in the cage?": "Yes",
        "Is the traffic cone positioned next to the white board?": "Yes"
    },
    "test_04302": {
        "Is the concrete structure visible between the two trees in the center of the image?": "Yes",
        "Are the people floating in inner tubes located on the right side of the image?": "Yes",
        "Is the tall green hill located on the left side of the image?": "Yes",
        "Is the concrete structure located between the two trees?": "Yes",
        "Are the two people sitting in chairs facing the inner tubes in the water?": "Yes"
    },
    "test_04312": {
        "Is the red sculpture positioned in the center of the image?": "Yes",
        "Is the tan building on the left side of the image?": "Yes",
        "Are the basketballs positioned around the base of the sculpture?": "Yes",
        "Are the basketballs inside the fenced area?": "Yes",
        "Is there a physical barrier between the sculpture and the chairs?": "Yes"
    },
    "test_04314": {
        "Is the river located on the right side of the painting?": "Yes",
        "Is the palm tree pathway positioned on the left side of the painting?": "Yes",
        "Is the mountain depicted in the background further away than the tall building?": "Yes",
        "Is the river located to the right of the palm tree pathway?": "Yes",
        "Is the tall mountain further away than the building?": "Yes"
    },
    "test_04315": {
        "Is the plate positioned on the right side of the image?": "Yes",
        "Are the shadows of the onions visible on the edges of the plate?": "Yes",
        "Is the shadow of the plate seen below the plate at the bottom?": "Yes",
        "Are the sliced onions placed on the plate?": "Yes",
        "Is the plate resting on the wooden table?": "Yes"
    },
    "test_04316": {
        "Is the robotic floor vacuum positioned to the right of the cat?": "Yes",
        "Is the outlet plate located in the center of the wall?": "Yes",
        "Is the socket to the right of the outlet plate?": "Yes",
        "Is the cat staring at the robotic floor vacuum?": "Yes",
        "Is the robotic floor vacuum docked at the charging port?": "Yes"
    },
    "test_04330": {
        "Is the train engine positioned on the right side of the image?": "No",
        "Is the tree located to the left of the train engine?": "Yes",
        "Is the fence located at the bottom of the image?": "Yes",
        "Is the yellow train engine attached to two storage boxcars?": "Yes"
    },
    "test_04357": {
        "Is the black square metal frame positioned in the center of the image?": "Yes",
        "Is the tree with dark green leaves on the left side of the pillar?": "Yes",
        "Is the cloudy and blue sky visible on the right side of the image?": "Yes",
        "Is the metal star situated inside the circular frame?": "Yes",
        "Is the tree to the left of the pillar?": "Yes"
    },
    "test_04368": {
        "Is the cow statue positioned on the right side of the image?": "Yes",
        "Are the books stacked behind the cow statue?": "Yes",
        "Is the vase sitting directly on the floor?": "No",
        "Are the books behind the cow statue?": "Yes",
        "Is the vase placed on top of the books?": "Yes"
    },
    "test_04371": {
        "Is the sphere positioned in the center of the image?": "Yes",
        "Are most of the vines concentrated on the left half of the sphere?": "Yes",
        "Is the leafy tree located in the right third of the frame?": "Yes",
        "Are the vines primarily growing on the left half of the sphere?": "Yes",
        "Is the leg at the right bottom edge of the frame covered in vines?": "No"
    },
    "test_04386": {
        "Are the cucumber plants positioned in the center of the image?": "Yes",
        "Is the wood planter behind the cucumber plants visible?": "Yes",
        "Are there dried twigs surrounding the cucumber plants in the dirt?": "Yes",
        "Are the cucumber plants positioned side by side?": "Yes",
        "Is there another wood planter visible behind the first one?": "Yes"
    },
    "test_04389": {
        "Is the frowning sun located to the left side of the image?": "Yes",
        "Are the red hearts scattered between the clouds?": "Yes",
        "Is the grassy hill visible behind the wall on the right side of the image?": "Yes",
        "Are the red hearts floating between the clouds?": "Yes",
        "Is the tree to the left of the open sky view?": "Yes"
    },
    "test_04392": {
        "Are there ferns in front of the tree stump at the bottom of the image?": "Yes",
        "Are there two roots extending to the left side of the image?": "Yes",
        "Are the plants and ferns in the background behind the stump?": "Yes",
        "Are there more roots extending to the left side of the image than to the right side of the stump?": "Yes",
        "Are the ferns closer to the foreground or the background in relation to the stump?": "Foreground"
    },
    "test_04396": {
        "Is the wine bottle positioned in the center of one of the stove grills?": "Yes",
        "Is the cream hard stone wall behind the wine bottle?": "Yes",
        "Are there reflections of the wine bottle on the stove top?": "Yes",
        "Is the wine bottle placed on top of a stove grill?": "Yes",
        "Is the wine bottle's reflection visible on the stove top?": "Yes"
    },
    "test_04402": {
        "Is the deer with its head facing forward positioned in the foreground of the image?": "Yes",
        "Are the majority of the deer located near the top right corner of the image?": "Yes",
        "Is the gravel road directing to the left in the image?": "Yes",
        "Are the deer grazing near the gravel road?": "Yes",
        "Are there more deer near the top right corner of the frame?": "Yes"
    },
    "test_04414": {
        "Is the avocado positioned at the bottom center of the image?": "Yes",
        "Is the onion located towards the top right of the image?": "No",
        "Is the egg positioned to the right of the onion?": "Yes",
        "Are the onion and the egg positioned at the top of the triangle formed by the objects?": "Yes",
        "Does the avocado form the bottom point of the triangle?": "Yes"
    },
    "test_04418": {
        "Is the bright sun shining on the right of the central frame point?": "Yes",
        "Are the orange and blue vertical stripes below the colorless sheets?": "Yes",
        "Is the metal roof structure seen in the background on the lower part of the image?": "Yes",
        "Are the orange and blue stripes positioned below the colorless sheets?": "Yes",
        "Is the metal roof located beyond the rollable wall?": "Yes"
    },
    "test_04454": {
        "Is the large pink flower positioned above the three small white flowers in the image?": "Yes",
        "Is the large orange flower located on the left side of the small white flowers?": "Yes",
        "Is the white bow at the top of the bouquet?": "No",
        "Is the orange flower on the left side of the bouquet?": "Yes",
        "Is there a white bow at the center of the bouquet?": "Yes"
    },
    "test_04462": {
        "Is the pony standing in a shaded area?": "Yes",
        "Is the small brown house located on the far left of the image?": "No",
        "Are the electrical boxes positioned to the left of the small brown house?": "Yes",
        "Is the pony in the shade while eating?": "Yes",
        "Is the house with the brown roof surrounded by trees located to the left of the house with windows?": "Yes"
    },
    "test_04465": {
        "Is the bird positioned toward the right side of the image?": "Yes",
        "Can the wet area be seen on the left side of the bird?": "Yes",
        "Is the red metal door visible behind the bird?": "Yes",
        "Is the bird walking towards the red metal door?": "No",
        "Is the dry area on the ground in front of the bird?": "Yes"
    },
    "test_04477": {
        "Is the head in the painting facing towards the right side of the image?": "Yes",
        "Are the golden ratio spirals located to the right of the painted face?": "Yes",
        "Is the brown duct to the left of the painted face?": "Yes",
        "Is the duct on the left side of the wall going down to the ground?": "Yes",
        "Are the golden ratio spirals located to the right of the man's face in the painting?": "Yes"
    },
    "test_04493": {
        "Is the wooden table positioned on a gray rug?": "Yes",
        "Is the dark gray wall to the left of the table?": "Yes",
        "Are the wooden floors seen to the right of the image?": "Yes",
        "Is the sofa positioned behind the table?": "Yes",
        "Is the table casting a shadow onto the wall?": "Yes"
    },
    "test_04502": {
        "Are the bananas positioned on the far left of the image?": "Yes",
        "Is the glass of wine located to the right of the bananas?": "Yes",
        "Is the mango on the right side of the wine glass?": "Yes",
        "Are the bananas positioned to the left of the glass of wine?": "Yes",
        "Is the mango to the right of the glass of wine?": "Yes"
    },
    "test_04519": {
        "Is the large tractor tire on the right side of the image?": "Yes",
        "Is the smaller automobile tire positioned to the upper left of the large tractor tire?": "Yes",
        "Are the cane poles and tree stumps to the left of the large tractor tire?": "Yes",
        "Is the firewood inside the large tractor tire?": "Yes",
        "Are the cane poles lying underneath the smaller automobile tire?": "Yes"
    },
    "test_04524": {
        "Is the labradoodle positioned in the center of the image?": "Yes",
        "Is the stuffed animal on the left side of the image?": "Yes",
        "Is the leash visible on the left side beyond the stuffed animal?": "Yes",
        "Is the leash placed around the leg of the furniture near the stuffed animal?": "Yes",
        "Is the stuffed animal positioned to the left of the labradoodle?": "Yes"
    },
    "test_04543": {
        "Is the small black vulture positioned at the top of the silver metal pole?": "Yes",
        "Is the moon located between the two grouped cords and the single cord?": "Yes",
        "Are the three thin silver cords extending to both the left and right of the pole?": "Yes",
        "Is the vulture standing on top of the silver metal pole?": "Yes",
        "Are the cords extending from the pole positioned in different directions?": "Yes"
    },
    "test_04544": {
        "Is the rectangular building located on the left side of the image?": "Yes",
        "Is the wooden fence with blue, orange, and black planks on the far left side of the image?": "No",
        "Is the building with circular yellow lights located on the right side of the image?": "Yes",
        "Is the third building positioned behind the other two buildings?": "Yes",
        "Are there black metal railings on both sides of the sidewalk?": "Yes"
    },
    "test_04556": {
        "Is the eighteen wheeler facing the left side of the image?": "Yes",
        "Is the orange sign located in front of the cabin of the eighteen wheeler on the left side of the image?": "Yes",
        "Are the tires positioned on the flatbed casting a shadow toward the left side of the image?": "Yes",
        "Are the large black tires stacked on the flatbed of the eighteen wheeler?": "Yes",
        "Is the shadow cast by the eighteen wheeler directed towards the left side of the image?": "Yes"
    },
    "test_04558": {
        "Is the fire hydrant in the foreground of the image?": "Yes",
        "Are the banana trees positioned behind the fire hydrant?": "Yes",
        "Is the ray of sunlight coming from the left side of the image?": "Yes",
        "Is the fire hydrant positioned in front of the banana trees?": "Yes",
        "Are the banana trees taller than the fire hydrant?": "Yes"
    },
    "test_04596": {
        "Is the layer of cirrus clouds positioned in the center of the image?": "Yes",
        "Are the blue patches located between the clouds mostly to the right side of the image?": "Yes",
        "Is the partial view of the land visible towards the bottom of the image?": "Yes",
        "Are the cirrus clouds covering the entire view of the land below?": "No",
        "Is the gray cloudy sky above the layer of cirrus clouds?": "Yes"
    },
    "test_04609": {
        "Is the door located on the left side of the building in the image?": "Yes",
        "Are the reflections of parked cars visible on the right side of the second level windows?": "Yes",
        "Is the tree visible on the left side of the image?": "No",
        "Is the door located left to the windows on the first floor?": "Yes",
        "Are the parked cars reflected in the windows on the second level to the right?": "Yes"
    },
    "test_04619": {
        "Is the white marble coffee table positioned in the center of the image?": "Yes",
        "Are the brown leather armchairs with chrome legs located at the lower right corner?": "Yes",
        "Is the tall brick building visible outside the glass doors on the right side of the image?": "Yes",
        "Are the tan fabric armchairs positioned with their backs to the camera?": "Yes",
        "Is the white marble coffee table located in the center of the seating area?": "Yes"
    },
    "test_04628": {
        "Is the centipede drawn on the left side of the boulder?": "Yes",
        "Is the bush located in the middle portion of the boulder?": "Yes",
        "Are the small rocks lined up next to the bush on the boulder?": "Yes",
        "Is the small bush growing next to the centipede drawing on the boulder?": "Yes",
        "Are the small rocks lined up next to the bush?": "Yes"
    },
    "test_04644": {
        "Is the cat positioned on the right side of the image?": "Yes",
        "Is the branch running from the top left to the bottom right?": "No",
        "Are there any green plants surrounding the cat in the center of the image?": "Yes",
        "Is the branch obscuring part of the cat's face?": "Yes",
        "Are there any green leaves directly surrounding the cat in the grass?": "Yes"
    },
    "test_04648": {
        "Is the Santa statue positioned in the center of the turntable?": "Yes",
        "Is the small parrot located on the top left of the turntable?": "Yes",
        "Are the gray oblong speakers positioned on the front right and left sides of the turntable?": "Yes",
        "Is the Santa statue placed in the center of the turntable?": "Yes",
        "Is the small parrot on the left side of the turntable when looking from the front?": "Yes"
    },
    "test_04650": {
        "Is the blue ping pong table on the right side of the image?": "Yes",
        "Are the orange chairs leaning against the wall on the right side of the room?": "Yes",
        "Is the net on the left ping pong table black?": "Yes",
        "Are the orange chairs leaning against the black wall?": "Yes",
        "Is the net shared by both ping pong tables?": "No"
    },
    "test_04663": {
        "Is the tree positioned near the center of the image?": "Yes",
        "Is the blue BMW 430i parked on the left side of the tree?": "Yes",
        "Is the white labradoodle located on the right side of the tree?": "Yes",
        "Is the tree in front of the blue BMW?": "Yes",
        "Is the dog tied near the chain link fence?": "Yes"
    },
    "test_04679": {
        "Is the green dolphin statue positioned in the center of the image?": "Yes",
        "Is the large brown rock behind the statue in the middle of the fountain?": "Yes",
        "Are the palm trees located at the top of the image?": "Yes",
        "Is the dolphin statue positioned above a square shaped stone slab base?": "Yes",
        "Are there palm trees surrounding the fountain area?": "Yes"
    },
    "test_04696": {
        "Is the golden pony with golden blonde hair placed above the light yellow pony with light blue hair?": "Yes",
        "Is the bright yellow pony with lavender hair and tail located at the bottom right of the image?": "Yes",
        "Are there two small light green leaves placed between the light blue pony with dark blue hair and the light blue pony with yellow and light blue hair?": "Yes",
        "Are there leaves between the light blue pony with dark blue hair and the light blue pony with yellow and light blue hair?": "Yes",
        "Is the tiny light yellow pony lying on the twig next to the golden pony?": "Yes"
    },
    "test_04700": {
        "Is the barber's pole positioned on the right side of the image?": "Yes",
        "Is the white surveillance camera above the barber's pole?": "Yes",
        "Are the windows below the white wall?": "Yes",
        "Is the barber's pole inside the glass tube held by a rusty bracket on the wall?": "Yes",
        "Is the surveillance camera attached to the wall looking toward the windows?": "No"
    },
    "test_04703": {
        "Are the royal blue flowers positioned towards the center of the image?": "Yes",
        "Is the rusted circle-shaped drain lid towards the bottom left of the image?": "Yes",
        "Are the dried-up leaves and grass roots surrounding the rusted lid?": "Yes",
        "Are the royal blue flowers located near the center of the greenery?": "Yes",
        "Is the rusted drain lid surrounded by dried up leaves and grass roots?": "Yes"
    },
    "test_04704": {
        "Is the shortest sign in the center of the image?": "Yes",
        "Is the tallest sign on the left side of the image?": "Yes",
        "Is the sign on the right on a green post?": "Yes",
        "Are all the signs bolted to their respective posts?": "Yes",
        "Is the sign on the right taller than the sign in the center?": "Yes"
    },
    "test_04707": {
        "Is the large rectangular opening located above the center of the doorway?": "Yes",
        "Is the dirt trail leading directly to the barn visible in the image?": "Yes",
        "Are gray clouds visible above the treeline at the top of the image?": "Yes",
        "Is the dirt trail leading to the barn doorway?": "Yes",
        "Are the large gray clouds positioned above the treeline?": "Yes"
    },
    "test_04725": {
        "Is the inflatable waving tube man positioned in front of the metal yellow stairs?": "Yes",
        "Are the two yellow concrete parking bollards positioned on either side of the tube man?": "Yes",
        "Is the shadow on the glass door partially behind the inflatable tube man?": "Yes",
        "Is the inflatable tube man positioned between the yellow concrete bollards?": "Yes",
        "Do both the stairs and the wheelchair ramp lead to the same platform in front of the building?": "Yes"
    },
    "test_04729": {
        "Is the baboon figure positioned in the center of the image?": "Yes",
        "Are the green plants located in front of the stone wall?": "Yes",
        "Is the field of green grass behind the stone wall?": "Yes",
        "Is the baboon sculpture on top of the white irregular-shaped base?": "Yes",
        "Is the stone wall located behind the green plants?": "Yes"
    },
    "test_04738": {
        "Is the statue in the center of the ferns?": "Yes",
        "Are the large stones at the upper edge of the image?": "Yes",
        "Are the legs on the left side of the stones?": "Yes",
        "Are the ferns partially covering the statue?": "Yes",
        "Are the legs facing away from the stones?": "Yes"
    },
    "test_04747": {
        "Are the raccoon footprints moving from the right to the left of the image?": "Yes",
        "Is the plant located towards the right side of the image?": "Yes",
        "Are the random lines located towards the bottom of the image?": "Yes",
        "Are the raccoon footprints moving toward the plant?": "Yes",
        "Are the markings in the sand separate from the raccoon footprints?": "Yes"
    },
    "test_04748": {
        "Is the moon positioned in the upper part of the image?": "Yes",
        "Are the trees located at the bottom of the image?": "Yes",
        "Is the sky darker further away from the moon?": "Yes",
        "Are the trees positioned below the moon?": "Yes",
        "Does the sky appear darker as it gets farther from the moon?": "Yes"
    },
    "test_04770": {
        "Are the skyscrapers positioned on the left side of the image?": "Yes",
        "Is the bridge located below the center of the image?": "Yes",
        "Does the river curve from the bottom right to the top right of the image?": "Yes",
        "Are the water droplets on the window in front of the view of the skyscrapers?": "Yes",
        "Is the river located below the bridge in the image?": "Yes"
    },
    "test_04781": {
        "Is the half moon positioned in the center of the image?": "Yes",
        "Is the largest altocumulus cloud on the left side of the image?": "No",
        "Are the two partially visible altocumulus clouds along the left side of the image?": "Yes",
        "Is the largest cloud on the right side of the image surrounding the moon?": "Yes",
        "Are there altocumulus clouds on both the top and bottom left sides of the moon?": "Yes"
    },
    "test_04782": {
        "Is the Bumblebee positioned in the center of the image?": "Yes",
        "Is the bloom without petals slightly above the bee and to the right of the top left corner bloom?": "Yes",
        "Are there leaves facing the viewer in the bottom right corner of the image?": "Yes",
        "Is the bumblebee on the center of the Ragwort flower?": "Yes",
        "Is the bloom in the top left corner facing away from the bumblebee?": "Yes"
    },
    "test_04834": {
        "Is the cat positioned on a white rug with patterns?": "Yes",
        "Is the light-gray hardwood floor to the left of the cat?": "No",
        "Are the brown chair legs around and behind the cat?": "Yes",
        "Is the cat on the white rug?": "Yes",
        "Are the brown chair legs positioned around the cat?": "Yes"
    },
    "test_04839": {
        "Is the top fish facing left?": "Yes",
        "Is the sculpture standing on a midnight blue illuminated stand?": "Yes",
        "Are there people visible in the far background?": "Yes",
        "Are the two fish facing opposite directions?": "Yes",
        "Is the sculpture standing on an illuminated stand?": "Yes"
    },
    "test_04850": {
        "Is the goat statue facing towards the viewer in the image?": "Yes",
        "Is the LUXOR pyramid positioned behind the goat statue?": "Yes",
        "Is the road visible on the left edge of the frame?": "No",
        "Is the pharaoh statue in front of the goat statue's chest?": "Yes",
        "Is the parking lot to the left of the statue?": "Yes"
    },
    "test_04871": {
        "Is the tire positioned in the middle of the image?": "Yes",
        "Is sunlight reflecting off the top right edge of the tire?": "No",
        "Are there dirt patches visible throughout the grass surface?": "Yes",
        "Is there a crack surrounding the hole in the middle of the tire?": "Yes",
        "Are there small holes creating a circle around the crack on the tire?": "Yes"
    },
    "test_04881": {
        "Are the roads positioned between the homes in the image?": "Yes",
        "Is the large patch of green bushy trees located towards the top left corner of the image?": "Yes",
        "Are the homes surrounded by trees in the image?": "Yes",
        "Are there roads connecting the homes to each other?": "Yes",
        "Is there a large patch of trees among the homes towards the top left corner?": "Yes"
    },
    "test_04928": {
        "Is the Tesla parked facing forward towards a curb with tan gravel?": "Yes",
        "Is the text \"NO PARKING\" on the red fire lane background visible to the left of the Tesla?": "No",
        "Is the grassy field and black metal fencing behind the Tesla?": "Yes",
        "Is the Tesla facing towards the curb with tan gravel?": "Yes",
        "Is the grassy field located behind the Tesla?": "Yes"
    },
    "test_04961": {
        "Is the wallet positioned on top of the ice pile?": "Yes",
        "Is the shade visible on the bottom portion of the ice pile?": "Yes",
        "Is the grass surrounding the ice pile unkempt?": "Yes",
        "Is the ice pile surrounded by grass?": "Yes"
    },
    "test_04963": {
        "Is the green toy monster truck positioned at the bottom of the slide?": "No",
        "Is the pink-blurred object appearing below the toy truck in the image?": "Yes",
        "Is the dried patch of grass located at the bottom of the image?": "Yes",
        "Is the toy truck moving on the slide?": "Yes",
        "Is the pink-blurred object under the truck?": "Yes"
    },
    "test_04975": {
        "Is the TV positioned at the center of the shelf?": "Yes",
        "Is the switch located to the right of the TV?": "Yes",
        "Are the books situated above the TV on the top edge of the shelf?": "Yes",
        "Is the TV screen inside the white shelf?": "Yes",
        "Are the books located above the TV screen?": "Yes"
    },
    "test_04984": {
        "Is the medium-sized bundle of wild carrot plants located in the upper right of the image?": "Yes",
        "Is the small bundle of wild carrot plants positioned at the bottom right of the image?": "Yes",
        "Is a bundle of wild carrot plants extending to the left side of the image?": "Yes",
        "Is the medium-sized bundle located at the upper right of the image?": "Yes",
        "Does the small bundle extend to the bottom right?": "Yes"
    },
    "test_04987": {
        "Is the brush balanced on the left edge of the wooden fence segment?": "No",
        "Are the large rusted metal tweezers positioned in the center of the concrete slab?": "Yes",
        "Is the metal post located to the right of the concrete slab?": "Yes",
        "Is the wooden brush balanced on the wooden fence?": "Yes",
        "Are the metal tweezers placed on the concrete slab?": "Yes"
    },
    "test_04988": {
        "Is the utility access cover positioned in the center of the image?": "Yes",
        "Are the dried leaves scattered around the utility cover?": "Yes",
        "Is the word \"ELECTRIC\" located in the inner circle of the cover?": "Yes",
        "Is the word \"ELECTRIC\" located inside the inner circle of the cover?": "Yes",
        "Are the pebbles and leaves found both on the cover and the surrounding sidewalk?": "Yes"
    },
    "test_04994": {
        "Is the bug facing towards the left of the image?": "Yes",
        "Are the white paws of the cat on the right side of the image?": "Yes",
        "Is the small piece of paper located to the left of the bug?": "Yes",
        "Is the bug positioned closer to the piece of paper than to the cat paws?": "Yes",
        "Is the shadow of the cat cast between the bug and the cat paws?": "Yes"
    },
    "test_04998": {
        "Is the rope positioned in the center of the image?": "No",
        "Are the circular ripples located in the upper right of the image?": "Yes",
        "Is the reflection of the trees located on the left side of the image?": "Yes",
        "Is the knot on the rope close to the surface of the water?": "Yes",
        "Is the reflection of the trees positioned below the clear sky's reflection in the water?": "No"
    }
}